#include "data.h"

#include "s.h"
#include <stdlib.h>

//里面其实是函数，但是是退出才调用的，暂时用不到
//不管
char dword_4B0000[] = { 0, 0, 0, 0, 0, 107, 71, 0, 63, 107, 71, 0, 126, 107, 71, 0, 189, 107, 71, 0, 223, 107, 71, 0, 53, 108, 71, 0 };
//用作上面的数据的结尾标志
//_PVFV dword_4B001C = 0x00000000;
////不管
int dword_4B001C = 0x00000000;
//不管
//这里的数据是函数，不过没有用到，用直接调用了
char First[] = { 0, 0, 0, 0, 238, 53, 74, 0, 181, 144, 74, 0, 203, 150, 74, 0, 91, 101, 74, 0 };
//用作上面的数据的结尾标志
//不管
int Last = 0;
//里面其实是函数，但是是退出才调用的，暂时用不到
//不管
int dword_4B0038 = (int)__endstdio;//不管
//用作上面的数据的结尾标志
//_PVFV dword_4B0040 = 0x00000000;
int dword_4B0040 = 0x00000000;
//里面其实是函数，但是是退出才调用的，暂时用不到
int dword_4B0044 = (int)sub_4A656C;
//用作上面的数据的结尾标志
//_PVFV dword_4B004C = 0x00000000;
int dword_4B004C = 0x00000000;//不管

//在_cinit函数内被调用
unk byte_4B0050[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ
//在_cinit函数内被调用，不过这个函数被我注释了，之后也没发现这个有上面用
//不管
CHAR byte_4B0060[] = { 131, 65, 131, 67, 131, 101, 131, 128, 130, 204, 130, 181, 130, 227, 130, 194, 130, 176, 130, 241, 0, 0, 0, 0 };//项目来源
//在_cinit函数内被调用，不过这个函数被我注释了，之后也没发现这个有上面用
//不管
unk byte_4B0078[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ
//不管//在_cinit函数内被调用
CHAR byte_4B0088[] = { 130, 221, 130, 169, 130, 189, 130, 199, 130, 164, 130, 181, 130, 204, 130, 160, 130, 189, 130, 232, 130, 205, 130, 241, 130, 196, 130, 162, 0, 0, 0, 0 };//视在同一方向上的估计
//不管//在_cinit函数内被调用
unk byte_4B00A8[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ
//不管//在_cinit函数内被调用
CHAR byte_4B00B8[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 130, 204, 130, 181, 130, 230, 130, 164, 0, 0, 0, 0 };//假象
//不管//在_cinit函数内被调用
CHAR byte_4B00D0[] = { 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 0, 0 };//木屑
//不管//在_cinit函数内被调用
unk byte_4B00DC[] = { 130, 200, 130, 181, 0, 130, 160, 130, 232, 0, 0, 0 };//なしあり
//不管//在_cinit函数内被调用
CHAR byte_4B00E8[] = { 130, 191, 130, 175, 130, 162, 131, 95, 131, 129, 129, 91, 131, 87, 0, 0 };//地形伤害
//不管//在_cinit函数内被调用
unk byte_4B00F8[] = { 130, 160, 130, 232, 0, 130, 200, 130, 181, 0, 0, 0 };//ありなし
//不管//在_cinit函数内被调用
CHAR byte_4B0104[] = { 130, 187, 130, 173, 130, 181, 130, 191, 130, 175, 130, 162, 0, 0, 0 };//测地仪


//？？？不懂
char byte_4B0113[] = { 0, 2, 2, 2, 2, 2, 1, 1, 2, 2, 0, 0 };
char byte_4B011F[] = { 0, 1, 1, 1, 1, 1, 2, 2, 1, 1, 0 };
char byte_4B012A[] = { 0, 0, 0, 1, 2, 3, 4, 5, 6, 3, 7, 8, 10, 9, 11, 12, 13, 14, 15, 3, 0, 0, 1, 2, 3, 4, 5, 6, 0, 0, 7, 8, 0, 0, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 1, 2, 0, 0, 21, 22, 23, 24, 25, 26, 0, 0, 27, 28, 29, 30 };


//没有被用到的变量，不过猜测是文件名
//CHAR aGraphic02dppal[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal = 0x005f5154 "Graphic\\%02dpPalette.bin"
//没有被用到的变量，不过猜测是文件名
//CHAR aStageHitwav02d[] = {115, 116, 97, 103, 101, 92, 104, 105, 116, 119, 97, 118, 37, 48, 50, 100, 46, 119, 97, 118, 0, 0, 0, 0};//aStageHitwav02d = 0x005f5170 "stage\\hitwav%02d.wav"


//char a3d3d[] = {37, 51, 100, 44, 37, 51, 100, 0};//a3d3d = 0x005f5188 "%3d,%3d"
CHAR byte_4B01A4[] = { 130, 221, 130, 183, 130, 184, 0, 0 };//byte_4B01A4 = 0x005f5190 "傒偡偢"细目//美铃
CHAR aGraphicMisuzuB[] = { 71, 114, 97, 112, 104, 105, 99, 92, 109, 105, 115, 117, 122, 117, 46, 98, 109, 112, 0, 0 };//aGraphicMisuzuB = 0x005f5198 "Graphic\\misuzu.bmp"//Graphic\misuzu.bmp//美铃资源
CHAR aStageSodokuWav[] = { 115, 116, 97, 103, 101, 92, 115, 111, 100, 111, 107, 117, 46, 119, 97, 118, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//aStageSodokuWav = 0x005f51ac "stage\\sodoku.wav"//stage\sodoku.wav
CHAR aS[] = { 37, 115, 0, 0, 130, 221, 130, 183, 130, 184, 0, 0, 37, 115, 0, 0, 37, 115, 0, 0 };//aS = 0x005f51c8 "%s"00		0x005f51cc,s	"傒偡偢"  %sみすず%s%s//%s美铃%s%s
CHAR String2[] = { 35, 68, 69, 70, 69, 78, 68, 0 };//String2 = 0x005f51dc "#DEFEND"//#DEFEND
CHAR aN[] = { 110, 0, 0, 0 };//aN = 0x005f51e4 "n"//n
CHAR aBasic[] = { 35, 66, 65, 83, 73, 67, 0, 0 };//aBasic = 0x005f51e8 "#BASIC"//#BASIC
CHAR aStatus[] = { 35, 83, 84, 65, 84, 85, 83, 0 };//aStatus = 0x005f51f0 "#STATUS"//#STATUS
CHAR aMes[] = { 35, 77, 69, 83, 0, 0, 0, 0 };//aMes = 0x005f51f8 "#MES"//#MES
CHAR aHelp[] = { 35, 72, 69, 76, 80, 0, 0, 0 };//aHelp = 0x005f5200 "#HELP"//#HELP
CHAR a1st[] = { 35, 49, 83, 84, 0, 0, 0, 0 };//a1st = 0x005f5208 "#1ST"//#1ST
CHAR a2nd[] = { 35, 50, 78, 68, 0, 0, 0, 0 };//a2nd = 0x005f5210 "#2ND"//#2ND
CHAR a3rd[] = { 35, 51, 82, 68, 0, 0, 0, 0 };//a3rd = 0x005f5218 "#3RD"//#3RD
CHAR aBiri[] = { 35, 66, 73, 82, 73, 0, 0, 0 };//aBiri = 0x005f5220 "#BIRI"//#BIRI
CHAR aSpMove[] = { 35, 83, 80, 95, 77, 79, 86, 69, 0, 0, 0, 0 };//aSpMove = 0x005f5228 "#SP_MOVE"//#SP_MOVE
CHAR aEtcSkill[] = { 35, 69, 84, 67, 95, 83, 75, 73, 76, 76, 0, 0 };//aEtcSkill = 0x005f5234 "#ETC_SKILL"//#ETC_SKILL
CHAR a2d[] = { 37, 50, 100, 0 };//a2d = 0x005f5240 "%2d"//%2d
//char aDserrAllocated[] = {68, 83, 69, 82, 82, 95, 65, 76, 76, 79, 67, 65, 84, 69, 68, 0};//aDserrAllocated = 0x005f5244 "DSERR_ALLOCATED"
//char aDserrControlun[] = {68, 83, 69, 82, 82, 95, 67, 79, 78, 84, 82, 79, 76, 85, 78, 65, 86, 65, 73, 76, 0, 0, 0, 0};//aDserrControlun = 0x005f5254 "DSERR_CONTROLUNAVAIL"
//char aDserrInvalidpa[] = {68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 0, 0};//aDserrInvalidpa = 0x005f526c "DSERR_INVALIDPARAM"
//char aDserrInvalidca[] = {68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 67, 65, 76, 76, 0, 0, 0};//aDserrInvalidca = 0x005f5280 "DSERR_INVALIDCALL"
//char aDserrGeneric[] = {68, 83, 69, 82, 82, 95, 71, 69, 78, 69, 82, 73, 67, 0, 0, 0};//aDserrGeneric = 0x005f5294 "DSERR_GENERIC"
//char aDserrPriolevel[] = {68, 83, 69, 82, 82, 95, 80, 82, 73, 79, 76, 69, 86, 69, 76, 78, 69, 69, 68, 69, 68, 0, 0, 0};//aDserrPriolevel = 0x005f52a4 "DSERR_PRIOLEVELNEEDED"
//char aDserrOutofmemo[] = {68, 83, 69, 82, 82, 95, 79, 85, 84, 79, 70, 77, 69, 77, 79, 82, 89, 0, 0, 0};//aDserrOutofmemo = 0x005f52bc "DSERR_OUTOFMEMORY"
//char aDserrBadformat[] = {68, 83, 69, 82, 82, 95, 66, 65, 68, 70, 79, 82, 77, 65, 84, 0};//aDserrBadformat = 0x005f52d0 "DSERR_BADFORMAT"
//char aDserrUnsupport[] = {68, 83, 69, 82, 82, 95, 85, 78, 83, 85, 80, 80, 79, 82, 84, 69, 68, 0, 0, 0};//aDserrUnsupport = 0x005f52e0 "DSERR_UNSUPPORTED"
//char aDserrNodriver[] = {68, 83, 69, 82, 82, 95, 78, 79, 68, 82, 73, 86, 69, 82, 0, 0};//aDserrNodriver = 0x005f52f4 "DSERR_NODRIVER"
//char aDserrAlreadyin[] = {68, 83, 69, 82, 82, 95, 65, 76, 82, 69, 65, 68, 89, 73, 78, 73, 84, 73, 65, 76, 73, 90, 69, 68, 0, 0, 0, 0};//aDserrAlreadyin = 0x005f5304 "DSERR_ALREADYINITIALIZED"
//char aDserrNoaggrega[] = {68, 83, 69, 82, 82, 95, 78, 79, 65, 71, 71, 82, 69, 71, 65, 84, 73, 79, 78, 0};//aDserrNoaggrega = 0x005f5320 "DSERR_NOAGGREGATION"
//char aDserrBufferlos[] = {68, 83, 69, 82, 82, 95, 66, 85, 70, 70, 69, 82, 76, 79, 83, 84, 0, 0, 0, 0};//aDserrBufferlos = 0x005f5334 "DSERR_BUFFERLOST"
//char aDserrOtherapph[] = {68, 83, 69, 82, 82, 95, 79, 84, 72, 69, 82, 65, 80, 80, 72, 65, 83, 80, 82, 73, 79, 0, 0, 0};//aDserrOtherapph = 0x005f5348 "DSERR_OTHERAPPHASPRIO"
//char aDserrUninitial[] = {68, 83, 69, 82, 82, 95, 85, 78, 73, 78, 73, 84, 73, 65, 76, 73, 90, 69, 68, 0};//aDserrUninitial = 0x005f5360 "DSERR_UNINITIALIZED"
//char aUnknownHresult[] = {85, 110, 107, 110, 111, 119, 110, 32, 72, 82, 69, 83, 85, 76, 84, 0};//aUnknownHresult = 0x005f5374 "Unknown HRESULT"
CHAR Caption[] = { 69, 82, 82, 79, 82, 33, 0, 0 };//Caption = 0x005f5384 "ERROR!"//ERROR!
//无法设置DS协调级别。
CHAR Text[] = { 130, 99, 130, 114, 139, 166, 146, 178, 131, 140, 131, 120, 131, 139, 130, 240, 144, 221, 146, 232, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aError_0[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_0 = 0x005f53b4 "ERROR"//ERROR
CHAR aDserrAllocated_0[] = { 68, 83, 69, 82, 82, 95, 65, 76, 76, 79, 67, 65, 84, 69, 68, 0 };//aDserrAllocated_0 = 0x005f53bc "DSERR_ALLOCATED"//DSERR_ALLOCATED
CHAR aError_1[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_1 = 0x005f53cc "ERROR"//ERROR
CHAR aDserrInvalidpa_0[] = { 68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 0, 0 };//aDserrInvalidpa_0 = 0x005f53d4 "DSERR_INVALIDPARAM"//DSERR_INVALIDPARAM
CHAR aError_2[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_2 = 0x005f53e8 "ERROR"//ERROR
CHAR aDserrUninitial_0[] = { 68, 83, 69, 82, 82, 95, 85, 78, 73, 78, 73, 84, 73, 65, 76, 73, 90, 69, 68, 0 };//aDserrUninitial_0 = 0x005f53f0 "DSERR_UNINITIALIZED"//DSERR_UNINITIALIZED
CHAR aError_3[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_3 = 0x005f5404 "ERROR"//ERROR
CHAR aDserrUnsupport_0[] = { 68, 83, 69, 82, 82, 95, 85, 78, 83, 85, 80, 80, 79, 82, 84, 69, 68, 0, 0, 0 };//aDserrUnsupport_0 = 0x005f540c "DSERR_UNSUPPORTED"//DSERR_UNSUPPORTED
CHAR aError_4[] = { 69, 82, 82, 79, 82, 33, 0, 0 };//aError_4 = 0x005f5420 "ERROR!"//ERROR!

//无法创建直接声音对象。
//CHAR byte_4B043C[] = { 131, 95, 131, 67, 131, 140, 131, 78, 131, 103, 131, 84, 131, 69, 131, 147, 131, 104, 131, 73, 131, 117, 131, 87, 131, 70, 131, 78, 131, 103, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };//无法创建直接声音对象。
CHAR byte_4B043C[] = "无法创建直接声音对象。";

//aS_2 = 0x005f5460 无法打开%s
//CHAR aS_2[] = {37, 115, 130, 240, 131, 73, 129, 91, 131, 118, 131, 147, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 0, 0, 0, 0};
//byte_4B0494 = 0x005f5480 无法加载数据
//CHAR byte_4B0494[] = { 131, 102, 129, 91, 131, 94, 130, 240, 131, 141, 129, 91, 131, 104, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 0, 0 };//无法加载数据
CHAR byte_4B0494[] = "无法加载数据";

//byte_4B04B4 = 0x005f54a0 无法创建DS缓冲区
CHAR byte_4B04B4[] = { 130, 99, 130, 114, 131, 111, 131, 98, 131, 116, 131, 64, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 0, 0 };//无法创建DS缓冲区

//声音对象的报错信息
CHAR aDserrAllocated_1[] = { 68, 83, 69, 82, 82, 95, 65, 76, 76, 79, 67, 65, 84, 69, 68, 0 };//aDserrAllocated_1 = 0x005f54c4 "DSERR_ALLOCATED"//已分配DSERR
CHAR aDserrBadformat_0[] = { 68, 83, 69, 82, 82, 95, 66, 65, 68, 70, 79, 82, 77, 65, 84, 0 };//aDserrBadformat_0 = 0x005f54d4 "DSERR_BADFORMAT"//DSERR错误格式
CHAR aDserrInvalidpa_1[] = { 68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 0, 0 };//aDserrInvalidpa_1 = 0x005f54e4 "DSERR_INVALIDPARAM"//DSERR无效参数
CHAR aDserrNoaggrega_0[] = { 68, 83, 69, 82, 82, 95, 78, 79, 65, 71, 71, 82, 69, 71, 65, 84, 73, 79, 78, 0 };//aDserrInvalidpa_1 = 0x005f54e4 "DSERR_INVALIDPARAM"//DSERR无汇总
CHAR aDserrOutofmemo_0[] = { 68, 83, 69, 82, 82, 95, 79, 85, 84, 79, 70, 77, 69, 77, 79, 82, 89, 0, 0, 0 };//aDserrNoaggrega_0 = 0x005f54f8 "DSERR_NOAGGREGATION"//DSERR内存不足
CHAR aDserrUninitial_1[] = { 68, 83, 69, 82, 82, 95, 85, 78, 73, 78, 73, 84, 73, 65, 76, 73, 90, 69, 68, 0 };//aDserrUninitial_1 = 0x005f5520 "DSERR_UNINITIALIZED"//DSERR未初始化
CHAR aDserrUnsupport_1[] = { 68, 83, 69, 82, 82, 95, 85, 78, 83, 85, 80, 80, 79, 82, 84, 69, 68, 0, 0, 0 };//aDserrUninitial_1 = 0x005f5520 "DSERR_UNINITIALIZED"//DSERR不受支持

//缓冲区锁定失败
CHAR byte_4B055C[] = { 131, 111, 131, 98, 131, 116, 131, 64, 130, 204, 131, 141, 131, 98, 131, 78, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0 };//byte_4B055C = 0x005f5548 "僶僢僼傽偺儘僢僋偵幐攕偟傑偟偨"




CHAR aDserrControlun_0[] = { 68, 83, 69, 82, 82, 95, 67, 79, 78, 84, 82, 79, 76, 85, 78, 65, 86, 65, 73, 76, 0, 0, 0, 0 };//aDserrControlun_0 = 0x005f5568 "DSERR_CONTROLUNAVAIL"//DSERR_CONTROLUNAVAIL
CHAR aDserrInvalidpa_2[] = { 68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 0, 0 };//aDserrInvalidpa_2 = 0x005f5580 "DSERR_INVALIDPARAM"//DSERR_INVALIDPARAM
CHAR aDserrPriolevel_0[] = { 68, 83, 69, 82, 82, 95, 80, 82, 73, 79, 76, 69, 86, 69, 76, 78, 69, 69, 68, 69, 68, 0, 0, 0 };//aDserrPriolevel_0 = 0x005f5594 "DSERR_PRIOLEVELNEEDED"//DSERR_PRIOLEVELNEEDED
CHAR byte_4B05C0[] = { 137, 185, 151, 202, 144, 221, 146, 232, 131, 71, 131, 137, 129, 91, 0, 0 };//byte_4B05C0 = 音量设置错误//音量设置错误
CHAR byte_4B05D0[] = { 142, 252, 148, 103, 144, 148, 144, 221, 146, 232, 131, 71, 131, 137, 129, 91, 0, 0, 0, 0 };//byte_4B05D0 = 频率设置错误//频率设置错误
CHAR aDserrControlun_1[] = { 68, 83, 69, 82, 82, 95, 67, 79, 78, 84, 82, 79, 76, 85, 78, 65, 86, 65, 73, 76, 0, 0, 0, 0 };//aDserrControlun_1 = 0x005f55d0 "DSERR_CONTROLUNAVAIL"//DSERR_CONTROLUNAVAIL
CHAR aDserrInvalidpa_3[] = { 68, 83, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 0, 0 };//aDserrInvalidpa_3 = 0x005f55e8 "DSERR_INVALIDPARAM"//DSERR_INVALIDPARAM
CHAR aDserrPriolevel_1[] = { 68, 83, 69, 82, 82, 95, 80, 82, 73, 79, 76, 69, 86, 69, 76, 78, 69, 69, 68, 69, 68, 0, 0, 0 };//aDserrPriolevel_1 = 0x005f55fc "DSERR_PRIOLEVELNEEDED"//DSERR_PRIOLEVELNEEDED
CHAR byte_4B0628[] = { 142, 252, 148, 103, 144, 148, 142, 230, 147, 190, 131, 71, 131, 137, 129, 91, 0, 0, 0, 0 };//byte_4B0628 = 0x005f5614 频率设置错误//频率获取错误
CHAR aError_5[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_5 = 0x005f5628 "ERROR"//ERROR
//找不到资源
CHAR byte_4B0644[] = { 131, 138, 131, 92, 129, 91, 131, 88, 130, 240, 146, 84, 130, 185, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 0, 0 };
CHAR aError_6[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_6 = 0x005f564c "ERROR"//ERROR
char byte_4B0668[] = { 5, 0 };//byte_4B0668 = 0x005f5654 "\x5"//
char byte_4B066A[] = { 255, 6, 0, 255, 6, 1, 255 };//no str
char byte_4B0671[] = { 3, 0, 255, 2, 0, 255, 4, 0, 255, 7, 0, 255, 7, 1, 255, 8, 255, 255, 9, 0, 255, 9, 4, 0, 10, 11, 0, 12, 0, 255, 10, 0, 255, 10, 1, 255, 0, 0, 0 };//no str
//unk byte_4B0698[] = { 130, 160, 130, 189, 130, 220, 130, 201, 130, 204, 130, 234, 0, 130, 173, 130, 221, 130, 201, 130, 177, 130, 162, 0, 0, 0, 130, 226, 130, 193, 130, 207, 130, 226, 130, 223, 0, 0, 0, 0 }; //byte_4B0698 = //来找你的麻烦，果然还是算了
//unk byte_4B06C0[] = { 130, 110, 130, 106, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 232, 130, 229, 130, 164, 130, 169, 130, 162, 0, 0, 0, 131, 128, 131, 138, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 132, 131, 95, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 160, 130, 237, 130, 196, 130, 241, 130, 200, 0, 0, 0, 130, 237, 130, 169, 130, 193, 130, 196, 130, 233, 0, 0, 0, 0, 0 };//byte_4B0698 = 没关系，我知道//ＯＫりょうかいムリヤダあわてんなわかってる
//四重奏
unk byte_4B0710[] = { 130, 160, 0, 130, 162, 0, 130, 164, 0, 130, 166, 0, 130, 168, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 220, 0, 130, 221, 0, 130, 222, 0, 130, 223, 0, 130, 224, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 226, 0, 129, 64, 0, 130, 228, 0, 129, 64, 0, 130, 230, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 231, 0, 130, 232, 0, 130, 233, 0, 130, 234, 0, 130, 235, 0, 130, 200, 0, 130, 201, 0, 130, 202, 0, 130, 203, 0, 130, 204, 0, 130, 237, 0, 129, 64, 0, 130, 240, 0, 129, 64, 0, 130, 241, 0, 130, 159, 0, 130, 161, 0, 130, 163, 0, 130, 165, 0, 130, 167, 0, 130, 193, 0, 130, 225, 0, 130, 227, 0, 130, 229, 0, 129, 64, 0, 131, 65, 0, 131, 67, 0, 131, 69, 0, 131, 71, 0, 131, 73, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 131, 74, 0, 131, 76, 0, 131, 78, 0, 131, 80, 0, 131, 82, 0, 131, 125, 0, 131, 126, 0, 131, 128, 0, 131, 129, 0, 131, 130, 0, 131, 84, 0, 131, 86, 0, 131, 88, 0, 131, 90, 0, 131, 92, 0, 131, 132, 0, 129, 64, 0, 131, 134, 0, 129, 64, 0, 131, 136, 0, 131, 94, 0, 131, 96, 0, 131, 99, 0, 131, 101, 0, 131, 103, 0, 131, 137, 0, 131, 138, 0, 131, 139, 0, 131, 140, 0, 131, 141, 0, 131, 105, 0, 131, 106, 0, 131, 107, 0, 131, 108, 0, 131, 109, 0, 131, 143, 0, 129, 64, 0, 131, 146, 0, 129, 64, 0, 131, 147, 0, 131, 64, 0, 131, 66, 0, 131, 68, 0, 131, 70, 0, 131, 72, 0, 131, 98, 0, 131, 131, 0, 131, 133, 0, 131, 135, 0, 129, 64, 0 };//あいうえおはひふへほかきくけこまみむめもさしすせそや　ゆ　よたちつてとらりるれろなにぬねのわ　を　んぁぃぅぇぉっゃゅょ　アイウエオハヒフヘホカキクケコマミムメモサシスセソヤ　ユ　ヨタチツテトラリルレロナニヌネノワ　ヲ　ンァィゥェォッャュョ　
//CHAR a2dD[] = { 37, 50, 100, 44, 32, 37, 100, 0 };//a2dD = 0x005f5868 "%2d, %d"//%2d, %d
//CHAR a3d[] = { 37, 51, 100, 0 };//a3d = 0x005f5870 "%3d"//%3d
CHAR byte_4B0884[] = { 147, 95, 0, 0 };//byte_4B0884 = 点//点
//CHAR a3d_5[] = { 37, 51, 100, 0 };//a3d_5 = 0x005f5878 "%3d"//%3d
CHAR byte_4B088C[] = { 147, 95, 0, 0 };//点//点
//CHAR aD_1[] = { 37, 100, 0, 0 };//aD_1 = 0x005f5880 "%d"//%d
//CHAR aD_2[] = { 37, 100, 0, 0 };//aD_2 = 0x005f5884 "%d"//%d
CHAR byte_4B0898[] = { 136, 202, 0, 0 };//byte_4B0898 = 0x005f36ec "埵"//位//位置
//CHAR a3d_6[] = { 37, 51, 100, 0 };//a3d_6 = 0x005f588c "%3d"//%3d
CHAR byte_4B08A0[] = { 147, 95, 0, 0 };//点//点
CHAR byte_4B08A4[] = { 136, 202, 0, 0 };//位//位置
//CHAR a2d_2[] = { 37, 50, 100, 0 };//a2d_2 = 0x005f5898 "%2d"//%2d
//CHAR byte_4B08AC[] = {130, 189, 130, 190, 130, 162, 130, 220, 130, 204, 130, 171, 130, 235, 130, 173, 0, 0, 0, 0};//byte_4B08AC = 0x005f3700 "偨偩偄傑偺偒傠偔"//现在的记录
//CHAR a3d_7[] = { 37, 51, 100, 0 };//a3d_7 = 0x005f58b0 "%3d"//%3d
//CHAR byte_4B08C4[] = { 144, 108, 0, 0 };//byte_4B08C4 = 0x005f3718 "恖"人//个人
//CHAR byte_4B08C8[] = {130, 179, 130, 162, 130, 177, 130, 164, 130, 171, 130, 235, 130, 173, 0, 0}; //byte_4B08C8 = 0x005f371c "偝偄偙偆偒傠偔"最高记录
//CHAR a3d_8[] = { 37, 51, 100, 0 };//a3d_8 = 0x005f58c8 "%3d"//%3d
//CHAR byte_4B08DC[] = { 144, 108, 0, 0 };//人//个人
CHAR aReplayBin[] = { 82, 101, 112, 108, 97, 121, 46, 98, 105, 110, 0, 0 };//aReplayBin = 0x005f58d0 "Replay.bin"//Replay.bin
wchar_t word_4B08EC[] = { 131, 116, 131, 64, 131, 67, 131, 139, 130, 204, 129, 64, 131, 141, 129, 91, 131, 104, 130, 201, 129, 64, 130, 181, 130, 193, 130, 207, 130, 162, 130, 181, 130, 220, 130, 181, 130, 189, 36, 49, 0, 0, 0, 0 };//加载文件$1
char aBoss02Wav[] = { 66, 111, 115, 115, 48, 50, 46, 119, 97, 118, 0, 0 };//aBoss02Wav = 0x005f58dc "Boss02.wav"//Boss02.wav
char aBoss03Wav[] = { 66, 111, 115, 115, 48, 51, 46, 119, 97, 118, 0, 0 };//aBoss03Wav = 0x005f5940 "Boss03.wav"//Boss03.wav
char aDoubledragonWa[] = { 68, 111, 117, 98, 108, 101, 68, 114, 97, 103, 111, 110, 46, 119, 97, 118, 0, 0, 0, 0 };//aDoubledragonWa = 0x005f594c "DoubleDragon.wav"//DoubleDragon.wav

//请选择角色<>中的角色><中的类型使用C按钮显示偏转技能><中的角色选择轮盘赌开始时未决定的角色随机决定
CHAR byte_4B0944[] = { 131, 76, 131, 131, 131, 137, 131, 78, 131, 94, 129, 91, 130, 240, 130, 185, 130, 241, 130, 189, 130, 173, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 129, 64, 60, 62, 130, 197, 131, 76, 131, 131, 131, 137, 130, 214, 130, 241, 130, 177, 130, 164, 129, 64, 62, 60, 130, 197, 131, 94, 131, 67, 131, 118, 130, 214, 130, 241, 130, 177, 130, 164, 129, 64, 130, 98, 131, 123, 131, 94, 131, 147, 130, 197, 130, 208, 130, 229, 130, 164, 130, 182, 130, 214, 130, 241, 130, 177, 130, 164, 129, 64, 130, 208, 130, 193, 130, 179, 130, 194, 130, 237, 130, 180, 130, 240, 129, 64, 130, 208, 130, 229, 130, 164, 130, 182, 130, 191, 130, 227, 130, 164, 129, 64, 62, 60, 130, 197, 129, 64, 130, 169, 130, 162, 130, 185, 130, 194, 130, 208, 130, 229, 130, 164, 130, 182, 129, 64, 131, 90, 131, 140, 131, 78, 131, 103, 130, 197, 131, 139, 129, 91, 131, 140, 131, 98, 131, 103, 130, 169, 130, 162, 130, 181, 129, 64, 131, 88, 131, 94, 129, 91, 131, 103, 130, 197, 129, 64, 130, 175, 130, 193, 130, 196, 130, 162, 130, 181, 130, 196, 130, 162, 130, 200, 130, 162, 131, 76, 131, 131, 131, 137, 129, 64, 131, 137, 131, 147, 131, 95, 131, 128, 130, 175, 130, 193, 130, 196, 130, 162, 0, 0 };//请选择角色在<>中的角色在><中用类型在C按钮中表示在<中选择角色在轮盘赌开始时没有决定的角色随机决定

//CHAR aD_3[] = { 37, 100, 62, 0 };//aD_3 = 0x005f5a54 "%d>"//%d>
CHAR aCharselWav[] = { 67, 104, 97, 114, 83, 101, 108, 46, 119, 97, 118, 0 };//aCharselWav = 0x005f5a58 "CharSel.wav"//CharSel.wav
//CHAR aFrameD[] = { 70, 82, 65, 77, 69, 58, 37, 100, 0, 0, 0, 0 };//aFrameD = 0x005f5a64 "FRAME:%d"//FRAME:%d
//CHAR aSpeed3d[] = { 83, 80, 69, 69, 68, 58, 37, 51, 100, 37, 37, 0 };//aSpeed3d = 0x005f5a70 "SPEED:%3d%%"//SPEED:%3d%%
CHAR aWinWav[] = { 87, 105, 110, 46, 119, 97, 118, 0 };//aWinWav = 0x005f5a7c "Win.wav"//Win.wav
CHAR aLoseWav[] = { 76, 111, 115, 101, 46, 119, 97, 118, 0, 0, 0, 0 };//aLoseWav = 0x005f5a84 "Lose.wav"//Lose.wav
CHAR aWinWav_0[] = { 87, 105, 110, 46, 119, 97, 118, 0 };//aWinWav_0 = 0x005f5a90 "Win.wav"//Win.wav
CHAR aLoseMisuzuWav[] = { 76, 111, 115, 101, 95, 109, 105, 115, 117, 122, 117, 46, 119, 97, 118, 0 };//aLoseMisuzuWav = 0x005f5a98 "Lose_misuzu.wav"//Lose_misuzu.wav
CHAR aLoseWav_0[] = { 76, 111, 115, 101, 46, 119, 97, 118, 0, 0, 0, 0 };//aLoseWav_0 = 0x005f5aa8 "Lose.wav"//Lose.wav
CHAR aMisuzuWin[] = { 77, 73, 83, 85, 90, 85, 32, 87, 73, 78, 33, 33, 0, 0, 0, 0 };//aMisuzuWin = 0x005f5ab4 "MISUZU WIN!!"//MISUZU WIN!!
CHAR aYourTeamWin[] = { 89, 79, 85, 82, 32, 84, 69, 65, 77, 32, 87, 73, 78, 33, 33, 0 };//aYourTeamWin = 0x005f5ac4 "YOUR TEAM WIN!!"//YOUR TEAM WIN!!
CHAR aYourTeamLose[] = { 89, 79, 85, 82, 32, 84, 69, 65, 77, 32, 76, 79, 83, 69, 46, 46, 46, 0, 0, 0 };//aYourTeamLose = 0x005f5ad4 "YOUR TEAM LOSE..."//YOUR TEAM LOSE...
//CHAR aDpWin[] = { 37, 100, 80, 32, 87, 73, 78, 33, 33, 0, 0, 0 };//aDpWin = 0x005f5ae8 "%dP WIN!!"//%dP WIN!!
//CHAR aDpTeamWin[] = { 37, 100, 80, 32, 84, 69, 65, 77, 32, 87, 73, 78, 33, 33, 0, 0 };//aDpTeamWin = 0x005f5af4 "%dP TEAM WIN!!"//%dP TEAM WIN!!
CHAR aCpuWin[] = { 67, 80, 85, 32, 87, 73, 78, 33, 33, 0, 0, 0 };//aCpuWin = 0x005f5b04 "CPU WIN!!"//CPU WIN!!
CHAR aCpuTeamWin[] = { 67, 80, 85, 32, 84, 69, 65, 77, 32, 87, 73, 78, 33, 33, 0, 0 };//aCpuTeamWin = 0x005f5b10 "CPU TEAM WIN!!"//CPU TEAM WIN!!
CHAR String[] = { 68, 82, 65, 87, 32, 71, 65, 77, 69, 0, 0, 0 };//String = 0x005f5b20 "DRAW GAME"//DRAW GAME
CHAR byte_4B0B10[] = { 130, 171, 130, 235, 130, 173, 130, 177, 130, 164, 130, 181, 130, 241, 129, 73, 129, 73, 0, 0 };//byte_4B0B10 = 0x005f3990 "偒傠偔偙偆偟傫両両"//记录更新！！
CHAR byte_4B0B24[] = { 131, 94, 131, 67, 131, 103, 131, 139, 130, 214, 130, 224, 130, 199, 130, 233, 0, 0, 0, 0 };//byte_4B0B24 = 0x005f39a4 "僞僀僩儖傊傕偳傞"//回到标题
CHAR byte_4B0B38[] = { 130, 179, 130, 162, 130, 181, 130, 229, 130, 169, 130, 231, 130, 179, 130, 162, 130, 185, 130, 162, 0, 0, 0, 0 };//byte_4B0B38 = 0x005f39b8 "偝偄偟傚偐傜偝偄偣偄"//自始至终

CHAR byte_4B0B50[] = { 131, 82, 131, 147, 131, 101, 131, 66, 131, 106, 131, 133, 129, 91, 0, 0 };//byte_4B0B50 = 0x005f39d0 "僐儞僥傿僯儏乕"//连续
CHAR byte_4B0B60[] = { 131, 88, 131, 101, 129, 91, 131, 87, 131, 90, 131, 140, 131, 78, 131, 103, 0, 0, 0, 0 };//byte_4B0B60 = 0x005f39e0 "僗僥乕僕僙儗僋僩"//舞台选择
CHAR byte_4B0B74[] = { 131, 76, 131, 131, 131, 137, 131, 78, 131, 94, 129, 91, 131, 90, 131, 140, 131, 78, 131, 103, 0, 0, 0, 0 };//byte_4B0B74 = 0x005f39f4 "僉儍儔僋僞乕僙儗僋僩"//角色选择


CHAR asc_4B0BA0[] = { 62, 62, 0, 0 };//asc_4B0BA0 = 0x005f5bb4 ">>"//>>
unk byte_4B0BA4[] = { 131, 130, 129, 91, 131, 104, 131, 90, 131, 140, 131, 78, 131, 103, 0, 0 };//暂时保留，命名重复//byte_4B0BA4 = 0x005f3a1c "儌乕僪僙儗僋僩"//模式选择
//byte_4B0BB4 = 0x005f3a38 //"僗僩乕儕乕儌乕僪"
//byte_4B0BB4 = ストーリーモードバトルモードサバイバルモードかちぬきかくとうコンフィグ ////故事模式战斗模式生存模式
unk byte_4B0BB4[] = { 131, 88, 131, 103, 129, 91, 131, 138, 129, 91, 131, 130, 129, 91, 131, 104, 0, 131, 111, 131, 103, 131, 139, 131, 130, 129, 91, 131, 104, 0, 131, 84, 131, 111, 131, 67, 131, 111, 131, 139, 131, 130, 129, 91, 131, 104, 0, 130, 169, 130, 191, 130, 202, 130, 171, 130, 169, 130, 173, 130, 198, 130, 164, 0, 131, 82, 131, 147, 131, 116, 131, 66, 131, 79, 0, 0, 0, 0, 0, 0 };
CHAR aMenuWav[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aMenuWav = 0x005f5c18 "Menu.wav"//Menu.wav
unk byte_4B0C10[] = { 130, 205, 130, 182, 130, 223, 130, 169, 130, 231, 0, 130, 194, 130, 195, 130, 171, 130, 169, 130, 231, 0, 0, 0 }; //byte_4B0C10 = 0x005f3a88 "偼偠傔偐傜"//はじめからつづきから//从头到尾
//byte_4B0C28 = 0x005f3aa0 "僉儍儔偣傫偨偔傊"
unk byte_4B0C28[] = { 131, 76, 131, 131, 131, 137, 130, 185, 130, 241, 130, 189, 130, 173, 130, 214, 0, 131, 96, 129, 91, 131, 128, 130, 185, 130, 193, 130, 196, 130, 162, 0, 130, 187, 130, 204, 130, 217, 130, 169, 130, 204, 130, 185, 130, 193, 130, 196, 130, 162, 0, 0 };//キャラせんたくへチームせっていそのほかのせってい
unk byte_4B0C5C[] = { 130, 80, 130, 111, 0, 130, 81, 130, 111, 0, 0, 0 }; //byte_4B0C5C = 0x005f3ad4 "侾俹"//１Ｐ２Ｐ
//byte_4B0C68 = 0x005f3ae0 "僾儗僀儎乕偵傫偢偆偑丂侾恖偺偲偒偼丂偣偭偰偄偱偒傑偣傫"
CHAR byte_4B0C68[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 201, 130, 241, 130, 184, 130, 164, 130, 170, 129, 64, 130, 80, 144, 108, 130, 204, 130, 198, 130, 171, 130, 205, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 0, 0 };//玩家只有一个人的时候不能设定
CHAR byte_4B0CA0[] = { 129, 170, 0, 0 }; //byte_4B0CA0 = 0x005f3b18 "仾"//↑
CHAR byte_4B0CA4[] = { 129, 171, 0, 0 };//byte_4B0CA4 = 0x005f3b1c "伀"//↓
CHAR asc_4B0CA8[] = { 62, 62, 0, 0 };//asc_4B0CA8 = 0x005f3b20 ">>"//>>
CHAR asc_4B0CAC[] = { 60, 45, 0, 0 };//asc_4B0CAC = 0x005f3b24 "<-"//<-
CHAR asc_4B0CB0[] = { 45, 62, 0, 0 };//asc_4B0CB0 = 0x005f3b28 "->"//->
//CHAR aDp_1[] = {37, 100, 80, 0};//aDp_1 = 0x005f5cc8 "%dP"
CHAR asc_4B0CB8[] = { 62, 62, 0, 0 };//asc_4B0CB8 = 0x005f5ccc ">>"//>>
CHAR aKb[] = { 75, 66, 0, 0 };//aKb = 0x005f5cd0 "KB"//KB
//CHAR aJsD[] = { 74, 83, 37, 100, 0, 0, 0, 0 };//aJsD = 0x005f5cd4 "JS%d"//JS%d
CHAR asc_4B0CC8[] = { 62, 62, 0, 0 };//asc_4B0CC8 = 0x005f5cdc ">>"//>>
CHAR aD[] = { 37, 100, 0, 0 };//aD = 0x005f5ce0 "%d"//%d
CHAR aUp[] = { 85, 80, 0, 0 };//aUp = 0x005f5ce4 "UP"//UP
CHAR aDo[] = { 68, 79, 0, 0 };//aDo = 0x005f5ce8 "DO"//DO
CHAR aLe[] = { 76, 69, 0, 0 };//aLe = 0x005f5cec "LE"//LE
CHAR aRi[] = { 82, 73, 0, 0 };//aRi = 0x005f5cf0 "RI"//RI
CHAR asc_4B0CE0[] = { 62, 62, 0, 0 };//asc_4B0CE0 = 0x005f5cf4 ">>"//>>
CHAR asc_4B0CE4[] = { 62, 62, 0, 0 };//asc_4B0CE4 = 0x005f5cf8 ">>"//>>
//CHAR aShowfpsD[] = {83, 104, 111, 119, 70, 80, 83, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aShowfpsD = 0x005f5cfc "ShowFPS = %d"
//CHAR aPutdamageD[] = {80, 117, 116, 68, 97, 109, 97, 103, 101, 32, 61, 32, 37, 100, 0, 0};//aPutdamageD = 0x005f5d0c "PutDamage = %d"
//CHAR aGamespeedD[] = {71, 97, 109, 101, 83, 112, 101, 101, 100, 32, 61, 32, 37, 100, 0, 0};//aGamespeedD = 0x005f5d1c "GameSpeed = %d"
//CHAR aHitstopD[] = {72, 105, 116, 83, 116, 111, 112, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aHitstopD = 0x005f5d2c "HitStop = %d"
//CHAR aSamecharD[] = {83, 97, 109, 101, 67, 104, 97, 114, 32, 61, 32, 37, 100, 0, 0, 0};//aSamecharD = 0x005f5d3c "SameChar = %d"
//CHAR aUseitemD[] = {85, 115, 101, 73, 116, 101, 109, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aUseitemD = 0x005f5d4c "UseItem = %d"








//开始
//CHAR aHitsameteamD[] = {72, 105, 116, 83, 97, 109, 101, 84, 101, 97, 109, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aHitsameteamD = 0x005f5d5c "HitSameTeam = %d"
//CHAR aUseweaponnumD[] = {85, 115, 101, 87, 101, 97, 112, 111, 110, 78, 117, 109, 32, 61, 32, 37, 100, 0, 0, 0};//aUseweaponnumD = 0x005f5d70 "UseWeaponNum = %d"
//CHAR aUsecombinemove[] = {85, 115, 101, 67, 111, 109, 98, 105, 110, 101, 77, 111, 118, 101, 32, 61, 32, 37, 100, 0};//aUsecombinemove = 0x005f5d84 "UseCombineMove = %d"
//CHAR aAttackbuttongu[] = {65, 116, 116, 97, 99, 107, 66, 117, 116, 116, 111, 110, 71, 117, 97, 114, 100, 32, 61, 32, 37, 100, 0, 0};//aAttackbuttongu = 0x005f5d98 "AttackButtonGuard = %d"
//CHAR aGrounddamageD[] = {71, 114, 111, 117, 110, 100, 68, 97, 109, 97, 103, 101, 32, 61, 32, 37, 100, 0, 0, 0};//aGrounddamageD = 0x005f5db0 "GroundDamage = %d"
//CHAR aBlackholetypeD[] = {66, 108, 97, 99, 107, 72, 111, 108, 101, 84, 121, 112, 101, 32, 61, 32, 37, 100, 0, 0};//aBlackholetypeD = 0x005f5dc4 "BlackHoleType = %d"
//CHAR aRandomselectfi[] = {82, 97, 110, 100, 111, 109, 83, 101, 108, 101, 99, 116, 70, 105, 103, 104, 116, 84, 121, 112, 101, 32, 61, 32, 37, 100, 0, 0};//aRandomselectfi = 0x005f5dd8 "RandomSelectFightType = %d"
//CHAR aSurvivalrecord[] = {83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 86, 101, 114, 121, 69, 97, 115, 121, 32, 61, 32, 37, 100, 0};//aSurvivalrecord = 0x005f5df4 "SurvivalRecordVeryEasy = %d"
//CHAR aSurvivalrecord_0[] = {83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 69, 97, 115, 121, 32, 61, 32, 37, 100, 0};//aSurvivalrecord_0 = 0x005f5e10 "SurvivalRecordEasy = %d"
//CHAR aSurvivalrecord_1[] = {83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 78, 111, 114, 109, 97, 108, 32, 61, 32, 37, 100, 0, 0, 0};//aSurvivalrecord_1 = 0x005f5e28 "SurvivalRecordNormal = %d"
//CHAR aSurvivalrecord_2[] = {83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 72, 97, 114, 100, 32, 61, 32, 37, 100, 0};//aSurvivalrecord_2 = 0x005f5e44 "SurvivalRecordHard = %d"
//CHAR aSurvivalrecord_3[] = {83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 86, 101, 114, 121, 72, 97, 114, 100, 32, 61, 32, 37, 100, 0};//aSurvivalrecord_3 = 0x005f5e5c "SurvivalRecordVeryHard = %d"
CHAR AppName[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//AppName = 0x005f5e78 "Config"//Config
//CHAR aGamenumD[] = {71, 97, 109, 101, 78, 117, 109, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aGamenumD = 0x005f5e80 "GameNum = %d"
//CHAR aIstagD[] = {73, 115, 84, 97, 103, 32, 61, 32, 37, 100, 0, 0};//aIstagD = 0x005f5e90 "IsTag = %d"
//CHAR aPlayernumD[] = {80, 108, 97, 121, 101, 114, 78, 117, 109, 32, 61, 32, 37, 100, 0, 0};//aPlayernumD = 0x005f5e9c "PlayerNum = %d"
//CHAR aIsuseitemD[] = {73, 115, 85, 115, 101, 73, 116, 101, 109, 32, 61, 32, 37, 100, 0, 0};//aIsuseitemD = 0x005f5eac "IsUseItem = %d"
//CHAR aWeaponnumD[] = {87, 101, 97, 112, 111, 110, 78, 117, 109, 32, 61, 32, 37, 100, 0, 0};//aWeaponnumD = 0x005f5ebc "WeaponNum = %d"
//CHAR aShowpointD[] = {83, 104, 111, 119, 80, 111, 105, 110, 116, 32, 61, 32, 37, 100, 0, 0};//aShowpointD = 0x005f5ecc "ShowPoint = %d"
//CHAR aGrounddamageD_0[] = {71, 114, 111, 117, 110, 100, 68, 97, 109, 97, 103, 101, 32, 61, 32, 37, 100, 0, 0, 0};//aGrounddamageD_0 = 0x005f5edc "GroundDamage = %d"
//CHAR aBlackholetypeD_0[] = {66, 108, 97, 99, 107, 72, 111, 108, 101, 84, 121, 112, 101, 32, 61, 32, 37, 100, 0, 0};//aBlackholetypeD_0 = 0x005f5ef0 "BlackHoleType = %d"
//CHAR aUsecombinemove_0[] = {85, 115, 101, 67, 111, 109, 98, 105, 110, 101, 77, 111, 118, 101, 32, 61, 32, 37, 100, 0};//aUsecombinemove_0 = 0x005f5f04 "UseCombineMove = %d"
//CHAR aHitsameteamD_0[] = {72, 105, 116, 83, 97, 109, 101, 84, 101, 97, 109, 32, 61, 32, 37, 100, 0, 0, 0, 0};//aHitsameteamD_0 = 0x005f5f18 "HitSameTeam = %d"
CHAR aKkconfig[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig = 0x005f5f2c "KKConfig"//KKConfig
//CHAR aFullscreenD[] = {70, 117, 108, 108, 83, 99, 114, 101, 101, 110, 32, 61, 32, 37, 100, 0};//aFullscreenD = 0x005f5f38 "FullScreen = %d"
//CHAR aBackgroundrunD[] = {66, 97, 99, 107, 71, 114, 111, 117, 110, 100, 82, 117, 110, 32, 61, 32, 37, 100, 0, 0};//aBackgroundrunD = 0x005f5f48 "BackGroundRun = %d"
//CHAR aVsyncwaitD[] = {86, 115, 121, 110, 99, 87, 97, 105, 116, 32, 61, 32, 37, 100, 0, 0};//aVsyncwaitD = 0x005f5f5c "VsyncWait = %d"
//CHAR aZoomD[] = {90, 111, 111, 109, 32, 61, 32, 37, 100, 0, 0, 0};//aZoomD = 0x005f5f6c "Zoom = %d"
CHAR aDirectdrawconf[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aDirectdrawconf = 0x005f5f78 "DirectDrawConfig"//DirectDrawConfig
CHAR aError_7[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_7 = 0x005f5f8c "Error"//Error
CHAR aDirectdrawconf_4[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 143, 145, 130, 171, 141, 158, 130, 221, 142, 184, 148, 115, 0, 0, 0, 0 };//aDirectdrawconf_4 = 0x005f5f94 "DirectDrawConfig彂偒崬傒幐攕"//DirectDrawConfig写入失败
CHAR aInitdevice[] = { 73, 110, 105, 116, 68, 101, 118, 105, 99, 101, 0, 0 };//aInitdevice = 0x005f5fb4 "InitDevice"//InitDevice
//CHAR aDpD[] = { 37, 100, 80, 32, 61, 32, 37, 100, 0, 0, 0, 0 };//aDpD = 0x005f5fc0 "%dP = %d"//%dP = %d
CHAR aError_8[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_8 = 0x005f5fcc "Error"//Error
//设置文件写入失败
CHAR byte_4B0FC0[] = { 144, 221, 146, 232, 131, 116, 131, 64, 131, 67, 131, 139, 143, 145, 130, 171, 130, 177, 130, 221, 142, 184, 148, 115, 0, 0, 0, 0 };
CHAR aWeaponrate[] = { 87, 101, 97, 112, 111, 110, 82, 97, 116, 101, 0, 0 };//aWeaponrate = 0x005f5ff0 "WeaponRate"//WeaponRate
//CHAR a02dD[] = { 37, 48, 50, 100, 32, 61, 32, 37, 100, 0, 0, 0 };//a02dD = 0x005f5ffc "%02d = %d"//%02d = %d
CHAR aError_9[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_9 = 0x005f6008 "Error"//Error
//设置文件写入失败
CHAR byte_4B0FFC[] = { 144, 221, 146, 232, 131, 116, 131, 64, 131, 67, 131, 139, 143, 145, 130, 171, 130, 177, 130, 221, 142, 184, 148, 115, 0, 0, 0, 0 };
//CHAR aJoystickassign[] = {74, 111, 121, 83, 116, 105, 99, 107, 65, 115, 115, 105, 103, 110, 37, 100, 80, 0, 0, 0};//aJoystickassign = 0x005f602c "JoyStickAssign%dP"
//CHAR aUpD[] = {85, 112, 32, 61, 32, 37, 100, 0};//aUpD = 0x005f6040 "Up = %d"
//CHAR aDownD[] = {68, 111, 119, 110, 32, 61, 32, 37, 100, 0, 0, 0};//aDownD = 0x005f6048 "Down = %d"
//CHAR aLeftD[] = {76, 101, 102, 116, 32, 61, 32, 37, 100, 0, 0, 0};//aLeftD = 0x005f6054 "Left = %d"
//CHAR aRightD[] = {82, 105, 103, 104, 116, 32, 61, 32, 37, 100, 0, 0};//aRightD = 0x005f6060 "Right = %d"
//CHAR aTriggerDD[] = {84, 114, 105, 103, 103, 101, 114, 37, 100, 32, 61, 32, 37, 100, 0, 0};//aTriggerDD = 0x005f606c "Trigger%d = %d"
//CHAR aSelectD[] = {83, 101, 108, 101, 99, 116, 32, 61, 32, 37, 100, 0};//aSelectD = 0x005f607c "Select = %d"
//CHAR aStartD[] = {83, 116, 97, 114, 116, 32, 61, 32, 37, 100, 0, 0};//aStartD = 0x005f6088 "Start = %d"
CHAR aError_10[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_10 = 0x005f6094 "Error"//Error
//设置文件写入失败
CHAR byte_4B1088[] = { 144, 221, 146, 232, 131, 116, 131, 64, 131, 67, 131, 139, 143, 145, 130, 171, 130, 177, 130, 221, 142, 184, 148, 115, 0, 0, 0, 0 };
//CHAR aKeyboardassign[] = {75, 101, 121, 66, 111, 97, 114, 100, 65, 115, 115, 105, 103, 110, 37, 100, 80, 0, 0, 0};//aKeyboardassign = 0x005f60b8 "KeyBoardAssign%dP"
//CHAR aUp3d[] = {85, 112, 32, 61, 32, 37, 51, 100, 0, 0, 0, 0};//aUp3d = 0x005f60cc "Up = %3d"
//CHAR aDown3d[] = {68, 111, 119, 110, 32, 61, 32, 37, 51, 100, 0, 0};//aDown3d = 0x005f60d8 "Down = %3d"


//开始
//CHAR aLeft3d[] = { 76, 101, 102, 116, 32, 61, 32, 37, 51, 100, 0, 0 };//aLeft3d = 0x005f60e4 "Left = %3d"//Left = %3d
//CHAR aRight3d[] = { 82, 105, 103, 104, 116, 32, 61, 32, 37, 51, 100, 0 };//aRight3d = 0x005f60f0 "Right = %3d"//Right = %3d
//CHAR aSelect3d[] = { 83, 101, 108, 101, 99, 116, 32, 61, 32, 37, 51, 100, 0, 0, 0, 0 };//aSelect3d = 0x005f60fc "Select = %3d"//Select = %3d
//CHAR aStart3d[] = { 83, 116, 97, 114, 116, 32, 61, 32, 37, 51, 100, 0 };//aStart3d = 0x005f610c "Start = %3d"//Start = %3d
//CHAR aTriggerD3d[] = { 84, 114, 105, 103, 103, 101, 114, 37, 100, 32, 61, 32, 37, 51, 100, 0 };//aTriggerD3d = 0x005f6118 "Trigger%d = %3d"//Trigger%d = %3d
//CHAR _KeyName[] = {83, 104, 111, 119, 70, 80, 83, 0};
CHAR _KeyName[] = "ShowFPS";
//CHAR aConfig_0[] = {67, 111, 110, 102, 105, 103, 0, 0};
CHAR aConfig_0[] = "Config";
//CHAR aPutdamage[] = {80, 117, 116, 68, 97, 109, 97, 103, 101, 0, 0, 0};
CHAR aPutdamage[] = "PutDamage";
//CHAR aConfig_1[] = {67, 111, 110, 102, 105, 103, 0, 0};
CHAR aConfig_1[] = "Config";
CHAR aGamespeed[] = { 71, 97, 109, 101, 83, 112, 101, 101, 100, 0, 0, 0 };//aGamespeed = 0x005f614c "GameSpeed"//GameSpeed
CHAR aConfig_2[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_2 = 0x005f6158 "Config"//Config
CHAR aHitstop[] = { 72, 105, 116, 83, 116, 111, 112, 0 };//aHitstop = 0x005f6160 "HitStop"//HitStop
CHAR aConfig_3[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_3 = 0x005f6168 "Config"//Config
CHAR aSamechar[] = { 83, 97, 109, 101, 67, 104, 97, 114, 0, 0, 0, 0 };//aSamechar = 0x005f6170 "SameChar"//SameChar
CHAR aConfig_4[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_4 = 0x005f617c "Config"//Config
CHAR aUseitem[] = { 85, 115, 101, 73, 116, 101, 109, 0 };//aUseitem = 0x005f6184 "UseItem"//UseItem
CHAR aConfig_5[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_5 = 0x005f618c "Config"//Config
CHAR aHitsameteam[] = { 72, 105, 116, 83, 97, 109, 101, 84, 101, 97, 109, 0 };//aHitsameteam = 0x005f6194 "HitSameTeam"//HitSameTeam
CHAR aConfig_6[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_6 = 0x005f61a0 "Config"//Config
CHAR aUseweaponnum[] = { 85, 115, 101, 87, 101, 97, 112, 111, 110, 78, 117, 109, 0, 0, 0, 0 };//aUseweaponnum = 0x005f61a8 "UseWeaponNum"//UseWeaponNum
CHAR aConfig_7[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_7 = 0x005f61b8 "Config"//Config
CHAR aAttackbuttongu_0[] = { 65, 116, 116, 97, 99, 107, 66, 117, 116, 116, 111, 110, 71, 117, 97, 114, 100, 0, 0, 0 };//aAttackbuttongu_0 = 0x005f61c0 "AttackButtonGuard"//AttackButtonGuard
CHAR aConfig_8[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_8 = 0x005f61d4 "Config"//Config
CHAR aUsecombinemove_1[] = { 85, 115, 101, 67, 111, 109, 98, 105, 110, 101, 77, 111, 118, 101, 0, 0 };//aUsecombinemove_1 = 0x005f61dc "UseCombineMove"//UseCombineMove
CHAR aConfig_9[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_9 = 0x005f61ec "Config"//Config
CHAR aGrounddamage[] = { 71, 114, 111, 117, 110, 100, 68, 97, 109, 97, 103, 101, 0, 0, 0, 0 };//aGrounddamage = 0x005f61f4 "GroundDamage"//GroundDamage
CHAR aConfig_10[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_10 = 0x005f6204 "Config"//Config
CHAR aBlackholetype[] = { 66, 108, 97, 99, 107, 72, 111, 108, 101, 84, 121, 112, 101, 0, 0, 0 };//aBlackholetype = 0x005f620c "BlackHoleType"//BlackHoleType
CHAR aConfig_11[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_11 = 0x005f621c "Config"//Config
CHAR aRandomselectfi_0[] = { 82, 97, 110, 100, 111, 109, 83, 101, 108, 101, 99, 116, 70, 105, 103, 104, 116, 84, 121, 112, 101, 0, 0, 0 };//aRandomselectfi_0 = 0x005f6224 "RandomSelectFightType"//RandomSelectFightType
CHAR aConfig_12[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_12 = 0x005f623c "Config"//Config
CHAR aSurvivalrecord_4[] = { 83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 86, 101, 114, 121, 69, 97, 115, 121, 0, 0 };//aSurvivalrecord_4 = 0x005f6244 "SurvivalRecordVeryEasy"//SurvivalRecordVeryEasy
CHAR aConfig_13[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_13 = 0x005f625c "Config"//Config
CHAR aSurvivalrecord_5[] = { 83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 69, 97, 115, 121, 0, 0 };//aSurvivalrecord_5 = 0x005f6264 "SurvivalRecordEasy"//SurvivalRecordEasy
CHAR aConfig_14[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_14 = 0x005f6278 "Config"//Config
CHAR aSurvivalrecord_6[] = { 83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 78, 111, 114, 109, 97, 108, 0, 0, 0, 0 };//aSurvivalrecord_6 = 0x005f6280 "SurvivalRecordNormal"//SurvivalRecordNormal
CHAR aConfig_15[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_15 = 0x005f6298 "Config"//Config
CHAR aSurvivalrecord_7[] = { 83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 72, 97, 114, 100, 0, 0 };//aSurvivalrecord_7 = 0x005f62a0 "SurvivalRecordHard"//SurvivalRecordHard
CHAR aConfig_16[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_16 = 0x005f62b4 "Config"//Config
CHAR aSurvivalrecord_8[] = { 83, 117, 114, 118, 105, 118, 97, 108, 82, 101, 99, 111, 114, 100, 86, 101, 114, 121, 72, 97, 114, 100, 0, 0 };//aSurvivalrecord_8 = 0x005f62bc "SurvivalRecordVeryHard"//SurvivalRecordVeryHard
CHAR aConfig_17[] = { 67, 111, 110, 102, 105, 103, 0, 0 };//aConfig_17 = 0x005f62d4 "Config"//Config
CHAR aGamenum[] = { 71, 97, 109, 101, 78, 117, 109, 0 };//aGamenum = 0x005f62dc "GameNum"//GameNum
CHAR aKkconfig_0[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_0 = 0x005f62e4 "KKConfig"//KKConfig
CHAR aIstag[] = { 73, 115, 84, 97, 103, 0, 0, 0 };//aIstag = 0x005f62f0 "IsTag"//IsTag
CHAR aKkconfig_1[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_1 = 0x005f62f8 "KKConfig"//KKConfig
CHAR aPlayernum[] = { 80, 108, 97, 121, 101, 114, 78, 117, 109, 0, 0, 0 };//aPlayernum = 0x005f6304 "PlayerNum"//PlayerNum
CHAR aKkconfig_2[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_2 = 0x005f6310 "KKConfig"//KKConfig
CHAR aIsuseitem[] = { 73, 115, 85, 115, 101, 73, 116, 101, 109, 0, 0, 0 };//aIsuseitem = 0x005f631c "IsUseItem"//IsUseItem
CHAR aKkconfig_3[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_3 = 0x005f6328 "KKConfig"//KKConfig
CHAR aWeaponnum[] = { 87, 101, 97, 112, 111, 110, 78, 117, 109, 0, 0, 0 };//aWeaponnum = 0x005f6334 "WeaponNum"//WeaponNum
CHAR aKkconfig_4[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_4 = 0x005f6340 "KKConfig"//KKConfig
CHAR aShowpoint[] = { 83, 104, 111, 119, 80, 111, 105, 110, 116, 0, 0, 0 };//aShowpoint = 0x005f634c "ShowPoint"//ShowPoint
CHAR aKkconfig_5[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_5 = 0x005f6358 "KKConfig"//KKConfig
CHAR aGrounddamage_0[] = { 71, 114, 111, 117, 110, 100, 68, 97, 109, 97, 103, 101, 0, 0, 0, 0 };//aGrounddamage_0 = 0x005f6364 "GroundDamage"//GroundDamage
CHAR aKkconfig_6[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_6 = 0x005f6374 "KKConfig"//KKConfig
CHAR aBlackholetype_0[] = { 66, 108, 97, 99, 107, 72, 111, 108, 101, 84, 121, 112, 101, 0, 0, 0 };//aBlackholetype_0 = 0x005f6380 "BlackHoleType"//BlackHoleType
CHAR aKkconfig_7[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_7 = 0x005f6390 "KKConfig"//KKConfig
CHAR aUsecombinemove_2[] = { 85, 115, 101, 67, 111, 109, 98, 105, 110, 101, 77, 111, 118, 101, 0, 0 };//aUsecombinemove_2 = 0x005f639c "UseCombineMove"//UseCombineMove
CHAR aKkconfig_8[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_8 = 0x005f63ac "KKConfig"//KKConfig
CHAR aHitsameteam_0[] = { 72, 105, 116, 83, 97, 109, 101, 84, 101, 97, 109, 0 };//aHitsameteam_0 = 0x005f63b8 "HitSameTeam"//HitSameTeam
CHAR aKkconfig_9[] = { 75, 75, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aKkconfig_9 = 0x005f63c4 "KKConfig"//KKConfig
CHAR aFullscreen[] = { 70, 117, 108, 108, 83, 99, 114, 101, 101, 110, 0, 0 };//aFullscreen = 0x005f63d0 "FullScreen"//FullScreen
CHAR aDirectdrawconf_0[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aDirectdrawconf_0 = 0x005f63dc "DirectDrawConfig"//DirectDrawConfig
CHAR aBackgroundrun[] = { 66, 97, 99, 107, 71, 114, 111, 117, 110, 100, 82, 117, 110, 0, 0, 0 };//aBackgroundrun = 0x005f63f0 "BackGroundRun"//BackGroundRun
CHAR aDirectdrawconf_1[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aDirectdrawconf_1 = 0x005f6400 "DirectDrawConfig"//DirectDrawConfig
CHAR aVsyncwait[] = { 86, 115, 121, 110, 99, 87, 97, 105, 116, 0, 0, 0 };//aVsyncwait = 0x005f6414 "VsyncWait"//VsyncWait
CHAR aDirectdrawconf_2[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aDirectdrawconf_2 = 0x005f6420 "DirectDrawConfig"//DirectDrawConfig
CHAR aZoom[] = { 90, 111, 111, 109, 0, 0, 0, 0 };//aZoom = 0x005f6434 "Zoom"//Zoom
CHAR aDirectdrawconf_3[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 67, 111, 110, 102, 105, 103, 0, 0, 0, 0 };//aDirectdrawconf_3 = 0x005f643c "DirectDrawConfig"//DirectDrawConfig
CHAR aWeaponrate_0[] = { 87, 101, 97, 112, 111, 110, 82, 97, 116, 101, 0, 0 };//aWeaponrate_0 = 0x005f6450 "WeaponRate"//WeaponRate
//CHAR a02d[] = { 37, 48, 50, 100, 0, 0, 0, 0 };//a02d = 0x005f645c "%02d"//%02d
CHAR aInitdevice_0[] = { 73, 110, 105, 116, 68, 101, 118, 105, 99, 101, 0, 0 };//aInitdevice_0 = 0x005f6464 "InitDevice"//InitDevice
//CHAR aDp[] = { 37, 100, 80, 0 };//aDp = 0x005f6470 "%dP"//%dP
//CHAR aJoystickassign_0[] = {74, 111, 121, 83, 116, 105, 99, 107, 65, 115, 115, 105, 103, 110, 37, 100, 80, 0, 0, 0};//aJoystickassign_0 = 0x005f6474 "JoyStickAssign%dP"
CHAR aUp_0[] = { 85, 112, 0, 0 };//aUp_0 = 0x005f6488 "Up"//Up
CHAR aDown[] = { 68, 111, 119, 110, 0, 0, 0, 0 };//aDown = 0x005f648c "Down"//Down
CHAR aLeft[] = { 76, 101, 102, 116, 0, 0, 0, 0 };//aLeft = 0x005f6494 "Left"//Left
CHAR aRight[] = { 82, 105, 103, 104, 116, 0, 0, 0 };//aRight = 0x005f649c "Right"//Right
CHAR aSelect[] = { 83, 101, 108, 101, 99, 116, 0, 0 };//aSelect = 0x005f64a4 "Select"//Select
CHAR aStart[] = { 83, 116, 97, 114, 116, 0, 0, 0 };//aStart = 0x005f64ac "Start"//Start
//CHAR aTriggerD[] = { 84, 114, 105, 103, 103, 101, 114, 37, 100, 0, 0, 0 };//aTriggerD = 0x005f64b4 "Trigger%d"//Trigger%d
//CHAR aKeyboardassign_0[] = { 75, 101, 121, 66, 111, 97, 114, 100, 65, 115, 115, 105, 103, 110, 37, 100, 80, 0, 0, 0 };//aKeyboardassign_0 = 0x005f64c0 "KeyBoardAssign%dP"//KeyBoardAssign%dP
CHAR aUp_1[] = { 85, 112, 0, 0 };//aUp_1 = 0x005f64d4 "Up"//Up
CHAR aDown_0[] = { 68, 111, 119, 110, 0, 0, 0, 0 };//aDown_0 = 0x005f64d8 "Down"//Down
CHAR aLeft_0[] = { 76, 101, 102, 116, 0, 0, 0, 0 };//aLeft_0 = 0x005f64e0 "Left"//Left
CHAR aRight_0[] = { 82, 105, 103, 104, 116, 0, 0, 0 };//aRight_0 = 0x005f64e8 "Right"//Right
CHAR aSelect_0[] = { 83, 101, 108, 101, 99, 116, 0, 0 };//aSelect_0 = 0x005f64f0 "Select"//Select
CHAR aStart_0[] = { 83, 116, 97, 114, 116, 0, 0, 0 };//aStart_0 = 0x005f64f8 "Start"//Start
//CHAR aTriggerD_0[] = { 84, 114, 105, 103, 103, 101, 114, 37, 100, 0, 0, 0 };//aTriggerD_0 = 0x005f6500 "Trigger%d"//Trigger%d
//char a3d_0[] = { 37, 51, 100, 0 };//a3d_0 = 0x005f650c "%3d"//%3d
CHAR aGraphicStagese[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 116, 97, 103, 101, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0 };//aGraphicStagese = 0x005f6510 "Graphic\\StageSelect.bmp"//Graphic\StageSelect.bmp
//CHAR aStageStage02dS[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 95, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0, 0 };//aStageStage02dS = 0x005f6528 "Stage\\Stage%02d_Select.bmp"//Stage\Stage%02d_Select.bmp
//CHAR aStageStage02dB[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 98, 109, 112, 0 };//aStageStage02dB = 0x005f6544 "Stage\\Stage%02d.bmp"//Stage\Stage%02d.bmp
CHAR aCharselWav_0[] = { 67, 104, 97, 114, 83, 101, 108, 46, 119, 97, 118, 0 };//aCharselWav_0 = 0x005f6558 "CharSel.wav"//CharSel.wav
CHAR byte_4B1550[] = { 131, 88, 131, 101, 129, 91, 131, 87, 129, 64, 131, 90, 131, 140, 131, 78, 131, 103, 0, 0 };//byte_4B1550 = 0x005f6564 "僗僥乕僕丂僙儗僋僩"//舞台选择
unk byte_4B1564[] = { 131, 137, 131, 147, 131, 95, 131, 128, 0, 0, 0, 0 };//byte_4B1564 = 0x005f40c8 "儔儞僟儉"//随机
//CHAR aS_3[] = { 37, 115, 0, 0 };//aS_3 = 0x005f6584 "%s"//%s
CHAR byte_4B1574[] = { 131, 88, 131, 101, 129, 91, 131, 87, 129, 64, 129, 64, 0, 0, 0, 0 };//byte_4B1574 = 0x005f40d8 "僗僥乕僕丂丂"//舞台
//CHAR a02d_0[] = { 37, 48, 50, 100, 0, 0, 0, 0 };//a02d_0 = 0x005f6598 "%02d"//%02d
//随机选择舞台
CHAR byte_4B158C[] = { 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 129, 64, 131, 88, 131, 101, 129, 91, 131, 87, 130, 170, 129, 64, 130, 185, 130, 241, 130, 189, 130, 173, 130, 179, 130, 234, 130, 220, 130, 183, 0, 0, 0, 0 };//随机选择舞台
CHAR aStageNameWav[] = { 115, 116, 97, 103, 101, 92, 110, 97, 109, 101, 46, 119, 97, 118, 0, 0, 0, 0, 0, 0 };//aStageNameWav = 0x005f65cc "stage\\name.wav"//stage\name.wav
CHAR aTitleWav[] = { 84, 105, 116, 108, 101, 46, 119, 97, 118, 0, 0, 0 };//aTitleWav = 0x005f65e0 "Title.wav"//Title.wav
CHAR byte_4B15D8[] = { 130, 176, 130, 241, 130, 180, 130, 162, 129, 64, 130, 177, 130, 164, 130, 182, 130, 191, 130, 227, 130, 164, 130, 197, 130, 183, 0, 0 };//byte_4B15D8 = 0x005f413c "偘傫偞偄丂偙偆偠偪傘偆偱偡"//现在正在施工

//CHAR byte_4B15F4[] = { 130, 179, 130, 162, 130, 178, 130, 204, 129, 64, 130, 208, 130, 198, 130, 232, 130, 201, 129, 64, 130, 200, 130, 233, 130, 220, 130, 197, 129, 64, 130, 189, 130, 189, 130, 169, 130, 164, 131, 130, 129, 91, 131, 104, 130, 197, 130, 183, 0, 0, 0, 0 };//是战斗到最后一个人的模式
//byte_4B1628 = 0x005f41c0 "俠儃僞儞傪丂偍偟側偑傜丂偗偭偰偄偡傞偲丂側側傔傫偦偐儌乕僪偵丂側傝傑偡"
//CHAR byte_4B1628[] = { 130, 98, 131, 123, 131, 94, 131, 147, 130, 240, 129, 64, 130, 168, 130, 181, 130, 200, 130, 170, 130, 231, 129, 64, 130, 175, 130, 193, 130, 196, 130, 162, 130, 183, 130, 233, 130, 198, 129, 64, 130, 200, 130, 200, 130, 223, 130, 241, 130, 187, 130, 169, 131, 130, 129, 91, 131, 104, 130, 201, 129, 64, 130, 200, 130, 232, 130, 220, 130, 183, 0, 0 };//按下C按钮进行判定的话，会变成平滑模式
//byte_4B1670 = 0x005f4208 "偨偩丂傂偨偡傜偵丂偨偨偐偄偮偯偗傞丂儌乕僪偱偡"
//CHAR byte_4B1670[] = { 130, 189, 130, 190, 129, 64, 130, 208, 130, 189, 130, 183, 130, 231, 130, 201, 129, 64, 130, 189, 130, 189, 130, 169, 130, 162, 130, 194, 130, 195, 130, 175, 130, 233, 129, 64, 131, 130, 129, 91, 131, 104, 130, 197, 130, 183, 0, 0 };//只是一味地持续战斗的模式
//byte_4B16A0 = 0x005f418c "俆偟傘傞偄偺丂側傫偄偳偐傜丂偊傜傇偙偲偑丂偱偒傑偡"
//CHAR byte_4B16A0[] = { 130, 84, 130, 181, 130, 227, 130, 233, 130, 162, 130, 204, 129, 64, 130, 200, 130, 241, 130, 162, 130, 199, 130, 169, 130, 231, 129, 64, 130, 166, 130, 231, 130, 212, 130, 177, 130, 198, 130, 170, 129, 64, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0 };//你可以从五种不同的地方选择
//byte_4B16D4 = 0x005f4238 "僠乕儉偱丂傆偔偡偆偐偄丂偨偨偐偄丂偝偄偟傘偆偰偒側丂偲偔偰傫偱"
//CHAR byte_4B16D4[] = { 131, 96, 129, 91, 131, 128, 130, 197, 129, 64, 130, 211, 130, 173, 130, 183, 130, 164, 130, 169, 130, 162, 129, 64, 130, 189, 130, 189, 130, 169, 130, 162, 129, 64, 130, 179, 130, 162, 130, 181, 130, 227, 130, 164, 130, 196, 130, 171, 130, 200, 129, 64, 130, 198, 130, 173, 130, 196, 130, 241, 130, 197, 0, 0 };//在团队中以复数形式进行
//byte_4B1714 = 0x005f4278 "備偆偟傚偆僠乕儉偑丂偗偭偰偄偡傞丂儌乕僪偱偡"
//CHAR byte_4B1714[] = { 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 131, 96, 129, 91, 131, 128, 130, 170, 129, 64, 130, 175, 130, 193, 130, 196, 130, 162, 130, 183, 130, 233, 129, 64, 131, 130, 129, 91, 131, 104, 130, 197, 130, 183, 0, 0, 0, 0 };//这是一种由团队决定的模式
//byte_4B1744 = 0x005f42a8 "偣偭偰偄傪丂傊傫偙偆偡傞偙偲偑丂偱偒傑偡"
//CHAR byte_4B1744[] = { 130, 185, 130, 193, 130, 196, 130, 162, 130, 240, 129, 64, 130, 214, 130, 241, 130, 177, 130, 164, 130, 183, 130, 233, 130, 177, 130, 198, 130, 170, 129, 64, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 };//可以更改设置
//byte_4B1770 = 0x005f42d4 "僶僩儖偵丂偝傫偐偡傞丂偝偄偩偄偵傫偢偆偲"
//CHAR byte_4B1770[] = { 131, 111, 131, 103, 131, 139, 130, 201, 129, 64, 130, 179, 130, 241, 130, 169, 130, 183, 130, 233, 129, 64, 130, 179, 130, 162, 130, 190, 130, 162, 130, 201, 130, 241, 130, 184, 130, 164, 130, 198, 0, 0, 0, 0 };//战斗中最重要的人
//byte_4B179C = 0x005f4300 "僾儗僀儎乕偲丂俠俹倀偺丂偵傫偢偆傪丂偒傔偰偔偩偝偄"
//CHAR byte_4B179C[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 198, 129, 64, 130, 98, 130, 111, 130, 116, 130, 204, 129, 64, 130, 201, 130, 241, 130, 184, 130, 164, 130, 240, 129, 64, 130, 171, 130, 223, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请决定玩家和CPU的同意
//byte_4B17D0 = 0x005f4334 "側傫偄偳傪丂偊傜傫偱丂偔偩偝偄"
//CHAR byte_4B17D0[] = { 130, 200, 130, 241, 130, 162, 130, 199, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 129, 64, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请给我看看
//byte_4B17F0 = 0x005f4354 "偡傋偰偺丂偣偭偰偄傪丂偟傘偆傝傚偆偟偰"
//CHAR byte_4B17F0[] = { 130, 183, 130, 215, 130, 196, 130, 204, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 240, 129, 64, 130, 181, 130, 227, 130, 164, 130, 232, 130, 229, 130, 164, 130, 181, 130, 196, 0, 0 };//完成所有设置
//byte_4B1818 = 0x005f437c "僉儍儔僋僞乕偣傫偨偔傊丂偡偡傒傑偡"
//CHAR byte_4B1818[] = { 131, 76, 131, 131, 131, 137, 131, 78, 131, 94, 129, 91, 130, 185, 130, 241, 130, 189, 130, 173, 130, 214, 129, 64, 130, 183, 130, 183, 130, 221, 130, 220, 130, 183, 0, 0 };//向角色选择前进
//byte_4B183C = 0x005f43a0 "僠乕儉偵傫偢偆傗丂僾儗僀儎乕偺丂偟傚偧偔偡傞僠乕儉傪丂偣偭偰偄偟傑偡"
//CHAR byte_4B183C[] = { 131, 96, 129, 91, 131, 128, 130, 201, 130, 241, 130, 184, 130, 164, 130, 226, 129, 64, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 204, 129, 64, 130, 181, 130, 229, 130, 188, 130, 173, 130, 183, 130, 233, 131, 96, 129, 91, 131, 128, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//设置团队成员或玩家的创作团队
//byte_4B1884 = 0x005f43e8 "傾僀僥儉偺偆傓傗丂傒偐偨偳偆偟偺丂偁偨傝偼傫偰偄傪丂偣偭偰偄偟傑偡"
//CHAR byte_4B1884[] = { 131, 65, 131, 67, 131, 101, 131, 128, 130, 204, 130, 164, 130, 222, 130, 226, 129, 64, 130, 221, 130, 169, 130, 189, 130, 199, 130, 164, 130, 181, 130, 204, 129, 64, 130, 160, 130, 189, 130, 232, 130, 205, 130, 241, 130, 196, 130, 162, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//设置项目的前后关系
//byte_4B18C8 = 0x005f4468 "僠乕儉偺偐偢偲丂偦傟偧傟偺丂僠乕儉偺偵傫偢偆傪丂偒傔偰偔偩偝偄丅"
//CHAR byte_4B18C8[] = { 131, 96, 129, 91, 131, 128, 130, 204, 130, 169, 130, 184, 130, 198, 129, 64, 130, 187, 130, 234, 130, 188, 130, 234, 130, 204, 129, 64, 131, 96, 129, 91, 131, 128, 130, 204, 130, 201, 130, 241, 130, 184, 130, 164, 130, 240, 129, 64, 130, 171, 130, 223, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 129, 66, 0, 0, 0, 0 };//请决定每个队的人选。
//byte_4B190C = 0x005f442c "偐偔僾儗僀儎乕偑丂偟傚偧偔偡傞丂僠乕儉傪丂偒傔偰偔偩偝偄丅"
//CHAR byte_4B190C[] = { 130, 169, 130, 173, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 170, 129, 64, 130, 181, 130, 229, 130, 188, 130, 173, 130, 183, 130, 233, 129, 64, 131, 96, 129, 91, 131, 128, 130, 240, 129, 64, 130, 171, 130, 223, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 129, 66, 0, 0 };//请决定这样的玩家的队伍。
//asc_4B1948 = 0x005f44ac "><偱丂僾儗僀儎乕傪丂偣傫偨偔偟偰丂<>偱丂僠乕儉偄偳偆"
//CHAR asc_4B1948[] = { 62, 60, 130, 197, 129, 64, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 240, 129, 64, 130, 185, 130, 241, 130, 189, 130, 173, 130, 181, 130, 196, 129, 64, 60, 62, 130, 197, 129, 64, 131, 96, 129, 91, 131, 128, 130, 162, 130, 199, 130, 164, 0, 0, 0, 0 };//在><中选择玩家，在<>中进行团队移动

//CHAR byte_4B1980[] = { 130, 196, 130, 171, 130, 240, 129, 64, 130, 189, 130, 168, 130, 181, 130, 189, 130, 198, 130, 171, 130, 201, 129, 64, 131, 65, 131, 67, 131, 101, 131, 128, 130, 170, 129, 64, 130, 181, 130, 227, 130, 194, 130, 176, 130, 241, 130, 183, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//确定当按下滴水器时是否出现项目

//CHAR byte_4B19CC[] = { 130, 168, 130, 200, 130, 182, 131, 96, 129, 91, 131, 128, 130, 204, 129, 64, 131, 76, 131, 131, 131, 137, 130, 201, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 130, 170, 129, 64, 130, 160, 130, 189, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//决定是否对同一组的角色进行攻击

//CHAR byte_4B1A14[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 130, 170, 129, 64, 130, 160, 130, 189, 130, 233, 130, 230, 130, 164, 130, 201, 129, 64, 130, 200, 130, 232, 130, 220, 130, 183, 0, 0, 0, 0 };//ON的话会受到攻击

//CHAR byte_4B1A48[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 130, 240, 129, 64, 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 130, 169, 129, 64, 130, 181, 130, 200, 130, 162, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//决定做还是不做

//CHAR byte_4B1A84[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//设置要使用的设备的值
//确定是否受到来自地形的伤害
//CHAR byte_4B1AB0[] = { 130, 191, 130, 175, 130, 162, 130, 169, 130, 231, 130, 204, 129, 64, 131, 95, 131, 129, 129, 91, 131, 87, 130, 240, 129, 64, 130, 164, 130, 175, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//确定是否受到来自地形的伤害
////确定是否启用边形
//CHAR byte_4B1AEC[] = { 130, 187, 130, 173, 130, 181, 130, 183, 130, 233, 130, 191, 130, 175, 130, 162, 130, 240, 129, 64, 130, 228, 130, 164, 130, 177, 130, 164, 130, 201, 130, 183, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定是否启用边形

//请看是从头开始还是从头开始
CHAR byte_4B1B2C[] = { 130, 179, 130, 162, 130, 181, 130, 229, 130, 169, 130, 231, 129, 64, 130, 205, 130, 182, 130, 223, 130, 233, 130, 204, 130, 169, 129, 64, 130, 194, 130, 195, 130, 171, 130, 169, 130, 231, 129, 64, 130, 205, 130, 182, 130, 223, 130, 233, 130, 204, 130, 169, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };

//CHAR byte_4B1B74[] = { 131, 118, 131, 140, 131, 67, 130, 201, 130, 241, 130, 184, 130, 164, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请看游戏人物

//CHAR byte_4B1B98[] = { 130, 189, 130, 189, 130, 169, 130, 164, 130, 169, 130, 162, 130, 183, 130, 164, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//设置多值函数

//CHAR byte_4B1BBC[] = { 130, 80, 131, 96, 129, 91, 131, 128, 130, 80, 144, 108, 130, 204, 129, 64, 131, 86, 131, 147, 131, 79, 131, 139, 131, 125, 131, 98, 131, 96, 130, 169, 0, 0, 0, 0 };//一队一人的单人比赛

//CHAR byte_4B1BE0[] = { 130, 80, 131, 96, 129, 91, 131, 128, 130, 81, 144, 108, 130, 204, 129, 64, 131, 94, 131, 98, 131, 79, 131, 125, 131, 98, 131, 96, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定一队两人的组合

//CHAR byte_4B1C14[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 204, 129, 64, 130, 201, 130, 241, 130, 184, 130, 164, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//设定玩家的同意

//CHAR byte_4B1C40[] = { 130, 204, 130, 177, 130, 232, 130, 205, 129, 64, 130, 98, 130, 111, 130, 116, 130, 170, 129, 64, 130, 189, 130, 241, 130, 198, 130, 164, 130, 181, 130, 220, 130, 183, 0, 0 };//剩下的是CPU

//CHAR byte_4B1C64[] = { 131, 76, 131, 131, 131, 137, 130, 170, 129, 64, 130, 189, 130, 168, 130, 179, 130, 234, 130, 189, 130, 160, 130, 198, 130, 201, 0, 0 };//角色被压制之后

//CHAR byte_4B1C80[] = { 131, 65, 131, 67, 131, 101, 131, 128, 130, 170, 129, 64, 130, 181, 130, 227, 130, 194, 130, 176, 130, 241, 130, 183, 130, 233, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//确定项目出现

//CHAR byte_4B1CB0[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 130, 212, 130, 171, 130, 204, 129, 64, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//设置要使用的设备的值

//CHAR byte_4B1CDC[] = { 130, 198, 130, 173, 130, 196, 130, 241, 130, 170, 129, 64, 130, 211, 130, 166, 130, 189, 130, 232, 129, 64, 130, 214, 130, 193, 130, 189, 130, 232, 130, 181, 130, 189, 130, 198, 130, 171, 130, 201, 0, 0, 0, 0 };//在得分增加或下降的时候

//CHAR byte_4B1D08[] = { 130, 187, 130, 204, 129, 64, 130, 183, 130, 164, 130, 191, 130, 240, 129, 64, 130, 208, 130, 229, 130, 164, 130, 182, 130, 183, 130, 233, 130, 169, 129, 64, 130, 181, 130, 200, 130, 162, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//决定是否表示那个数值

//CHAR byte_4B1D44[] = { 130, 191, 130, 175, 130, 162, 130, 169, 130, 231, 130, 204, 129, 64, 131, 95, 131, 129, 129, 91, 131, 87, 130, 240, 129, 64, 130, 164, 130, 175, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//确定是否受到来自地形的伤害

//CHAR byte_4B1D80[] = { 130, 187, 130, 173, 130, 181, 130, 183, 130, 233, 130, 191, 130, 175, 130, 162, 130, 240, 129, 64, 130, 228, 130, 164, 130, 177, 130, 164, 130, 201, 130, 183, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定是否启用边形

//CHAR byte_4B1DC0[] = { 130, 176, 130, 241, 130, 196, 130, 241, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 187, 130, 173, 130, 181, 130, 205, 130, 181, 130, 220, 130, 185, 130, 241, 130, 170, 129, 64, 130, 196, 130, 241, 130, 183, 130, 164, 130, 170, 129, 64, 130, 208, 130, 169, 130, 234, 130, 220, 130, 183, 0, 0, 0, 0 };//如果是原点的话，虽然不会加速，但是分数会被吸引

//CHAR byte_4B1E00[] = { 130, 185, 130, 193, 130, 196, 130, 162, 130, 240, 129, 64, 130, 181, 130, 227, 130, 164, 130, 232, 130, 229, 130, 164, 130, 181, 129, 64, 131, 96, 129, 91, 131, 128, 131, 90, 131, 140, 131, 78, 131, 103, 130, 214, 129, 64, 130, 183, 130, 183, 130, 221, 130, 220, 130, 183, 0, 0, 0, 0 };//将设置前进到量子团队选择

//CHAR byte_4B1E3C[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 130, 240, 129, 64, 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//决定是否要做什么

//CHAR byte_4B1E74[] = { 130, 168, 130, 200, 130, 182, 131, 96, 129, 91, 131, 128, 130, 199, 130, 164, 130, 181, 130, 204, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 130, 170, 129, 64, 130, 160, 130, 189, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//决定同一队之间的攻击是否有效

//CHAR byte_4B1EB8[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 170, 129, 64, 130, 211, 130, 173, 130, 183, 130, 164, 130, 204, 130, 198, 130, 171, 129, 64, 130, 199, 130, 204, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 170, 129, 64, 130, 199, 130, 204, 131, 96, 129, 91, 131, 128, 130, 201, 0, 0, 0, 0 };//玩家复数的时候哪个玩家对哪个队

//CHAR byte_4B1EF8[] = { 130, 181, 130, 229, 130, 188, 130, 173, 130, 183, 130, 233, 130, 204, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//设置是否为

CHAR byte_4B1F1C[] = { 130, 110, 130, 106, 129, 73, 0, 0 };//ＯＫ！
//CHAR aD_4[] = { 37, 100, 0, 0 };//aD_4 = 0x005f6f38 "%d"//%d
CHAR byte_4B1F28[] = { 130, 111, 0, 0 };//Ｐ
CHAR byte_4B1F2C[] = { 130, 98, 130, 111, 130, 116, 0, 0 };//ＣＰＵ
CHAR byte_4B1F34[] = { 130, 103, 130, 111, 0, 0, 0, 0 };//ＨＰ
//CHAR a3d_9[] = { 37, 51, 100, 0 };//a3d_9 = 0x005f6f50 "%3d"//%3d
//CHAR a08_0[] = { 48, 56, 0, 0, 0, 4, 0, 0 };//a08_0 = 0x005f6f54 "08"//08
//CHAR a3d_10[] = { 37, 51, 100, 0 };//a3d_10 = 0x005f6f5c "%3d"//%3d
//CHAR a09_0[] = { 48, 57, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0 };//a09_0 = 0x005f6f60 "09"//09
//CHAR a3d_11[] = { 37, 51, 100, 0 };//a3d_11 = 0x005f6f6c "%3d"//%3d
//CHAR a10_0[] = { 49, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//a10_0 = 0x005f6f70 "10"//10
//CHAR a3d_12[] = { 37, 51, 100, 0 };//a3d_12 = 0x005f6f7c "%3d"//%3d
//CHAR a1617[] = { 49, 54, 49, 55, 0, 0, 0, 0 };//a1617 = 0x005f6f80 "1617"//1617
//CHAR a3d_1[] = { 37, 51, 100, 0 };//a3d_1 = 0x005f6f88 "%3d"//%3d
//CHAR a0112[] = { 48, 49, 49, 50, 0, 0, 0, 3, 0, 0, 0, 0 };//a0112 = 0x005f6f8c "0112"//0112
//CHAR a3d_13[] = { 37, 51, 100, 0 };//a3d_13 = 0x005f6f98 "%3d"//%3d
//CHAR a1314[] = { 49, 51, 49, 52, 0, 0, 0, 5, 0, 0, 0, 0 };//a1314 = 0x005f6f9c "1314"//1314
//CHAR a3d_14[] = { 37, 51, 100, 0 };//a3d_14 = 0x005f6fa8 "%3d"//%3d
//CHAR a101617[] = { 49, 48, 49, 54, 49, 55, 0, 0, 0, 0, 0, 0 };//a101617 = 0x005f6fac "101617"//101617
//CHAR a3d_2[] = { 37, 51, 100, 0 };//a3d_2 = 0x005f6fb8 "%3d"//%3d
//CHAR a18[] = { 49, 56, 0, 0, 0, 0, 0, 0 };//a18 = 0x005f6fbc "18"//18
//CHAR a3d_3[] = { 37, 51, 100, 0 };//a3d_3 = 0x005f6fc4 "%3d"//%3d
//CHAR a1905[] = { 49, 57, 48, 53, 0, 0, 0, 7, 0, 0, 0, 0 };//a1905 = 0x005f6fc8 "1905"//1905
//CHAR a3d_15[] = { 37, 51, 100, 0 };//a3d_15 = 0x005f6fd4 "%3d"//%3d
CHAR byte_4B1FC4[] = { 129, 72, 129, 72, 129, 72, 129, 72, 0, 0, 0, 0 };//？？？？
CHAR byte_4B1FD0[] = { 129, 72, 129, 72, 129, 72, 129, 72, 0, 0, 0, 0 };//？？？？
CHAR aDevice[] = { 68, 69, 86, 73, 67, 69, 0, 0 };//aDevice = 0x005f6ff0 "DEVICE"//DEVICE
CHAR aUp_2[] = { 32, 32, 32, 32, 85, 80, 0, 0 };//aUp_2 = 0x005f6ff8 "    UP"//UP
CHAR aDown_1[] = { 32, 32, 68, 79, 87, 78, 0, 0 };//aDown_1 = 0x005f7000 "  DOWN"//DOWN
CHAR aLeft_1[] = { 32, 32, 76, 69, 70, 84, 0, 0 };//aLeft_1 = 0x005f7008 "  LEFT"//LEFT
CHAR aRight_1[] = { 32, 82, 73, 71, 72, 84, 0, 0 };//aRight_1 = 0x005f7010 " RIGHT"//RIGHT
CHAR aA[] = { 32, 32, 32, 32, 32, 65, 0, 0 };//aA = 0x005f7018 "     A"//A
CHAR aB[] = { 32, 32, 32, 32, 32, 66, 0, 0 };//aB = 0x005f7020 "     B"//B
CHAR aC[] = { 32, 32, 32, 32, 32, 67, 0, 0 };//aC = 0x005f7028 "     C"//C
CHAR aAB[] = { 32, 32, 32, 65, 43, 66, 0, 0 };//aAB = 0x005f7030 "   A+B"//A+B
CHAR aAC[] = { 32, 32, 32, 65, 43, 67, 0, 0 };//aAC = 0x005f7038 "   A+C"//A+C
CHAR aSelect_1[] = { 83, 69, 76, 69, 67, 84, 0, 0 };//aSelect_1 = 0x005f7040 "SELECT"//SELECT
CHAR aStart_1[] = { 32, 83, 84, 65, 82, 84, 0, 0 };//aStart_1 = 0x005f7048 " START"//START

CHAR byte_4B203C[] = { 130, 185, 130, 193, 130, 196, 130, 162, 130, 240, 129, 64, 130, 214, 130, 241, 130, 177, 130, 164, 130, 183, 130, 233, 129, 64, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请选择修改设置的玩家

CHAR byte_4B2078[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 131, 102, 131, 111, 131, 67, 131, 88, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请选择要使用的设备

CHAR byte_4B20A4[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 131, 123, 131, 94, 131, 147, 130, 240, 129, 64, 130, 168, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请按下要使用的按钮
CHAR byte_4B20CC[] = { 131, 82, 131, 147, 131, 116, 131, 66, 131, 79, 129, 64, 131, 129, 131, 106, 131, 133, 129, 91, 0, 0, 0, 0 };//配置菜单
CHAR byte_4B20E4[] = { 130, 101, 130, 111, 130, 114, 130, 204, 129, 64, 130, 208, 130, 229, 130, 164, 130, 182, 0, 0 };//FPS显示
CHAR aOn[] = { 79, 78, 0, 0 };//aOn = 0x005f710c "ON"//ON
CHAR off_4B20FC[] = { 79, 70, 70, 0 };//off_4B20FC = 0x005f7110 "OFF"//OFF
CHAR byte_4B2100[] = { 131, 81, 129, 91, 131, 128, 131, 88, 131, 115, 129, 91, 131, 104, 0, 0 };//游戏速度
CHAR a100[] = { 49, 48, 48, 37, 37, 0, 0, 0 };//a100 = 0x005f7124 "100%%"//100%%
CHAR a50[] = { 32, 53, 48, 37, 37, 0, 0, 0 };//a50 = 0x005f712c " 50%%"//50%%
CHAR a66[] = { 32, 54, 54, 37, 37, 0, 0, 0 };//a66 = 0x005f7134 " 66%%"//66%%
CHAR a75[] = { 32, 55, 53, 37, 37, 0, 0, 0 };//a75 = 0x005f713c " 75%%"//75%%
CHAR a80[] = { 32, 56, 48, 37, 37, 0, 0, 0 };//a80 = 0x005f7144 " 80%%"//80%%
CHAR a83[] = { 32, 56, 51, 37, 37, 0, 0, 0 };//a83 = 0x005f714c " 83%%"//83%%
CHAR a85[] = { 32, 56, 53, 37, 37, 0, 0, 0 };//a85 = 0x005f7154 " 85%%"//85%%
CHAR a87[] = { 32, 56, 55, 37, 37, 0, 0, 0 };//a87 = 0x005f715c " 87%%"//87%%
CHAR a88[] = { 32, 56, 56, 37, 37, 0, 0, 0 };//a88 = 0x005f7164 " 88%%"//88%%
CHAR a90[] = { 32, 57, 48, 37, 37, 0, 0, 0 };//a90 = 0x005f716c " 90%%"//90%%
CHAR byte_4B2160[] = { 131, 113, 131, 98, 131, 103, 131, 88, 131, 103, 131, 98, 131, 118, 0, 0 };//命中停止
CHAR aOn_0[] = { 79, 78, 0, 0 };//aOn_0 = 0x005f7184 "ON"//ON
CHAR off_4B2174[] = { 79, 70, 70, 0 };//off_4B2174 = 0x005f7188 "OFF"//OFF
CHAR byte_4B2178[] = { 130, 199, 130, 164, 131, 76, 131, 131, 131, 137, 130, 189, 130, 162, 130, 185, 130, 241, 0, 0 };//同角色对战
CHAR aOn_1[] = { 79, 78, 0, 0 };//aOn_1 = 0x005f71a0 "ON"//ON
CHAR off_4B2190[] = { 79, 70, 70, 0 }; //off_4B2190 = 0x005f71a4 "OFF"//OFF
CHAR byte_4B2194[] = { 131, 95, 131, 129, 129, 91, 131, 87, 130, 208, 130, 229, 130, 164, 130, 182, 0, 0, 0, 0 };//伤害表示
CHAR aOn_2[] = { 79, 78, 0, 0 };//aOn_2 = 0x005f71bc "ON"//ON
CHAR off_4B21AC[] = { 79, 70, 70, 0 };//off_4B21AC = 0x005f71c0 "OFF"//OFF
CHAR byte_4B21B0[] = { 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 0, 0 };//木屑
//CHAR aD_5[] = { 37, 100, 0, 0 };//aD_5 = 0x005f71d0 "%d"//%d
CHAR byte_4B21C0[] = { 130, 177, 130, 164, 130, 176, 130, 171, 131, 123, 131, 94, 131, 147, 131, 75, 129, 91, 131, 104, 0, 0, 0, 0 };//攻击按钮保护
CHAR aOn_3[] = { 79, 78, 0, 0 };//aOn_3 = 0x005f71ec "ON"//ON
CHAR off_4B21DC[] = { 79, 70, 70, 0 }; //off_4B21DC = 0x005f71f0 "OFF"//OFF
CHAR byte_4B21E0[] = { 131, 137, 131, 147, 131, 95, 131, 128, 130, 169, 130, 173, 130, 198, 130, 164, 131, 94, 131, 67, 131, 118, 0, 0 };//随机浮动类型
CHAR aOn_4[] = { 79, 78, 0, 0 };//aOn_4 = 0x005f720c "ON"//ON
CHAR off_4B21FC[] = { 79, 70, 70, 0 };//off_4B21FC = 0x005f7210 "OFF"//OFF
CHAR byte_4B2200[] = { 130, 212, 130, 171, 130, 204, 130, 181, 130, 227, 130, 194, 130, 176, 130, 241, 130, 232, 130, 194, 0, 0, 0, 0 };//挥发率
CHAR byte_4B2218[] = { 131, 76, 129, 91, 131, 82, 131, 147, 131, 116, 131, 66, 131, 79, 0, 0 };//键配置

CHAR byte_4B2228[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 101, 130, 111, 130, 114, 130, 240, 130, 208, 130, 229, 130, 164, 130, 182, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//如果设为ON，则表示FPS

///可以设定游戏速度
CHAR byte_4B2250[] = { 131, 81, 129, 91, 131, 128, 131, 88, 131, 115, 129, 91, 131, 104, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0 };//可以设定游戏速度

////如果设定为ON，则停止命中
CHAR byte_4B2274[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 131, 113, 131, 98, 131, 103, 131, 88, 131, 103, 131, 98, 131, 118, 130, 240, 129, 64, 130, 181, 130, 230, 130, 164, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//如果设定为ON，则停止命中

////如果设定为ON的话，可以用同样的角色来表示
CHAR byte_4B22A4[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 168, 130, 200, 130, 182, 131, 76, 131, 131, 131, 137, 130, 197, 129, 64, 130, 189, 130, 162, 130, 185, 130, 241, 130, 197, 130, 171, 130, 233, 130, 230, 130, 164, 130, 201, 129, 64, 130, 200, 130, 232, 130, 220, 130, 183, 0, 0, 0, 0 };//如果设定为ON的话，可以用同样的角色来表示

////ON表示伤害
CHAR byte_4B22E4[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 131, 95, 131, 129, 129, 91, 131, 87, 130, 240, 129, 64, 130, 208, 130, 229, 130, 164, 130, 182, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//ON表示伤害

//可以设置要使用的设备的值
CHAR byte_4B2310[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0 };//可以设置要使用的设备的值
//设为ON时，使用攻击按钮进行防护
CHAR byte_4B233C[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 131, 123, 131, 94, 131, 147, 130, 201, 130, 230, 130, 233, 129, 64, 131, 75, 129, 91, 131, 104, 130, 240, 129, 64, 130, 181, 130, 230, 130, 164, 130, 181, 130, 220, 130, 183, 0, 0 };//设为ON时，使用攻击按钮进行防护

//ON时随机决定角色时
CHAR byte_4B2378[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 131, 76, 131, 131, 131, 137, 130, 240, 129, 64, 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 129, 64, 130, 175, 130, 193, 130, 196, 130, 162, 130, 181, 130, 189, 130, 198, 130, 171, 0, 0, 0, 0 };//ON时随机决定角色时

//这样，我们就可以随机确定这些类型
CHAR byte_4B23B0[] = { 130, 169, 130, 173, 130, 198, 130, 164, 131, 94, 131, 67, 131, 118, 130, 224, 129, 64, 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 129, 64, 130, 175, 130, 193, 130, 196, 130, 162, 130, 179, 130, 234, 130, 233, 130, 230, 130, 164, 130, 201, 129, 64, 130, 200, 130, 232, 130, 220, 130, 183, 0, 0, 0, 0 };//这样，我们就可以随机确定这些类型

//你可以改变武器出现的概率，这个数据采集是日文版的，是错误的？？？？？
CHAR byte_4B23F0[] = { 130, 212, 130, 171, 130, 204, 129, 64, 130, 181, 130, 227, 130, 194, 130, 176, 130, 241, 130, 183, 130, 233, 129, 64, 130, 169, 130, 173, 130, 232, 130, 194, 130, 240, 129, 64, 130, 214, 130, 241, 130, 177, 130, 164, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 };

//进入关键配置模式
CHAR byte_4B2428[] = { 131, 76, 129, 91, 131, 82, 131, 147, 131, 116, 131, 66, 131, 79, 131, 130, 129, 91, 131, 104, 130, 201, 129, 64, 130, 164, 130, 194, 130, 232, 130, 220, 130, 183, 0, 0 };//进入关键配置模式
CHAR aGraphic02ppale[] = { 71, 114, 97, 112, 104, 105, 99, 92, 48, 50, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0 };//aGraphic02ppale = 0x005f7460 "Graphic\\02pPalette.bin"//Graphic\02pPalette.bin
//CHAR aGraphicBody02d[] = { 71, 114, 97, 112, 104, 105, 99, 92, 66, 111, 100, 121, 37, 48, 50, 100, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicBody02d = 0x005f7478 "Graphic\\Body%02d.bmp"//Graphic\Body%02d.bmp
CHAR aGraphic01ppale[] = { 71, 114, 97, 112, 104, 105, 99, 92, 48, 49, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0 };//aGraphic01ppale = 0x005f7490 "Graphic\\01pPalette.bin"//Graphic\01pPalette.bin
//CHAR aGraphicBody02d_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 66, 111, 100, 121, 37, 48, 50, 100, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicBody02d_0 = 0x005f74a8 "Graphic\\Body%02d.bmp"//Graphic\Body%02d.bmp
//CHAR aBgmS[] = { 66, 71, 77, 92, 37, 115, 0, 0 };//aBgmS = 0x005f74c0 "BGM\\%s"//BGM\%s
CHAR aLooppos[] = { 35, 76, 79, 79, 80, 80, 79, 83, 0, 0, 0, 0 };//aLooppos = 0x005f74c8 "#LOOPPOS"//#LOOPPOS
CHAR aDemoOpeningTxt[] = { 68, 101, 109, 111, 92, 79, 112, 101, 110, 105, 110, 103, 46, 116, 120, 116, 0, 0, 0, 0 };//aDemoOpeningTxt = 0x005f74d4 "Demo\\Opening.txt"//Demo\Opening.txt
CHAR byte_4B24D4[] = { 129, 74, 0, 0 };//byte_4B24D4 = 0x005f74e8 "丣"//`灬.°
CHAR byte_4B24D8[] = { 129, 75, 0, 0 };//゜
CHAR byte_4B24DC[] = { 129, 91, 0, 0 };//-什么
CHAR byte_4B24E0[] = { 131, 74, 131, 94, 131, 74, 131, 105, 0, 0, 0, 0 };//片假名
CHAR byte_4B24EC[] = { 130, 208, 130, 231, 130, 170, 130, 200, 0, 0, 0, 0 };//平假名
CHAR byte_4B24F8[] = { 130, 183, 130, 183, 130, 222, 0, 0 };//前进
CHAR byte_4B2500[] = { 130, 224, 130, 199, 130, 233, 0, 0 };//退席
CHAR byte_4B2508[] = { 130, 100, 130, 109, 130, 99, 0, 0 };//ＥＮＤ
CHAR byte_4B2510[] = { 146, 97, 144, 182, 147, 250, 0, 0 };//生日
CHAR byte_4B2518[] = { 140, 142, 0, 0 };//月份
CHAR byte_4B251C[] = { 147, 250, 0, 0 };//日期
CHAR byte_4B2520[] = { 129, 105, 129, 64, 129, 64, 129, 64, 129, 64, 141, 192, 129, 106, 0, 0 };//（座）
CHAR byte_4B2530[] = { 130, 175, 130, 194, 130, 166, 130, 171, 140, 94, 0, 0 };//血液型
CHAR byte_4B253C[] = { 140, 94, 0, 0 };//类型
//CHAR aDp_2[] = { 37, 100, 80, 0 };//aDp_2 = 0x005f7554 "%dP"//%dP

CHAR byte_4B2544[] = { 130, 179, 130, 241, 129, 64, 130, 200, 130, 220, 130, 166, 130, 240, 129, 64, 130, 201, 130, 227, 130, 164, 130, 232, 130, 229, 130, 173, 129, 64, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请输入酸名

CHAR byte_4B2570[] = { 130, 189, 130, 241, 130, 182, 130, 229, 130, 164, 130, 209, 130, 240, 129, 64, 130, 201, 130, 227, 130, 164, 130, 232, 130, 229, 130, 173, 129, 64, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请输入短期费用

CHAR byte_4B259C[] = { 130, 175, 130, 194, 130, 166, 130, 171, 130, 170, 130, 189, 130, 240, 129, 64, 130, 201, 130, 227, 130, 164, 130, 232, 130, 229, 130, 173, 129, 64, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请输入血液型

CHAR byte_4B25C8[] = { 130, 177, 130, 234, 130, 197, 129, 64, 130, 162, 130, 162, 130, 197, 130, 183, 130, 169, 129, 72, 0, 0, 0, 0 };//这样可以吗？

CHAR byte_4B25E0[] = { 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 130, 162, 130, 162, 130, 230, 129, 73, 129, 64, 129, 64, 130, 190, 130, 223, 130, 190, 129, 73, 0, 0, 0, 0 };//好啊！不行！
//CHAR aDp_3[] = { 37, 100, 80, 0 };//aDp_3 = 0x005f761c "%dP"//%dP

CHAR byte_4B260C[] = { 130, 179, 130, 241, 129, 64, 131, 73, 131, 138, 131, 87, 131, 105, 131, 139, 130, 204, 129, 64, 131, 76, 131, 131, 131, 137, 130, 240, 129, 64, 131, 71, 131, 102, 131, 66, 131, 98, 131, 103, 130, 181, 130, 220, 130, 183, 130, 169, 129, 72, 0, 0 };//要编辑原创角色吗？

CHAR byte_4B2640[] = { 130, 181, 130, 220, 130, 183, 129, 64, 129, 64, 129, 64, 130, 181, 130, 220, 130, 185, 130, 241, 0, 0, 0, 0 };//不，不
CHAR byte_4B2658[] = { 129, 64, 0, 0 };//　
unk byte_4B265C[] = { 129, 91, 0, 0 };//-什么
CHAR byte_4B2660[] = { 129, 64, 0, 0 };//　
CHAR byte_4B2664[] = { 129, 91, 0, 0 };//-什么
//CHAR a2d_3[] = { 37, 50, 100, 0 };//a2d_3 = 0x005f767c "%2d"//%2d
CHAR byte_4B266C[] = { 129, 64, 129, 64, 130, 226, 130, 172, 0, 0, 0, 0 }; //byte_4B266C = 0x005f51d0 "丂丂傗偓"//山羊
CHAR byte_4B2678[] = { 130, 221, 130, 184, 130, 170, 130, 223, 0, 0, 0, 0 };//byte_4B2678 = 0x005f51dc "傒偢偑傔"//水缸
CHAR byte_4B2684[] = { 129, 64, 129, 64, 130, 164, 130, 168, 0, 0, 0, 0 };//byte_4B2684 = 0x005f51e8 "丂丂偆偍"//鱼鳞
CHAR byte_4B2690[] = { 130, 168, 130, 208, 130, 194, 130, 182, 0, 0, 0, 0 };////羊羔
CHAR byte_4B269C[] = { 129, 64, 130, 168, 130, 164, 130, 181, 0, 0, 0, 0 };////黄铜
CHAR byte_4B26A8[] = { 129, 64, 130, 211, 130, 189, 130, 178, 0, 0, 0, 0 };////二字
CHAR byte_4B26B4[] = { 129, 64, 129, 64, 130, 169, 130, 201, 0, 0, 0, 0 };////螃蟹
CHAR byte_4B26C0[] = { 129, 64, 129, 64, 130, 181, 130, 181, 0, 0, 0, 0 };////子句
CHAR byte_4B26CC[] = { 129, 64, 130, 168, 130, 198, 130, 223, 0, 0, 0, 0 };////少女
CHAR byte_4B26D8[] = { 130, 196, 130, 241, 130, 209, 130, 241, 0, 0, 0, 0 };////天平
CHAR byte_4B26E4[] = { 129, 64, 130, 179, 130, 187, 130, 232, 0, 0, 0, 0 };////蝎子
CHAR byte_4B26F0[] = { 129, 64, 129, 64, 130, 162, 130, 196, 0, 0, 0, 0 };////固定
CHAR byte_4B26FC[] = { 129, 64, 129, 64, 130, 226, 130, 172, 0, 0, 0, 0 };////山羊
CHAR aA_0[] = { 32, 65, 0, 0 };//aA_0 = 0x005f771c " A"//A
CHAR aB_0[] = { 32, 66, 0, 0 };//aB_0 = 0x005f7720 " B"//B
CHAR aAb[] = { 65, 66, 0, 0 };//aAb = 0x005f7724 "AB"//AB
CHAR aO[] = { 32, 79, 0, 0 };//aO = 0x005f7728 " O"//O
//CHAR aD_6[] = { 37, 100, 62, 0 };//aD_6 = 0x005f772c "%d>"//%d>
//CHAR aD_7[] = { 37, 100, 62, 0 };//aD_7 = 0x005f7730 "%d>"//%d>
//CHAR aD_8[] = { 37, 100, 62, 0 };//aD_8 = 0x005f7734 "%d>"//%d>
unk byte_4B2724[] = { 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 0, 0 };//　　　　　
CHAR byte_4B2730[] = { 130, 230, 130, 177, 130, 230, 130, 177, 0, 0, 0, 0 };//横梁
CHAR aMenuWav_0[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aMenuWav_0 = 0x005f7750 "Menu.wav"//Menu.wav
CHAR byte_4B2748[] = { 130, 208, 130, 193, 130, 179, 130, 194, 129, 64, 130, 237, 130, 180, 0, 0 };//拉刀
//CHAR byte_4B2758[] = { 130, 103, 130, 111, 0, 0, 0, 0 };//ＨＰ
//CHAR a08[] = { 48, 56, 0, 0, 0, 4, 0, 0 };//a08 = 0x005f7774 "08"//08
//CHAR a09[] = { 48, 57, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0 };//a09 = 0x005f777c "09"//09
CHAR a10[] = { 49, 48, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0 };//a10 = 0x005f7788 "10"//10
//CHAR a18_0[] = { 49, 56, 0, 0, 0, 0, 0, 0 };//a18_0 = 0x005f7794 "18"//18
//CHAR a1617_0[] = { 49, 54, 49, 55, 0, 0, 0, 0 };//a1617_0 = 0x005f779c "1617"//1617
//CHAR a101617_0[] = { 49, 48, 49, 54, 49, 55, 0, 0, 0, 0, 0, 0 };//a101617_0 = 0x005f77a4 "101617"//101617
//CHAR a1314_0[] = { 49, 51, 49, 52, 0, 0, 0, 5, 0, 0, 0, 0 };//a1314_0 = 0x005f77b0 "1314"//1314
//CHAR a0112_0[] = { 48, 49, 49, 50, 0, 0, 0, 3, 0, 0, 0, 0 };//a0112_0 = 0x005f77bc "0112"//0112
//CHAR a1905_0[] = { 49, 57, 48, 53, 0, 0, 0, 7, 0, 0, 0, 0 };//a1905_0 = 0x005f77c8 "1905"//1905
//CHAR aDp_0[] = { 32, 37, 100, 80, 0, 0, 0, 0 };//aDp_0 = 0x005f77d4 " %dP"//%dP
CHAR aCpu[] = { 67, 80, 85, 0 };//aCpu = 0x005f77dc "CPU"//CPU
//CHAR aLv2d[] = { 76, 86, 37, 50, 100, 0, 0, 0 };//aLv2d = 0x005f77e0 "LV%2d"//LV%2d
//CHAR a4d[] = { 37, 52, 100, 0 };//a4d = 0x005f77e8 "%4d"//%4d
CHAR byte_4B27D8[] = { 129, 72, 129, 72, 129, 72, 129, 72, 129, 72, 0, 0 };//？？？？？

CHAR aS_4[] = { 37, 115, 130, 179, 130, 241, 130, 204, 129, 64, 131, 88, 131, 101, 129, 91, 131, 94, 131, 88, 130, 205, 129, 64, 130, 177, 130, 164, 130, 200, 130, 232, 130, 220, 130, 181, 130, 189, 129, 66, 129, 64, 130, 230, 130, 235, 130, 181, 130, 162, 130, 197, 130, 183, 130, 169, 129, 72, 0, 0 };//%s的状态是这样的。可以吗？

CHAR byte_4B2820[] = { 130, 162, 130, 162, 130, 197, 130, 183, 129, 64, 129, 64, 129, 64, 130, 162, 130, 226, 130, 197, 130, 183, 0, 0 };//不，不

CHAR byte_4B2838[] = { 131, 112, 129, 91, 131, 103, 131, 105, 129, 91, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请选择合作伙伴

CHAR byte_4B2858[] = { 130, 177, 130, 204, 129, 64, 130, 208, 130, 198, 130, 197, 129, 64, 130, 230, 130, 235, 130, 181, 130, 162, 130, 197, 130, 183, 130, 169, 129, 72, 0, 0 };//这个人可以吗？

CHAR byte_4B2878[] = { 130, 162, 130, 162, 130, 197, 130, 183, 129, 64, 129, 64, 129, 64, 130, 190, 130, 223, 130, 197, 130, 183, 0, 0 };//不，不行

CHAR aS_5[] = { 37, 115, 130, 179, 130, 241, 130, 204, 129, 64, 131, 88, 131, 101, 129, 91, 131, 94, 131, 88, 130, 197, 130, 183, 0, 0, 0, 0 };//是%s先生的状态

CHAR byte_4B28AC[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 131, 76, 131, 131, 131, 137, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请选择想要的角色

CHAR byte_4B28D4[] = { 130, 177, 130, 204, 129, 64, 130, 208, 130, 198, 130, 197, 129, 64, 130, 230, 130, 235, 130, 181, 130, 162, 130, 197, 130, 183, 130, 169, 129, 72, 0, 0 };//这个人可以吗？

CHAR byte_4B28F4[] = { 130, 230, 130, 235, 130, 181, 130, 162, 130, 197, 130, 183, 129, 64, 129, 64, 129, 64, 130, 230, 130, 235, 130, 181, 130, 173, 130, 200, 130, 162, 130, 197, 130, 183, 0, 0 };//可以，请多关照
CHAR asc_4B2918[] = { 62, 62, 0, 0 };//asc_4B2918 = 0x005f792c ">>"//>>
CHAR asc_4B291C[] = { 62, 62, 0, 0 };//asc_4B291C = 0x005f7930 ">>"//>>
CHAR asc_4B2920[] = { 62, 62, 0, 0 };//asc_4B2920 = 0x005f7934 ">>"//>>
CHAR aMenuWav_1[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//Menu.wav

//CHAR a1_2[] = { 36, 49, 130, 190, 130, 162, 129, 64, 129, 64, 130, 169, 130, 162, 130, 185, 130, 241, 36, 49, 129, 64, 130, 173, 130, 221, 130, 160, 130, 237, 130, 185, 129, 64, 130, 208, 130, 229, 130, 164, 0, 0, 0, 0 };//aMenuWav_1 = 0x005f7938 "Menu.wav"//$1大线路$1组合表
//CHAR a2d_4[] = { 37, 50, 100, 0 };//a2d_4 = 0x005f7970 "%2d"//%2d
//CHAR byte_4B2960[] = { 130, 117, 130, 114, 0, 0, 0, 0 };//ＶＳ
//CHAR a3dPoint[] = { 37, 51, 100, 32, 80, 79, 73, 78, 84, 0, 0, 0 };//a3dPoint = 0x005f797c "%3d POINT"//%3d POINT
//CHAR byte_4B2974[] = { 129, 149, 0, 0 };//＆

//CHAR byte_4B2978[] = { 130, 189, 130, 162, 130, 185, 130, 241, 129, 64, 130, 160, 130, 162, 130, 196, 130, 205, 129, 64, 130, 177, 130, 164, 130, 200, 130, 232, 130, 220, 130, 181, 130, 189, 0, 0 };//对战是这样的

//CHAR byte_4B299C[] = { 130, 187, 130, 234, 130, 197, 130, 205, 129, 64, 130, 170, 130, 241, 130, 206, 130, 193, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//那么请加油
CHAR byte_4B29BC[] = { 129, 149, 0, 0 };//＆
CHAR byte_4B29C0[] = { 129, 170, 0, 0 };//↑
CHAR byte_4B29C4[] = { 129, 171, 0, 0 };//↓
CHAR aMenuWav_2[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aMenuWav_2 = 0x005f79dc "Menu.wav"//Menu.wav
CHAR byte_4B29D4[] = { 129, 149, 0, 0 };//＆
CHAR asc_4B29D8[] = { 60, 45, 0, 0 };//asc_4B29D8 = 0x005f79ec "<-"//<-
CHAR asc_4B29DC[] = { 45, 62, 0, 0 };//asc_4B29DC = 0x005f79f0 "->"//->
CHAR aMenuWav_3[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aMenuWav_3 = 0x005f79f4 "Menu.wav"//Menu.wav
CHAR byte_4B29EC[] = { 129, 149, 0, 0 };//＆
CHAR asc_4B29F0[] = { 60, 45, 0, 0 };//asc_4B29F0 = 0x005f7a04 "<-"//<-
CHAR asc_4B29F4[] = { 45, 62, 0, 0 };//asc_4B29F4 = 0x005f7a08 "->"//->
CHAR a1[] = { 36, 49, 130, 234, 130, 215, 130, 233, 130, 160, 130, 193, 130, 213, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 36, 49, 0, 0, 0, 0 };//$1
dword dword_4B2A18 = 0x826b8275;
char byte_4B2A1C;
dword dword_4B2A20 = 0x8267826f;
char byte_4B2A24;
dword dword_4B2A28 = 0x82c482ed;
word word_4B2A2C = 0x82b4;
char byte_4B2A2E;
dword dword_4B2A30 = 0x82a082b5;
dword dword_4B2A34 = 0x82ed82b4;
char byte_4B2A38;
dword dword_4B2A3C = 0x82c882b0;
dword dword_4B2A40 = 0x82ed82b4;
char byte_4B2A44;
dword dword_4B2A48 = 0x82ce82cb;
char byte_4B2A4C;
dword dword_4B2A50 = 0x82d482ab;
char byte_4B2A54;
dword dword_4B2A58 = 0x82d482ab;
dword dword_4B2A5C = 0x82c882b0;
char byte_4B2A60;
dword dword_4B2A64 = 0x82da82a4;
dword dword_4B2A68 = 0x82ac82e5;
char byte_4B2A6C;
dword dword_4B2A70 = 0x82b782ce;
dword dword_4B2A74 = 0x82e282b3;
char byte_4B2A78;
dword dword_4B2A7C = 0x82e882ce;
dword dword_4B2A80 = 0x815b82b7;
char byte_4B2A84;
CHAR asc_4B2A88[] = { 45, 45, 45, 0 };//---
//CHAR a2d_0[] = { 43, 37, 50, 100, 0, 0, 0, 0 };//a2d_0 = 0x005f7a78 "+%2d"//+%2d
CHAR asc_4B2A94[] = { 45, 45, 45, 0 };//asc_4B2A94 = 0x005f7a80 "---"//---
//CHAR a2d_1[] = { 43, 37, 50, 100, 0, 0, 0, 0 };//a2d_1 = 0x005f7a84 "+%2d"//+%2d

CHAR byte_4B2AA0[] = { 131, 140, 131, 120, 131, 139, 131, 65, 131, 98, 131, 118, 129, 64, 130, 168, 130, 223, 130, 197, 130, 198, 130, 164, 130, 178, 130, 180, 130, 162, 130, 220, 130, 183, 36, 49, 0, 0, 0, 0 };//恭喜你提高水平

CHAR aGraphicAnteroo[] = { 71, 114, 97, 112, 104, 105, 99, 92, 65, 110, 116, 101, 114, 111, 111, 109, 66, 111, 100, 121, 37, 48, 50, 100, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicAnteroo = 0x005f7ab4 "Graphic\\AnteroomBody%02d.bmp"//Graphic\AnteroomBody%02d.bmp

CHAR aDataAnteroomti[] = { 68, 97, 116, 97, 92, 65, 110, 116, 101, 114, 111, 111, 109, 84, 105, 108, 101, 80, 97, 116, 46, 100, 97, 116, 0, 0, 0, 0 };//aDataAnteroomti = 0x005f7ad4 "Data\\AnteroomTilePat.dat"//Data\AnteroomTilePat.dat

CHAR aDataAnteroomcg[] = { 68, 97, 116, 97, 92, 65, 110, 116, 101, 114, 111, 111, 109, 67, 71, 46, 100, 97, 116, 0 };//aDataAnteroomcg = 0x005f7af0 "Data\\AnteroomCG.dat"//Data\AnteroomCG.dat
CHAR aWinnerWav[] = { 87, 105, 110, 110, 101, 114, 46, 119, 97, 118, 0, 0 };//aWinnerWav = 0x005f7b04 "Winner.wav"//Winner.wav
CHAR aLoserWav[] = { 76, 111, 115, 101, 114, 46, 119, 97, 118, 0, 0, 0 };//aLoserWav = 0x005f7b10 "Loser.wav"//Loser.wav

CHAR byte_4B2B30[] = { 130, 181, 130, 227, 130, 194, 130, 182, 130, 229, 130, 164, 130, 185, 130, 241, 130, 181, 130, 227, 129, 64, 130, 208, 130, 169, 130, 166, 130, 181, 130, 194, 0, 0, 0, 0 };//出口船首撑
CHAR aGraphicAnteroo_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 65, 110, 116, 101, 114, 111, 111, 109, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicAnteroo_0 = 0x005f7b40 "Graphic\\Anteroom.bmp"//Graphic\Anteroom.bmp
dword dword_4B2B6C = 0x82c282ac;
dword dword_4B2B70 = 0x82cc82b5;
dword dword_4B2B74 = 0x82a082a2;
char byte_4B2B78;
dword dword_4B2B7C = 0x83588365;
dword dword_4B2B80 = 0x815b835e;
word word_4B2B84 = 0x8358;
char byte_4B2B86;
dword dword_4B2B88 = 0x83898393;
dword dword_4B2B8C = 0x834c8393;
word word_4B2B90 = 0x834f;
char byte_4B2B92;
dword dword_4B2B94 = 0x82ab82eb;
word word_4B2B98 = 0x82ad;
char byte_4B2B9A;

CHAR byte_4B2B9C[] = { 130, 194, 130, 172, 130, 205, 129, 64, 130, 179, 130, 162, 130, 178, 130, 204, 129, 64, 130, 181, 130, 160, 130, 162, 130, 190, 129, 73, 0, 0, 0, 0 };//接下来是最后的比赛！

CHAR byte_4B2BBC[] = { 130, 171, 130, 221, 130, 189, 130, 191, 130, 170, 129, 64, 130, 226, 130, 231, 130, 234, 130, 233, 130, 169, 129, 65, 130, 187, 130, 234, 130, 198, 130, 224, 129, 64, 130, 177, 130, 204, 130, 181, 130, 160, 130, 162, 130, 201, 129, 64, 130, 181, 130, 229, 130, 164, 130, 232, 130, 183, 130, 233, 130, 169, 130, 205, 0, 0, 0, 0 };//你们是要被干掉呢，还是要被干掉呢

CHAR byte_4B2C00[] = { 130, 171, 130, 221, 130, 189, 130, 191, 129, 64, 130, 181, 130, 190, 130, 162, 130, 190, 129, 99, 0, 0, 0, 0 };//就看你们了…

CHAR byte_4B2C18[] = { 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 130, 240, 129, 64, 130, 223, 130, 180, 130, 181, 129, 64, 130, 170, 130, 241, 130, 206, 130, 193, 130, 196, 130, 173, 130, 234, 129, 73, 129, 73, 0, 0, 0, 0 };//以前进为目标加油！！

CHAR byte_4B2C44[] = { 130, 171, 130, 221, 130, 189, 130, 191, 130, 205, 129, 64, 130, 168, 130, 181, 130, 173, 130, 224, 129, 64, 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 130, 240, 129, 64, 130, 204, 130, 170, 130, 181, 130, 196, 130, 181, 130, 220, 130, 193, 130, 189, 129, 99, 0, 0 };//你们竟然错过了昨晚…

CHAR byte_4B2C7C[] = { 131, 102, 129, 91, 131, 94, 130, 240, 130, 171, 130, 235, 130, 173, 130, 181, 129, 64, 130, 179, 130, 162, 131, 96, 131, 131, 131, 140, 131, 147, 131, 87, 130, 181, 130, 196, 130, 173, 130, 234, 129, 73, 0, 0 };//请把数据记录下来挑战一下！

CHAR byte_4B2CA8[] = { 130, 220, 130, 175, 130, 196, 130, 181, 130, 220, 130, 193, 130, 189, 129, 64, 130, 171, 130, 221, 130, 189, 130, 191, 130, 201, 129, 64, 130, 224, 130, 164, 130, 162, 130, 191, 130, 199, 129, 64, 131, 96, 131, 131, 131, 147, 131, 88, 130, 240, 129, 64, 130, 160, 130, 189, 130, 166, 130, 230, 130, 164, 0, 0 };//再给输了的你们一次机会吧

CHAR byte_4B2CE8[] = { 130, 177, 130, 204, 131, 96, 131, 131, 131, 147, 131, 88, 130, 240, 129, 64, 130, 162, 130, 169, 130, 181, 130, 196, 129, 64, 130, 186, 130, 193, 130, 189, 130, 162, 130, 201, 129, 64, 130, 169, 130, 191, 130, 202, 130, 162, 130, 196, 130, 173, 130, 234, 129, 73, 0, 0 };//你一定要利用这个机会给我一个机会！

CHAR byte_4B2D20[] = { 130, 221, 130, 183, 130, 184, 130, 205, 129, 64, 130, 220, 130, 241, 130, 188, 130, 173, 130, 181, 130, 189, 130, 204, 130, 169, 129, 64, 130, 169, 130, 166, 130, 193, 130, 196, 130, 162, 130, 193, 130, 189, 129, 66, 0, 0, 0, 0 };//美铃也许是满足了，反而走啦。

CHAR byte_4B2D50[] = { 130, 171, 130, 240, 129, 64, 130, 198, 130, 232, 130, 200, 130, 168, 130, 181, 130, 196, 129, 64, 131, 96, 131, 131, 131, 147, 131, 115, 131, 73, 131, 147, 130, 201, 129, 64, 130, 191, 130, 229, 130, 164, 130, 185, 130, 241, 130, 190, 129, 73, 0, 0 };//重新振作起来，让我成为冠军！

CHAR byte_4B2D84[] = { 130, 194, 130, 172, 130, 204, 130, 181, 130, 160, 130, 162, 130, 201, 129, 64, 130, 183, 130, 183, 130, 221, 130, 220, 130, 183, 0, 0 };//继续进行下一次作业

CHAR byte_4B2DA0[] = { 131, 76, 131, 131, 131, 137, 130, 204, 129, 64, 131, 88, 131, 101, 129, 91, 131, 94, 131, 88, 130, 240, 129, 64, 130, 221, 130, 233, 130, 177, 130, 198, 130, 170, 129, 64, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 };//可以看到角色的状态

CHAR byte_4B2DD0[] = { 130, 176, 130, 241, 130, 180, 130, 162, 130, 204, 129, 64, 131, 137, 131, 147, 131, 76, 131, 147, 131, 79, 130, 240, 129, 64, 130, 169, 130, 173, 130, 201, 130, 241, 129, 64, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 };//可以确认现在的排名

CHAR byte_4B2E00[] = { 131, 102, 129, 91, 131, 94, 130, 240, 129, 64, 130, 171, 130, 235, 130, 173, 130, 183, 130, 233, 130, 177, 130, 198, 130, 170, 129, 64, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 };//你可以把数据记录下来

CHAR asc_4B2E28[] = { 62, 62, 0, 0 };//>>
CHAR byte_4B2E2C[] = { 129, 171, 0, 0 };//↓
//CHAR aSave02dDat[] = {83, 97, 118, 101, 37, 48, 50, 100, 46, 100, 97, 116, 0, 0, 0, 0};//aSave02dDat = 0x005f7e18 "Save%02d.dat"
char aKdsavedata[] = { 75, 68, 83, 65, 86, 69, 68, 65, 84, 65, 0, 0 };//aKdsavedata = 0x005f7e28 "KDSAVEDATA"//KDSAVEDATA
//CHAR aSave02dDat_0[] = {83, 97, 118, 101, 37, 48, 50, 100, 46, 100, 97, 116, 0, 0, 0, 0};//aSave02dDat_0 = 0x005f7e34 "Save%02d.dat"
CHAR aKdsavedata_0[] = { 75, 68, 83, 65, 86, 69, 68, 65, 84, 65, 0, 0 };//aKdsavedata_0 = 0x005f7e44 "KDSAVEDATA"//KDSAVEDATA
//CHAR aNoD[] = { 78, 79, 37, 100, 0, 0, 0, 0 };//aNoD = 0x005f7e50 "NO%d"//NO%d
//CHAR byte_4B2E70[] = { 131, 116, 131, 64, 131, 67, 131, 139, 130, 170, 130, 160, 130, 232, 130, 220, 130, 185, 130, 241, 0, 0, 0, 0 };//缺少文件
//CHAR byte_4B2E88[] = { 129, 149, 0, 0 };//＆
CHAR byte_4B2E8C[] = { 130, 205, 130, 182, 130, 223, 130, 169, 130, 231, 0, 0 };//从一开始
//CHAR byte_4B2E98[] = { 130, 179, 130, 162, 130, 181, 130, 227, 130, 164, 130, 175, 130, 193, 130, 185, 130, 241, 0, 0 };//最终接线
CHAR a2d_5[] = { 37, 50, 100, 0 };//a2d_5 = 0x005f7e94 "%2d"//%2d
//CHAR byte_4B2EB0[] = { 130, 169, 130, 162, 130, 185, 130, 241, 0, 0, 0, 0 };//线路
//CHAR a2dpoint[] = { 37, 50, 100, 80, 79, 73, 78, 84, 0, 0, 0, 0 };//a2dpoint = 0x005f7ea4 "%2dPOINT"//%2dPOINT
//CHAR aLv2d_0[] = { 76, 86, 37, 50, 100, 0, 0, 0 };//aLv2d_0 = 0x005f7eb0 "LV%2d"//LV%2d
//CHAR aLv2d_1[] = { 76, 86, 37, 50, 100, 0, 0, 0 };//aLv2d_1 = 0x005f7eb8 "LV%2d"//LV%2d

//CHAR byte_4B2ED8[] = { 130, 230, 130, 221, 130, 177, 130, 222, 129, 64, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请看读文件

CHAR byte_4B2F00[] = { 130, 171, 130, 235, 130, 173, 130, 183, 130, 233, 129, 64, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请看要记录的文件
CHAR aMenuWav_4[] = { 77, 101, 110, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aMenuWav_4 = 0x005f7f14 "Menu.wav"//Menu.wav

CHAR byte_4B2F38[] = { 130, 217, 130, 241, 130, 198, 130, 164, 130, 201, 129, 64, 130, 171, 130, 235, 130, 173, 130, 181, 130, 196, 129, 64, 130, 230, 130, 235, 130, 181, 130, 162, 130, 197, 130, 183, 130, 169, 129, 72, 0, 0, 0, 0 };//真的可以记录下来吗？

CHAR byte_4B2F64[] = { 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 130, 162, 130, 162, 130, 230, 129, 73, 129, 64, 129, 64, 130, 190, 130, 223, 130, 190, 129, 73, 0, 0 };//好啊！不行！

CHAR byte_4B2F84[] = { 130, 206, 130, 193, 130, 191, 130, 232, 129, 64, 130, 171, 130, 235, 130, 173, 129, 64, 130, 181, 130, 220, 130, 181, 130, 189, 36, 49, 0, 0, 0, 0 };//漂亮地记录了$1

CHAR byte_4B2FA4[] = { 130, 171, 130, 235, 130, 173, 130, 183, 130, 233, 129, 64, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请看要记录的文件

CHAR byte_4B2FD0[] = { 130, 171, 130, 235, 130, 173, 130, 183, 130, 233, 129, 64, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请看要记录的文件

CHAR asc_4B2FFC[] = { 62, 62, 0, 0 };//asc_4B2FFC = 0x005f7fe4 ">>"//>>
CHAR asc_4B3000[] = { 62, 62, 0, 0 };//asc_4B3000 = 0x005f7fe8 ">>"//>>
CHAR aDemoTigerdemo0[] = { 68, 101, 109, 111, 92, 84, 105, 103, 101, 114, 68, 101, 109, 111, 48, 49, 46, 116, 120, 116, 0, 0, 0, 0 };//aDemoTigerdemo0 = 0x005f7fec "Demo\\TigerDemo01.txt"//Demo\TigerDemo01.txt
CHAR aDemoTigerdemo0_0[] = { 68, 101, 109, 111, 92, 84, 105, 103, 101, 114, 68, 101, 109, 111, 48, 50, 46, 116, 120, 116, 0, 0, 0, 0 };//aDemoTigerdemo0_0 = 0x005f8004 "Demo\\TigerDemo02.txt"//Demo\TigerDemo02.txt
CHAR aDemoTigerdemo0_1[] = { 68, 101, 109, 111, 92, 84, 105, 103, 101, 114, 68, 101, 109, 111, 48, 51, 46, 116, 120, 116, 0, 0, 0, 0 };//aDemoTigerdemo0_1 = 0x005f801c "Demo\\TigerDemo03.txt"//Demo\TigerDemo03.txt
CHAR aDemoEnding01Tx[] = { 68, 101, 109, 111, 92, 69, 110, 100, 105, 110, 103, 48, 49, 46, 116, 120, 116, 0, 0, 0 };//aDemoEnding01Tx = 0x005f8034 "Demo\\Ending01.txt"//Demo\Ending01.txt
CHAR aPairTxt[] = { 112, 97, 105, 114, 46, 116, 120, 116, 0, 0, 0, 0 };//aPairTxt = 0x005f8048 "pair.txt"//pair.txt
CHAR aStart_2[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_2 = 0x005f8054 "#START"//#START
CHAR aEnd[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd = 0x005f805c "#END"//#END
CHAR aStart_3[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_3 = 0x005f8064 "#START"//#START
CHAR byte_4B3084[] = { 129, 72, 129, 72, 129, 72, 129, 72, 129, 72, 0, 0 };//？？？？？
CHAR FileName[] = { 82, 101, 112, 108, 97, 121, 46, 98, 105, 110, 0, 0 };//FileName = 0x005f8078 "Replay.bin"//Replay.bin
CHAR a1_0[] = { 36, 49, 130, 175, 130, 193, 130, 169, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 36, 49, 0, 0 };//a1_0 = 0x005f8084 "$1偗偭偐丂偼偭傄傚偆$1"//$1结果$1
//CHAR aD_9[] = { 37, 100, 0, 0 };//aD_9 = 0x005f809c "%d"//%d
//CHAR byte_4B30B8[] = { 136, 202, 0, 0 };//位置
//CHAR aDPoint[] = { 43, 37, 100, 32, 80, 79, 73, 78, 84, 0, 0, 0 };//aDPoint = 0x005f80a4 "+%d POINT"//+%d POINT
//CHAR aDPoint_0[] = { 43, 37, 100, 32, 80, 79, 73, 78, 84, 0, 0, 0 };//aDPoint_0 = 0x005f80b0 "+%d POINT"//+%d POINT
//CHAR byte_4B30D4[] = { 129, 149, 0, 0 };//＆

//CHAR byte_4B30D8[] = { 130, 181, 130, 160, 130, 162, 130, 204, 129, 64, 130, 175, 130, 193, 130, 169, 130, 205, 129, 64, 130, 177, 130, 164, 130, 200, 130, 232, 130, 220, 130, 181, 130, 189, 0, 0 };//最后的结果是这样的
//CHAR byte_4B30FC[] = { 130, 168, 130, 194, 130, 169, 130, 234, 130, 179, 130, 220, 130, 197, 130, 181, 130, 189, 0, 0 };//您辛苦了
CHAR a1_1[] = { 36, 49, 130, 231, 130, 241, 130, 171, 130, 241, 130, 174, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 36, 49, 0, 0 };//1美元
//CHAR a2d_6[] = { 37, 50, 100, 0 };//a2d_6 = 0x005f8114 "%2d"//%2d
//CHAR byte_4B3130[] = { 136, 202, 0, 0 };//位置
//CHAR a3dPoint_0[] = { 37, 51, 100, 32, 80, 79, 73, 78, 84, 0, 0, 0 };//a3dPoint_0 = 0x005f811c "%3d POINT"//%3d POINT
//CHAR byte_4B3140[] = { 129, 149, 0, 0 };//＆
//CHAR byte_4B3144[] = { 130, 176, 130, 241, 130, 180, 130, 162, 130, 204, 129, 64, 131, 137, 131, 147, 131, 76, 131, 147, 131, 79, 130, 197, 130, 183, 0, 0 };//现在的排名

//CHAR byte_4B3160[] = { 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 130, 223, 130, 180, 130, 181, 130, 196, 129, 64, 130, 170, 130, 241, 130, 206, 130, 193, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请以友谊为目标加油
CHAR aGraphicSystem0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0 = 0x005f8170 "Graphic\\System02.bmp"//Graphic\System02.bmp
CHAR aGraphicSystem0_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_0 = 0x005f8188 "Graphic\\System02.bmp"//Graphic\System02.bmp
CHAR aError_11[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_11 = 0x005f81a0 "Error"//Error

//生命窗口面部图形制作失败。
CHAR byte_4B31C0[] = { 131, 137, 131, 67, 131, 116, 131, 69, 131, 67, 131, 147, 131, 104, 131, 69, 138, 231, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aGraphicSystem0_1[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_1 = 0x005f81dc "Graphic\\System02.bmp"//Graphic\System02.bmp
CHAR aError_12[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_12 = 0x005f81f4 "Error"//Error

//生命窗口面部图形制作失败。
CHAR byte_4B3214[] = { 131, 137, 131, 67, 131, 116, 131, 69, 131, 67, 131, 147, 131, 104, 131, 69, 138, 231, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR byte_4B3248[] = { 130, 204, 130, 177, 130, 232, 131, 124, 131, 67, 131, 147, 131, 103, 0, 0 };//余点
CHAR byte_4B3258[] = { 129, 64, 129, 64, 129, 64, 130, 111, 0, 0, 0, 0 };//　　　Ｐ
CHAR byte_4B3264[] = { 129, 105, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 147, 129, 106, 0, 0 };//（　　　　　　％）
//CHAR a4dp3d02d[] = { 37, 52, 100, 80, 40, 37, 51, 100, 46, 37, 48, 50, 100, 37, 37, 41, 0, 0, 0, 0 };//a4dp3d02d = 0x005f8260 "%4dP(%3d.%02d%%)"//%4dP(%3d.%02d%%)
//CHAR a3d_4[] = { 37, 51, 100, 0 };//a3d_4 = 0x005f8274 "%3d"//%3d
//CHAR a3d02d[] = { 37, 51, 100, 46, 37, 48, 50, 100, 0, 0, 0, 0 };//a3d02d = 0x005f8278 "%3d.%02d"//%3d.%02d

CHAR byte_4B329C[] = { 130, 214, 130, 241, 130, 177, 130, 164, 130, 183, 130, 233, 129, 64, 130, 212, 130, 171, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请看一下要转行的地方

CHAR byte_4B32C4[] = { 131, 90, 131, 140, 131, 78, 131, 103, 130, 197, 129, 64, 130, 183, 130, 215, 130, 196, 130, 204, 129, 64, 130, 212, 130, 171, 130, 240, 129, 64, 130, 79, 131, 124, 131, 67, 131, 147, 131, 103, 130, 201, 129, 64, 130, 181, 130, 220, 130, 183, 0, 0 };//选择时所有的拳都是0分

CHAR byte_4B32F8[] = { 131, 90, 131, 140, 131, 78, 131, 103, 130, 197, 129, 64, 130, 183, 130, 215, 130, 196, 130, 204, 129, 64, 130, 212, 130, 171, 130, 240, 129, 64, 130, 80, 130, 79, 131, 124, 131, 67, 131, 147, 131, 103, 130, 201, 129, 64, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//选择的话所有的拳都是10分

CHAR byte_4B3330[] = { 131, 124, 131, 67, 131, 147, 131, 103, 130, 240, 129, 64, 130, 237, 130, 232, 130, 211, 130, 193, 130, 196, 129, 64, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0, 0, 0 };//请给我分点

CHAR aLeri[] = { 76, 69, 82, 73, 130, 197, 129, 64, 130, 80, 130, 184, 130, 194, 129, 64, 85, 80, 68, 79, 130, 197, 129, 64, 130, 84, 130, 184, 130, 194, 129, 64, 130, 188, 130, 164, 130, 176, 130, 241, 130, 181, 130, 220, 130, 183, 0, 0 };//在LERI中，每次UPDO增加5
CHAR asc_4B3384[] = { 62, 62, 0, 0 };//asc_4B3384 = 0x005f836c ">>"//>>
CHAR asc_4B3388[] = { 62, 62, 0, 0 };//asc_4B3388 = 0x005f8370 ">>"//>>
CHAR byte_4B338C[] = { 129, 170, 0, 0 };//↑
CHAR byte_4B3390[] = { 129, 171, 0, 0 };//↓
//CHAR aDemoS[] = { 68, 101, 109, 111, 92, 37, 115, 0 };//aDemoS = 0x005f837c "Demo\\%s"//Demo\%s
char aMisuzuEndTxt[] = { 77, 105, 115, 117, 122, 117, 95, 69, 110, 100, 46, 116, 120, 116, 0, 0 };//aMisuzuEndTxt = 0x005f8384 "Misuzu_End.txt"//Misuzu_End.txt
//CHAR aStageStage02dD[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 100, 97, 116, 0 };//aStageStage02dD = 0x005f8394 "Stage\\Stage%02d.dat"//Stage\Stage%02d.dat

CHAR aGraphicHeadBmp[] = { 71, 114, 97, 112, 104, 105, 99, 92, 72, 101, 97, 100, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicHeadBmp = 0x005f83a8 "Graphic\\Head.bmp"//Graphic\Head.bmp

wchar_t word_4B33D4[] = { 131, 138, 131, 118, 131, 140, 131, 67, 131, 102, 129, 91, 131, 94, 130, 204, 129, 64, 130, 217, 130, 188, 130, 241, 130, 240, 129, 64, 130, 169, 130, 162, 130, 181, 130, 181, 130, 220, 130, 183, 36, 49, 0, 0 };//保存重放数据$1

wchar_t word_4B3400[] = { 131, 138, 131, 118, 131, 140, 131, 67, 131, 102, 129, 91, 131, 94, 130, 204, 129, 64, 130, 217, 130, 188, 130, 241, 130, 240, 129, 64, 130, 226, 130, 223, 130, 220, 130, 181, 130, 189, 36, 49, 0, 0, 0, 0 };//停止保存重放数据$1

wchar_t word_4B342C[] = { 130, 176, 130, 241, 130, 180, 130, 162, 130, 205, 129, 64, 130, 214, 130, 241, 130, 177, 130, 164, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 36, 49, 0, 0, 0, 0 };//现在不能更改$1

wchar_t word_4B3450[] = { 131, 94, 131, 67, 131, 103, 131, 139, 130, 170, 130, 223, 130, 241, 130, 162, 130, 170, 130, 162, 130, 197, 130, 205, 129, 64, 130, 179, 130, 162, 130, 185, 130, 162, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 36, 49, 0, 0 };//标题不能为1美元

CHAR byte_4B3480[] = { 130, 191, 130, 225, 130, 241, 130, 184, 0, 0, 0, 0 };//小铃
CHAR byte_4B348C[] = { 130, 198, 130, 200, 130, 169, 130, 220, 130, 189, 130, 191, 0, 0, 0, 0 };//朋友们
CHAR byte_4B349C[] = { 131, 123, 131, 147, 131, 111, 129, 91, 131, 89, 0, 0 };//结合
CHAR byte_4B34A8[] = { 130, 162, 130, 193, 130, 169, 0, 0 };//一价
CHAR byte_4B34B0[] = { 130, 174, 130, 221, 0, 0, 0, 0 };//结构
CHAR byte_4B34B8[] = { 130, 225, 0, 0 };//汽车
CHAR byte_4B34BC[] = { 130, 227, 0, 0 };//球棒
CHAR byte_4B34C0[] = { 130, 229, 0, 0 };//场所
CHAR byte_4B34C4[] = { 130, 159, 0, 0 };//啊啊
CHAR byte_4B34C8[] = { 130, 161, 0, 0 };//是的
CHAR byte_4B34CC[] = { 130, 163, 0, 0 };//嗯
CHAR byte_4B34D0[] = { 130, 165, 0, 0 };//是的
CHAR byte_4B34D4[] = { 130, 167, 0, 0 };//哦
CHAR byte_4B34D8[] = { 131, 131, 0, 0 };//沙沙
CHAR byte_4B34DC[] = { 131, 133, 0, 0 };//朱砂
CHAR byte_4B34E0[] = { 131, 135, 0, 0 };//约略
CHAR byte_4B34E4[] = { 131, 64, 0, 0 };//啊
CHAR byte_4B34E8[] = { 131, 66, 0, 0 };//小的
CHAR byte_4B34EC[] = { 131, 68, 0, 0 };//使…旋转
CHAR byte_4B34F0[] = { 131, 70, 0, 0 };//在…之前
CHAR byte_4B34F4[] = { 131, 72, 0, 0 };//哦
CHAR byte_4B34F8[] = { 130, 191, 0, 0 };//土地
CHAR byte_4B34FC[] = { 131, 96, 0, 0 };//拉刀
//CHAR aSS[] = { 37, 115, 37, 115, 0, 0, 0, 0 };//aSS = 0x005f8594 "%s%s"//%s%s
word word_4B3508 = 0x8260;
char byte_4B350A;
word word_4B350C = 0x8261;
char byte_4B350E;
word word_4B3510 = 0x8262;
char byte_4B3512;
word word_4B3514 = 0x8263;
char byte_4B3516;
//CHAR aD_10[] = { 37, 100, 62, 0 };//aD_10 = 0x005f85ac "%d>"//%d>
CHAR byte_4B351C[] = { 131, 96, 129, 91, 131, 128, 131, 71, 131, 102, 131, 66, 131, 98, 131, 103, 130, 181, 130, 220, 130, 183, 130, 169, 129, 72, 0, 0 };//要编辑团队吗？
CHAR byte_4B3538[] = { 130, 183, 130, 233, 0, 0, 0, 0 };//开伙
CHAR byte_4B3540[] = { 130, 181, 130, 200, 130, 162, 0, 0 };//不做
dword dword_4B3548 = 0x8267826f;
char byte_4B354C;
dword dword_4B3550 = 0x82a082b5;
dword dword_4B3554 = 0x82ed82b4;
char byte_4B3558;
dword dword_4B355C = 0x82c482ed;
word word_4B3560 = 0x82b4;
char byte_4B3562;
dword dword_4B3564 = 0x82c882b0;
dword dword_4B3568 = 0x82ed82b4;
char byte_4B356C;
dword dword_4B3570 = 0x82d482ab;
char byte_4B3574;
dword dword_4B3578 = 0x82d482ab;
dword dword_4B357C = 0x82c882b0;
char byte_4B3580;
dword dword_4B3584 = 0x82da82a4;
dword dword_4B3588 = 0x82ac82e5;
char byte_4B358C;
dword dword_4B3590 = 0x82b782ce;
dword dword_4B3594 = 0x82e282b3;
char byte_4B3598;
dword dword_4B359C = 0x82ce82cb;
char byte_4B35A0;
dword dword_4B35A4 = 0x82e882ce;
dword dword_4B35A8 = 0x815b82b7;
char byte_4B35AC;
//CHAR a3d_16[] = { 37, 51, 100, 0 };//a3d_16 = 0x005f8620 "%3d"//%3d

CHAR byte_4B35B4[] = { 129, 72, 129, 72, 129, 72, 129, 72, 0, 0, 0, 0 };//？？？？

CHAR byte_4B35C0[] = { 130, 168, 130, 164, 130, 166, 130, 241, 131, 75, 129, 91, 131, 139, 0, 0 };//女郎

CHAR byte_4B35D0[] = { 131, 96, 129, 91, 131, 128, 130, 240, 129, 64, 130, 166, 130, 231, 130, 241, 130, 197, 129, 64, 130, 173, 130, 190, 130, 179, 130, 162, 36, 49, 0, 0 };//请选一个队

CHAR asc_4B35F0[] = { 62, 60, 130, 197, 131, 96, 129, 91, 131, 128, 130, 240, 130, 185, 130, 241, 130, 189, 130, 173, 0, 0, 0, 0 };//><选择团队

CHAR asc_4B3608[] = { 60, 62, 130, 197, 131, 88, 131, 101, 129, 91, 131, 94, 131, 88, 130, 170, 129, 64, 130, 169, 130, 173, 130, 201, 130, 241, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0 };//可以在<>中确认状态

CHAR byte_4B362C[] = { 131, 96, 129, 91, 131, 128, 131, 74, 131, 137, 129, 91, 130, 240, 130, 166, 130, 231, 130, 241, 130, 197, 130, 173, 130, 190, 130, 179, 130, 162, 0, 0 };//请给我看团队颜色

//CHAR a2d2d[] = { 37, 50, 100, 47, 37, 50, 100, 0 };//a2d2d = 0x005f86bc "%2d/%2d"//%2d/%2d

CHAR byte_4B3654[] = { 130, 183, 130, 197, 130, 201, 129, 64, 130, 217, 130, 169, 130, 204, 131, 96, 129, 91, 131, 128, 130, 197, 0, 0 };//已经在其他的队伍

CHAR byte_4B366C[] = { 130, 181, 130, 230, 130, 164, 130, 179, 130, 234, 130, 196, 130, 162, 130, 220, 130, 183, 0, 0 };//正在使用

CHAR byte_4B3680[] = { 130, 183, 130, 215, 130, 196, 130, 204, 129, 64, 130, 185, 130, 241, 130, 189, 130, 173, 130, 170, 0, 0, 0, 0 };//所有的选择

CHAR byte_4B3698[] = { 130, 181, 130, 227, 130, 164, 130, 232, 130, 229, 130, 164, 130, 181, 130, 220, 130, 181, 130, 189, 36, 49, 0, 0 };//结束了$1

CHAR aGraphicCheergi[] = { 71, 114, 97, 112, 104, 105, 99, 92, 67, 104, 101, 101, 114, 71, 105, 114, 108, 95, 70, 97, 99, 101, 46, 98, 109, 112, 0, 0 };//aGraphicCheergi = 0x005f8720 "Graphic\\CheerGirl_Face.bmp"//Graphic\CheerGirl_Face.bmp

CHAR aGraphicCheergi_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 67, 104, 101, 101, 114, 71, 105, 114, 108, 95, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicCheergi_0 = 0x005f873c "Graphic\\CheerGirl_Select.bmp"//Graphic\CheerGirl_Select.bmp
CHAR aKkTeamTxt[] = { 107, 107, 95, 116, 101, 97, 109, 46, 116, 120, 116, 0 };//aKkTeamTxt = 0x005f875c "kk_team.txt"//kk_team.txt
CHAR aStart_4[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_4 = 0x005f8768 "#START"//#START
CHAR aEnd_0[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_0 = 0x005f8770 "#END"//#END
CHAR aStart_5[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_5 = 0x005f8778 "#START"//#START
CHAR aEnd_1[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_1 = 0x005f8780 "#END"//#END
//CHAR aGraphicBody02d_1[] = { 71, 114, 97, 112, 104, 105, 99, 92, 66, 111, 100, 121, 37, 48, 50, 100, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicBody02d_1 = 0x005f8788 "Graphic\\Body%02d.bmp"//Graphic\Body%02d.bmp
//CHAR aGraphic02dppal_0[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_0 = 0x005f87a0 "Graphic\\%02dpPalette.bin"
CHAR aUndoukaiCharse[] = { 117, 110, 100, 111, 117, 107, 97, 105, 95, 99, 104, 97, 114, 115, 101, 108, 46, 119, 97, 118, 0, 0, 0, 0 };//aUndoukaiCharse = 0x005f87bc "undoukai_charsel.wav"//undoukai_charsel.wav
//CHAR aDD[] = { 37, 100, 47, 37, 100, 0, 0, 0 };//aDD = 0x005f87d4 "%d/%d"//%d/%d
CHAR byte_4B376C[] = { 130, 169, 130, 162, 130, 185, 130, 241, 0, 0, 0, 0 };//线路
CHAR byte_4B3778[] = { 130, 181, 130, 227, 130, 194, 130, 182, 130, 229, 130, 164, 130, 183, 130, 233, 129, 64, 130, 185, 130, 241, 130, 181, 130, 227, 130, 240, 129, 64, 130, 171, 130, 223, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 36, 49, 0, 0 };//请决定采取何种行动$1
char Format[] = { 72, 80, 32, 37, 51, 100, 47, 37, 51, 100, 0, 0 };//Format = 0x005f8818 "HP %3d/%3d"//HP %3d/%3d
dword dword_4B37B4 = 0x82c482ed;
word word_4B37B8 = 0x82b4;
char byte_4B37BA;
dword dword_4B37BC = 0x82a082b5;
dword dword_4B37C0 = 0x82ed82b4;
char byte_4B37C4;
dword dword_4B37C8 = 0x82c882b0;
dword dword_4B37CC = 0x82ed82b4;
char byte_4B37D0;
dword dword_4B37D4 = 0x82d482ab;
char byte_4B37D8;
dword dword_4B37DC = 0x82d482ab;
dword dword_4B37E0 = 0x82c882b0;
char byte_4B37E4;
dword dword_4B37E8 = 0x82da82a4;
dword dword_4B37EC = 0x82ac82e5;
char byte_4B37F0;
dword dword_4B37F4 = 0x82b782ce;
dword dword_4B37F8 = 0x82e282b3;
char byte_4B37FC;
dword dword_4B3800 = 0x82ce82cb;
char byte_4B3804;
dword dword_4B3808 = 0x82e882ce;
dword dword_4B380C = 0x815b82b7;
char byte_4B3810;

//CHAR a3d_17[] = { 37, 51, 100, 0 };//a3d_17 = 0x005f8864 "%3d"//%3d

CHAR byte_4B3818[] = { 129, 72, 129, 72, 129, 72, 129, 72, 0, 0, 0, 0 };//？？？？

CHAR byte_4B3824[] = { 130, 168, 130, 164, 130, 166, 130, 241, 131, 75, 129, 91, 131, 139, 0, 0 };//女郎

CHAR aDemoKkResult1T[] = { 68, 101, 109, 111, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 49, 46, 116, 120, 116, 0 };//aDemoKkResult1T = 0x005f8884 "Demo\\KK_Result1.txt"//Demo\KK_Result1.txt

CHAR aCheergirlsWav[] = { 67, 104, 101, 101, 114, 71, 105, 114, 108, 115, 46, 119, 97, 118, 0, 0 };//aCheergirlsWav = 0x005f8898 "CheerGirls.wav"//CheerGirls.wav

//CHAR aD_0[] = { 37, 100, 0, 0 };//aD_0 = 0x005f88a8 "%d"//%d

CHAR byte_4B385C[] = { 136, 202, 0, 0 };//位置

//CHAR a3d_18[] = { 37, 51, 100, 0 };//a3d_18 = 0x005f88b0 "%3d"//%3d

CHAR byte_4B3864[] = { 147, 95, 0, 0 };//点

//CHAR aGraphicCheergi_1[] = { 71, 114, 97, 112, 104, 105, 99, 92, 67, 104, 101, 101, 114, 71, 105, 114, 108, 95, 80, 97, 108, 101, 116, 116, 101, 37, 48, 50, 100, 46, 98, 105, 110, 0, 0, 0 };//aGraphicCheergi_1 = 0x005f88b8 "Graphic\\CheerGirl_Palette%02d.bin"//Graphic\CheerGirl_Palette%02d.bin

CHAR aS_6[] = { 37, 115, 129, 117, 37, 115, 0, 0 };//aS_6 = 0x005f88dc "%s乽%s"//%s「%s

CHAR aGraphicKkResul[] = { 71, 114, 97, 112, 104, 105, 99, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 50, 46, 98, 109, 112, 0, 0 };//aGraphicKkResul = 0x005f88e4 "Graphic\\KK_Result2.bmp"//Graphic\KK_Result2.bmp

CHAR pszFileName[] = { 83, 111, 117, 110, 100, 92, 67, 104, 101, 101, 114, 38, 87, 104, 105, 115, 116, 108, 101, 46, 119, 97, 118, 0 };//pszFileName = 0x005f88fc "Sound\\Cheer&Whistle.wav"//Sound\Cheer&Whistle.wav

CHAR aKkResult1Wav[] = { 75, 75, 95, 82, 101, 115, 117, 108, 116, 49, 46, 119, 97, 118, 0, 0 };//aKkResult1Wav = 0x005f8914 "KK_Result1.wav"//KK_Result1.wav

CHAR aKkResult2Wav[] = { 75, 75, 95, 82, 101, 115, 117, 108, 116, 50, 46, 119, 97, 118, 0, 0 };//aKkResult2Wav = 0x005f8924 "KK_Result2.wav"//KK_Result2.wav

CHAR byte_4B38E4[] = { 130, 169, 130, 241, 130, 198, 130, 164, 130, 181, 130, 229, 130, 164, 0, 0 };//缓冲剂

CHAR byte_4B38F4[] = { 130, 179, 130, 162, 130, 228, 130, 164, 130, 181, 130, 227, 130, 164, 130, 185, 130, 241, 130, 181, 130, 227, 130, 181, 130, 229, 130, 164, 0, 0, 0, 0 };//最大收敛现象

CHAR byte_4B3914[] = { 130, 200, 130, 223, 130, 196, 130, 233, 130, 226, 130, 194, 130, 197, 130, 181, 130, 229, 130, 164, 0, 0, 0, 0 };//是舔过的家伙吧

CHAR byte_4B392C[] = { 130, 170, 130, 223, 130, 194, 130, 169, 130, 193, 130, 189, 130, 197, 130, 181, 130, 229, 130, 164, 0, 0, 0, 0 };//被人发现了吧

CHAR byte_4B3944[] = { 130, 181, 130, 241, 130, 179, 130, 162, 130, 241, 130, 198, 130, 173, 130, 215, 130, 194, 130, 181, 130, 229, 130, 164, 0, 0, 0, 0 };//细胞分裂症

//CHAR a4d_0[] = { 37, 52, 100, 0 };//a4d_0 = 0x005f89b0 "%4d"//%4d

CHAR byte_4B3964[] = { 147, 95, 0, 0 };//点

CHAR byte_4B3968[] = { 130, 162, 130, 182, 130, 229, 130, 164, 130, 197, 129, 64, 130, 186, 130, 241, 130, 181, 130, 160, 130, 162, 130, 170, 129, 64, 130, 181, 130, 227, 130, 164, 130, 232, 130, 229, 130, 164, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 92, 110, 92, 119, 91, 54, 48, 93, 130, 194, 130, 195, 130, 162, 130, 196, 129, 64, 130, 169, 130, 173, 130, 177, 130, 182, 130, 241, 130, 181, 130, 229, 130, 164, 130, 240, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 130, 162, 130, 189, 130, 181, 130, 220, 130, 183, 129, 73, 0, 0, 0, 0 };//异常情况下，一切都结束了。\\n\w[60]接下来为您揭晓这篇文章！

CHAR byte_4B39D8[] = { 130, 162, 130, 182, 130, 229, 130, 164, 130, 204, 129, 64, 130, 221, 130, 200, 130, 179, 130, 241, 129, 73, 129, 64, 130, 217, 130, 241, 130, 198, 130, 201, 129, 64, 130, 168, 130, 223, 130, 197, 130, 198, 130, 164, 130, 178, 130, 180, 130, 162, 130, 220, 130, 181, 130, 189, 129, 73, 92, 110, 92, 119, 91, 54, 48, 93, 130, 179, 130, 159, 129, 64, 130, 194, 130, 172, 130, 205, 129, 64, 130, 162, 130, 230, 130, 162, 130, 230, 129, 64, 131, 96, 129, 91, 131, 128, 130, 182, 130, 227, 130, 241, 130, 162, 130, 204, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 130, 197, 130, 183, 129, 73, 0, 0, 0, 0 };//异常的各位！真的恭喜了！接下来终于是队伍纯纯的表演了！

CHAR aDemoKkResult3T[] = { 68, 101, 109, 111, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 51, 46, 116, 120, 116, 0 };//aDemoKkResult3T = 0x005f8aa8 "Demo\\KK_Result3.txt"//Demo\KK_Result3.txt

char a1st_0[] = { 42, 49, 115, 116, 0, 0, 0, 0 };//a1st_0 = 0x005f8abc "*1st"//*1st

char a2nd_0[] = { 42, 50, 110, 100, 0, 0, 0, 0 };//a2nd_0 = 0x005f8ac4 "*2nd"//*2nd

char a3rd_0[] = { 42, 51, 114, 100, 0, 0, 0, 0 };//a3rd_0 = 0x005f8acc "*3rd"//*3rd

CHAR aDemoKkResult3T_0[] = { 68, 101, 109, 111, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 51, 46, 116, 120, 116, 0 };//aDemoKkResult3T_0 = 0x005f8ad4 "Demo\\KK_Result3.txt"//Demo\KK_Result3.txt

//CHAR aGraphicKkResul_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 51, 95, 66, 111, 100, 121, 37, 48, 50, 100, 46, 98, 109, 112, 0 };//aGraphicKkResul_0 = 0x005f8ae8 "Graphic\\KK_Result3_Body%02d.bmp"//Graphic\KK_Result3_Body%02d.bmp

CHAR byte_4B3AB8[] = { 130, 179, 130, 159, 129, 73, 129, 64, 130, 162, 130, 230, 130, 162, 130, 230, 129, 64, 130, 187, 130, 164, 130, 178, 130, 164, 129, 64, 130, 182, 130, 227, 130, 241, 130, 162, 130, 204, 129, 64, 130, 205, 130, 193, 130, 210, 130, 229, 130, 164, 130, 197, 130, 183, 129, 73, 92, 119, 91, 54, 48, 93, 92, 110, 130, 160, 130, 200, 130, 189, 130, 204, 129, 64, 131, 96, 129, 91, 131, 128, 130, 204, 129, 64, 130, 164, 130, 241, 130, 223, 130, 162, 130, 205, 129, 73, 129, 72, 0, 0 };//来吧！终于是那样的完美的表现了！你的队伍的命运是！？

CHAR byte_4B3B1C[] = { 130, 197, 130, 205, 129, 99, 129, 64, 0, 0, 0, 0 };//那么

CHAR byte_4B3B28[] = { 130, 187, 130, 181, 130, 196, 129, 73, 129, 64, 0, 0 };//byte_4B3B28 = 0x005f668c "偦偟偰両丂"//然后呢！　

CHAR byte_4B3B34[] = { 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 129, 73, 129, 64, 0, 0 };//byte_4B3B34 = 0x005f6698 "備偆偟傚偆両丂"//晚上好！　

CHAR byte_4B3B44[] = { 130, 190, 130, 162, 130, 81, 136, 202, 129, 73, 129, 64, 0, 0, 0, 0 };//byte_4B3B44 = 0x005f66a8 "偩偄俀埵両丂"//第2名！　

CHAR byte_4B3B54[] = { 130, 190, 130, 162, 130, 82, 136, 202, 129, 73, 129, 64, 0, 0, 0, 0 };//byte_4B3B54 = 0x005f66b8 "偩偄俁埵両丂"//第3名！　

CHAR byte_4B3B64[] = { 130, 190, 130, 162, 130, 83, 136, 202, 129, 73, 129, 64, 0, 0, 0, 0 };//byte_4B3B64 = 第4名！//第4名！　

CHAR byte_4B3B74[] = { 130, 187, 130, 181, 130, 196, 129, 73, 129, 64, 0, 0 };//byte_4B3B74 = 然后呢！//然后呢！　

CHAR byte_4B3B80[] = { 130, 179, 130, 231, 130, 201, 129, 73, 129, 64, 0, 0 };//byte_4B3B80 = 并且！//并且！　

CHAR byte_4B3B8C[] = { 130, 200, 130, 241, 130, 198, 129, 73, 129, 64, 0, 0 };//byte_4B3B8C = 竟然！//竟然！　
word word_4B3B98 = 0x824f;
char byte_4B3B9A;
word word_4B3B9C = 0x8250;
char byte_4B3B9E;
word word_4B3BA0 = 0x8251;
char byte_4B3BA2;
word word_4B3BA4 = 0x8252;
char byte_4B3BA6;
word word_4B3BA8 = 0x8253;
char byte_4B3BAA;
word word_4B3BAC = 0x8254;
char byte_4B3BAE;
word word_4B3BB0 = 0x8255;
char byte_4B3BB2;
word word_4B3BB4 = 0x8256;
char byte_4B3BB6;
word word_4B3BB8 = 0x8257;
char byte_4B3BBA;
word word_4B3BBC = 0x8258;
char byte_4B3BBE;

CHAR byte_4B3BC0[] = { 129, 91, 0, 0 };//-什么

CHAR byte_4B3BC4[] = { 147, 95, 129, 73, 129, 64, 0, 0 };//点！　

CHAR aS_7[] = { 37, 115, 131, 96, 129, 91, 131, 128, 0, 0, 0, 0 };//aS_7 = 0x005f8c1c "%s僠乕儉"//%s团队

CHAR byte_4B3BD8[] = { 129, 73, 129, 73, 92, 110, 0, 0 };//！！\n

CHAR byte_4B3BE0[] = { 130, 220, 130, 197, 129, 73, 129, 72, 92, 110, 0, 0 };//直到！？\n

CHAR byte_4B3BEC[] = { 131, 114, 131, 138, 131, 80, 131, 99, 129, 64, 131, 114, 131, 138, 131, 80, 131, 99, 129, 66, 129, 64, 130, 194, 130, 172, 130, 205, 129, 64, 131, 75, 131, 147, 131, 111, 131, 140, 130, 230, 130, 167, 129, 96, 0, 0, 0, 0 };//比利牛斯比利牛斯。接下来是癌症啊~

CHAR byte_4B3C1C[] = { 130, 226, 130, 193, 130, 189, 130, 203, 129, 73, 0, 0 };//太好了！

CHAR byte_4B3C28[] = { 131, 111, 131, 147, 131, 85, 131, 67, 129, 73, 0, 0 };//万岁！

CHAR byte_4B3C34[] = { 130, 168, 130, 223, 130, 197, 130, 198, 129, 96, 0, 0 };//恭喜～

CHAR byte_4B3C40[] = { 130, 200, 130, 241, 130, 198, 129, 64, 130, 186, 130, 241, 131, 96, 129, 91, 131, 128, 130, 170, 129, 64, 130, 199, 130, 164, 130, 196, 130, 241, 130, 228, 130, 164, 130, 181, 130, 229, 130, 164, 129, 73, 129, 72, 129, 64, 130, 160, 130, 232, 130, 166, 130, 203, 130, 165, 129, 96, 92, 110, 92, 119, 91, 54, 48, 93, 129, 99, 130, 200, 130, 201, 130, 169, 129, 64, 130, 226, 130, 193, 130, 196, 130, 200, 130, 162, 129, 72, 92, 119, 91, 54, 48, 93, 129, 64, 130, 220, 130, 160, 129, 64, 130, 162, 130, 193, 130, 169, 0, 0, 0, 0 };//全队怎么了！？不可能啊~\n\w[60]…有没有做什么？还可以吗

CHAR byte_4B3CB0[] = { 130, 162, 130, 182, 130, 229, 130, 164, 130, 197, 129, 64, 130, 169, 130, 191, 130, 202, 130, 171, 130, 169, 130, 173, 130, 198, 130, 164, 130, 240, 129, 64, 130, 168, 130, 237, 130, 232, 130, 220, 130, 183, 129, 66, 92, 110, 130, 221, 130, 200, 130, 179, 130, 241, 129, 64, 130, 217, 130, 241, 130, 198, 130, 164, 130, 201, 129, 64, 130, 168, 130, 194, 130, 169, 130, 234, 130, 179, 130, 220, 130, 197, 130, 181, 130, 189, 36, 49, 0, 0, 0, 0 };//用异常的方式结束敲击。大家真是辛苦了$1

CHAR aGraphicStagese_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 116, 97, 103, 101, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0 };//aGraphicStagese_0 = 0x005f8d5c "Graphic\\StageSelect.bmp"//Graphic\StageSelect.bmp

//CHAR aStageStage02dS_0[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 95, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0, 0 };//aStageStage02dS_0 = 0x005f8d74 "Stage\\Stage%02d_Select.bmp"//Stage\Stage%02d_Select.bmp

//CHAR aStageStage02dB_0[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 98, 109, 112, 0 };//aStageStage02dB_0 = 0x005f8d90 "Stage\\Stage%02d.bmp"//Stage\Stage%02d.bmp

CHAR byte_4B3D54[] = { 131, 88, 131, 101, 129, 91, 131, 87, 131, 90, 131, 140, 131, 78, 131, 103, 0, 0, 0, 0 };//舞台选择

CHAR asc_4B3D68[] = { 62, 62, 0, 0 };//asc_4B3D68 = 0x005f8db8 ">>"//>>

//CHAR aD_11[] = { 37, 100, 0, 0 };//aD_11 = 0x005f8dbc "%d"//%d

CHAR byte_4B3D70[] = { 131, 137, 131, 147, 131, 95, 131, 128, 0, 0, 0, 0 };//随机

CHAR byte_4B3D7C[] = { 131, 88, 131, 101, 129, 91, 131, 87, 0, 0, 0, 0 };//舞台

//CHAR aD_12[] = { 37, 100, 0, 0 };//aD_12 = 0x005f8dd8 "%d"//%d

//CHAR aS_8[] = { 37, 115, 0, 0 };//aS_8 = 0x005f8ddc "%s"v//%s

CHAR byte_4B3D90[] = { 131, 137, 131, 147, 131, 95, 131, 128, 0, 0, 0, 0 };//随机

CHAR byte_4B3D9C[] = { 131, 88, 131, 101, 129, 91, 131, 87, 129, 64, 129, 64, 0, 0, 0, 0 };//舞台

//CHAR aS_9[] = { 37, 115, 0, 0 };//aS_9 = 0x005f8dfc "%s"//%s

//CHAR a02d_1[] = { 37, 48, 50, 100, 0, 0, 0, 0 };//a02d_1 = 0x005f8e00 "%02d"//%02d

CHAR byte_4B3DB8[] = { 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 129, 64, 131, 88, 131, 101, 129, 91, 131, 87, 130, 170, 129, 64, 130, 185, 130, 241, 130, 189, 130, 173, 130, 179, 130, 234, 130, 220, 130, 183, 0, 0, 0, 0 };//随机选择舞台

CHAR byte_4B3DE4[] = { 130, 162, 130, 182, 130, 229, 130, 164, 130, 197, 129, 64, 130, 230, 130, 235, 130, 181, 130, 175, 130, 234, 130, 206, 0, 0, 0, 0 };//如果可以的话

CHAR byte_4B3E00[] = { 130, 175, 130, 193, 130, 196, 130, 162, 131, 123, 131, 94, 131, 147, 130, 240, 129, 64, 130, 168, 130, 181, 130, 196, 130, 173, 130, 190, 130, 179, 130, 162, 36, 49, 0, 0 };//请按下决定按钮$1

CHAR aDemoKkEndTxt[] = { 68, 101, 109, 111, 92, 75, 75, 95, 69, 110, 100, 46, 116, 120, 116, 0 };//aDemoKkEndTxt = 0x005f8e74 "Demo\\KK_End.txt"//Demo\KK_End.txt

CHAR aKkEndWav[] = { 75, 75, 95, 69, 110, 100, 46, 119, 97, 118, 0, 0 };//aKkEndWav = 0x005f8e84 "KK_End.wav"//KK_End.wav

char aDdEnddemoTxt[] = { 68, 68, 95, 69, 110, 100, 68, 101, 109, 111, 46, 116, 120, 116, 0, 0 };//aDdEnddemoTxt = 0x005f8e90 "DD_EndDemo.txt"//DD_EndDemo.txt



unk byte_4B3E50[] = { 131, 88, 131, 103, 129, 91, 131, 138, 129, 91, 131, 130, 129, 91, 131, 104, 131, 82, 131, 147, 131, 116, 131, 66, 131, 79, 0, 0 };//byte_4B3E50 = 0x005f69b4 "僗僩乕儕乕儌乕僪僐儞僼傿僌"//故事模式配置//故事模式配置

//CHAR byte_4B3E6C[] = { 130, 200, 130, 241, 130, 162, 130, 199, 130, 240, 129, 64, 130, 214, 130, 241, 130, 177, 130, 164, 130, 197, 130, 171, 130, 220, 130, 183, 0, 0, 0, 0 }; //byte_4B3E6C = 0x005f69d0 "側傫偄偳傪丂傊傫偙偆偱偒傑偡"//可以改变难易度

//CHAR byte_4B3E8C[] = { 130, 168, 130, 200, 130, 182, 131, 96, 129, 91, 131, 128, 130, 204, 129, 64, 131, 76, 131, 131, 131, 137, 130, 201, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 130, 170, 129, 64, 130, 160, 130, 189, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//决定是否对同一组的角色进行攻击

//CHAR byte_4B3ED4[] = { 130, 110, 130, 109, 130, 201, 130, 183, 130, 233, 130, 198, 129, 64, 130, 177, 130, 164, 130, 176, 130, 171, 130, 170, 129, 64, 130, 160, 130, 189, 130, 233, 130, 230, 130, 164, 130, 201, 129, 64, 130, 200, 130, 232, 130, 220, 130, 183, 0, 0, 0, 0 };//ON的话会受到攻击

//CHAR byte_4B3F08[] = { 130, 98, 130, 111, 130, 116, 131, 96, 129, 91, 131, 128, 130, 204, 129, 64, 130, 173, 130, 221, 130, 160, 130, 237, 130, 185, 130, 240, 130, 175, 130, 193, 130, 196, 130, 162, 130, 183, 130, 233, 130, 198, 130, 171, 129, 64, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 130, 224, 130, 198, 130, 201, 130, 183, 130, 233, 130, 169, 0, 0, 0, 0 };//决定CPU组组合时是否以文件为基础

//CHAR byte_4B3F50[] = { 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 129, 64, 130, 166, 130, 231, 130, 212, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//随机设置

//CHAR byte_4B3F78[] = { 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 129, 64, 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//设置要使用的设备的值

//CHAR byte_4B3FA4[] = { 130, 189, 130, 162, 130, 169, 130, 162, 130, 201, 129, 64, 130, 179, 130, 241, 130, 169, 130, 183, 130, 233, 129, 64, 131, 96, 129, 91, 131, 128, 130, 204, 129, 64, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定对战双方的队伍

//CHAR byte_4B3FE0[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 204, 129, 64, 131, 96, 129, 91, 131, 128, 130, 224, 129, 64, 130, 211, 130, 173, 130, 241, 130, 190, 129, 64, 130, 169, 130, 184, 130, 200, 130, 204, 130, 197, 129, 64, 130, 191, 130, 227, 130, 164, 130, 162, 0, 0 };//玩家的队伍也包含在内，请注意

//CHAR byte_4B4018[] = { 130, 162, 130, 191, 130, 199, 130, 204, 129, 64, 130, 189, 130, 189, 130, 169, 130, 162, 130, 201, 129, 64, 130, 179, 130, 241, 130, 169, 130, 183, 130, 233, 129, 64, 131, 96, 129, 91, 131, 128, 130, 204, 130, 169, 130, 184, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定一次比赛的三支队伍

//CHAR byte_4B405C[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 130, 240, 129, 64, 130, 181, 130, 230, 130, 164, 130, 183, 130, 233, 130, 169, 129, 64, 130, 181, 130, 200, 130, 162, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//决定做还是不做

//CHAR byte_4B4098[] = { 130, 191, 130, 175, 130, 162, 130, 169, 130, 231, 130, 204, 129, 64, 131, 95, 131, 129, 129, 91, 131, 87, 130, 240, 129, 64, 130, 164, 130, 175, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0 };//确定是否受到来自地形的伤害

//CHAR byte_4B40D4[] = { 130, 187, 130, 173, 130, 181, 130, 183, 130, 233, 130, 191, 130, 175, 130, 162, 130, 240, 129, 64, 130, 228, 130, 164, 130, 177, 130, 164, 130, 201, 130, 183, 130, 233, 130, 169, 130, 199, 130, 164, 130, 169, 130, 240, 129, 64, 130, 185, 130, 193, 130, 196, 130, 162, 130, 181, 130, 220, 130, 183, 0, 0, 0, 0 };//确定是否启用边形

//char funcs_476478[] = {143, 98, 71, 0, 171, 98, 71, 0, 199, 98, 71, 0, 227, 98, 71, 0, 255, 98, 71, 0, 27, 99, 71, 0, 55, 99, 71, 0, 83, 99, 71, 0, 114, 99, 71, 0, 145, 99, 71, 0, 176, 99, 71, 0, 207, 99, 71, 0, 238, 99, 71, 0, 13, 100, 71, 0, 44, 100, 71, 0, 75, 100, 71, 0};

int funcs_476478[] = {
	(int)sub_47628F,//原来是这里少了一个函数导致，按键错误
	(int)sub_4762AB,
	(int)sub_4762C7,
	(int)sub_4762E3,
	(int)sub_4762FF,
	(int)sub_47631B,
	(int)sub_476337,//一般只有这些有用
	(int)sub_476353,
	(int)sub_476372,
	(int)sub_476391,
	(int)sub_4763B0,
	(int)sub_4763CF,
	(int)sub_4763EE,
	(int)0x47642E,//？？？？？
	(int)sub_47642C,
	(int)sub_47644B
};


char byte_4B4154 = 10;

//因为这个是char是无符号char，程序里的是有符号char
//合并
// ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ<>>>人『』をっゃゅょ０１２３４５６７８９あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんィ「ェォッャュョ゛゜ー…！？％／：」アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン<-->><ぁぃぅぇぉ”、。??$1（）VS↑↓1>2>3>4>5>6>7>8>ァゥ誕生日月型座勝敗負UPDOLERI＆位II＋点??十050607080910012121314111916171819
//三个字节为一个字符，741字节,129, 64, 0表示空格
//字符串匹配规则三
//　ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ<>>>人『』をっゃゅょ０１２３４５６７８９あいうえおかきくけこさしすせそたちつてとなにぬねのは
//ひふへほまみむめもやゆよらりるれろわをんィ「ェォッャュョ゛゜ー…！？％／：」アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン<-- >> < ぁぃぅぇぉ”、。・$1（）VS↑↓1>2 > 3 > 4 > 5 > 6 > 7 > 8 > ァゥ誕生日月型座勝敗負UPDOLERI＆位II＋点〜十050607080910012121314111916171819

//这里是日语版的数据
//char byte_4B4158[] = { 129, 64, 0, 130, 96, 0, 130, 97, 0, 130, 98, 0, 130, 99, 0, 130, 100, 0, 130, 101, 0, 130, 102, 0, 130, 103, 0, 130, 104, 0, 130, 105, 0, 130, 106, 0, 130, 107, 0, 130, 108, 0, 130, 109, 0, 130, 110, 0, 130, 111, 0, 130, 112, 0, 130, 113, 0, 130, 114, 0, 130, 115, 0, 130, 116, 0, 130, 117, 0, 130, 118, 0, 130, 119, 0, 130, 120, 0, 130, 121, 0, 130, 129, 0, 130, 130, 0, 130, 131, 0, 130, 132, 0, 130, 133, 0, 130, 134, 0, 130, 135, 0, 130, 136, 0, 130, 137, 0, 130, 138, 0, 130, 139, 0, 130, 140, 0, 130, 141, 0, 130, 142, 0, 130, 143, 0, 130, 144, 0, 130, 145, 0, 130, 146, 0, 130, 147, 0, 130, 148, 0, 130, 149, 0, 130, 150, 0, 130, 151, 0, 130, 152, 0, 130, 153, 0, 130, 154, 0, 60, 62, 0, 62, 62, 0, 144, 108, 0, 129, 119, 0, 129, 120, 0, 130, 240, 0, 130, 193, 0, 130, 225, 0, 130, 227, 0, 130, 229, 0, 130, 79, 0, 130, 80, 0, 130, 81, 0, 130, 82, 0, 130, 83, 0, 130, 84, 0, 130, 85, 0, 130, 86, 0, 130, 87, 0, 130, 88, 0, 130, 160, 0, 130, 162, 0, 130, 164, 0, 130, 166, 0, 130, 168, 0, 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 200, 0, 130, 201, 0, 130, 202, 0, 130, 203, 0, 130, 204, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 130, 220, 0, 130, 221, 0, 130, 222, 0, 130, 223, 0, 130, 224, 0, 130, 226, 0, 130, 228, 0, 130, 230, 0, 130, 231, 0, 130, 232, 0, 130, 233, 0, 130, 234, 0, 130, 235, 0, 130, 237, 0, 130, 240, 0, 130, 241, 0, 131, 66, 0, 129, 117, 0, 131, 70, 0, 131, 72, 0, 131, 98, 0, 131, 131, 0, 131, 133, 0, 131, 135, 0, 129, 74, 0, 129, 75, 0, 129, 91, 0, 129, 99, 0, 129, 73, 0, 129, 72, 0, 129, 147, 0, 129, 94, 0, 129, 70, 0, 129, 118, 0, 131, 65, 0, 131, 67, 0, 131, 69, 0, 131, 71, 0, 131, 73, 0, 131, 74, 0, 131, 76, 0, 131, 78, 0, 131, 80, 0, 131, 82, 0, 131, 84, 0, 131, 86, 0, 131, 88, 0, 131, 90, 0, 131, 92, 0, 131, 94, 0, 131, 96, 0, 131, 99, 0, 131, 101, 0, 131, 103, 0, 131, 105, 0, 131, 106, 0, 131, 107, 0, 131, 108, 0, 131, 109, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 131, 125, 0, 131, 126, 0, 131, 128, 0, 131, 129, 0, 131, 130, 0, 131, 132, 0, 131, 134, 0, 131, 136, 0, 131, 137, 0, 131, 138, 0, 131, 139, 0, 131, 140, 0, 131, 141, 0, 131, 143, 0, 131, 146, 0, 131, 147, 0, 60, 45, 0, 45, 62, 0, 62, 60, 0, 130, 159, 0, 130, 161, 0, 130, 163, 0, 130, 165, 0, 130, 167, 0, 129, 104, 0, 129, 65, 0, 129, 66, 0, 129, 69, 0, 36, 49, 0, 129, 105, 0, 129, 106, 0, 86, 83, 0, 129, 170, 0, 129, 171, 0, 49, 62, 0, 50, 62, 0, 51, 62, 0, 52, 62, 0, 53, 62, 0, 54, 62, 0, 55, 62, 0, 56, 62, 0, 131, 64, 0, 131, 68, 0, 146, 97, 0, 144, 182, 0, 147, 250, 0, 140, 142, 0, 140, 94, 0, 141, 192, 0, 143, 159, 0, 148, 115, 0, 149, 137, 0, 85, 80, 0, 68, 79, 0, 76, 69, 0, 82, 73, 0, 129, 149, 0, 136, 202, 0, 73, 73, 0, 129, 123, 0, 147, 95, 0, 129, 96, 0, 143, 92, 0, 48, 53, 0, 48, 54, 0, 48, 55, 0, 48, 56, 0, 48, 57, 0, 49, 48, 0, 48, 49, 50, 49, 50, 0, 49, 51, 0, 49, 52, 0, 49, 49, 0, 49, 57, 0, 49, 54, 0, 49, 55, 0, 49, 56, 0, 49, 57 ,0};
//char byte_4B4159[] = {64, 0, 130, 96, 0, 130, 97, 0, 130, 98, 0, 130, 99, 0, 130, 100, 0, 130, 101, 0, 130, 102, 0, 130, 103, 0, 130, 104, 0, 130, 105, 0, 130, 106, 0, 130, 107, 0, 130, 108, 0, 130, 109, 0, 130, 110, 0, 130, 111, 0, 130, 112, 0, 130, 113, 0, 130, 114, 0, 130, 115, 0, 130, 116, 0, 130, 117, 0, 130, 118, 0, 130, 119, 0, 130, 120, 0, 130, 121, 0, 130, 129, 0, 130, 130, 0, 130, 131, 0, 130, 132, 0, 130, 133, 0, 130, 134, 0, 130, 135, 0, 130, 136, 0, 130, 137, 0, 130, 138, 0, 130, 139, 0, 130, 140, 0, 130, 141, 0, 130, 142, 0, 130, 143, 0, 130, 144, 0, 130, 145, 0, 130, 146, 0, 130, 147, 0, 130, 148, 0, 130, 149, 0, 130, 150, 0, 130, 151, 0, 130, 152, 0, 130, 153, 0, 130, 154, 0, 60, 62, 0, 62, 62, 0, 144, 108, 0, 129, 119, 0, 129, 120, 0, 130, 240, 0, 130, 193, 0, 130, 225, 0, 130, 227, 0, 130, 229, 0, 130, 79, 0, 130, 80, 0, 130, 81, 0, 130, 82, 0, 130, 83, 0, 130, 84, 0, 130, 85, 0, 130, 86, 0, 130, 87, 0, 130, 88, 0, 130, 160, 0, 130, 162, 0, 130, 164, 0, 130, 166, 0, 130, 168, 0, 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 200, 0, 130, 201, 0, 130, 202, 0, 130, 203, 0, 130, 204, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 130, 220, 0, 130, 221, 0, 130, 222, 0, 130, 223, 0, 130, 224, 0, 130, 226, 0, 130, 228, 0, 130, 230, 0, 130, 231, 0, 130, 232, 0, 130, 233, 0, 130, 234, 0, 130, 235, 0, 130, 237, 0, 130, 240, 0, 130, 241, 0, 131, 66, 0, 129, 117, 0, 131, 70, 0, 131, 72, 0, 131, 98, 0, 131, 131, 0, 131, 133, 0, 131, 135, 0, 129, 74, 0, 129, 75, 0, 129, 91, 0, 129, 99, 0, 129, 73, 0, 129, 72, 0, 129, 147, 0, 129, 94, 0, 129, 70, 0, 129, 118, 0, 131, 65, 0, 131, 67, 0, 131, 69, 0, 131, 71, 0, 131, 73, 0, 131, 74, 0, 131, 76, 0, 131, 78, 0, 131, 80, 0, 131, 82, 0, 131, 84, 0, 131, 86, 0, 131, 88, 0, 131, 90, 0, 131, 92, 0, 131, 94, 0, 131, 96, 0, 131, 99, 0, 131, 101, 0, 131, 103, 0, 131, 105, 0, 131, 106, 0, 131, 107, 0, 131, 108, 0, 131, 109, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 131, 125, 0, 131, 126, 0, 131, 128, 0, 131, 129, 0, 131, 130, 0, 131, 132, 0, 131, 134, 0, 131, 136, 0, 131, 137, 0, 131, 138, 0, 131, 139, 0, 131, 140, 0, 131, 141, 0, 131, 143, 0, 131, 146, 0, 131, 147, 0, 60, 45, 0, 45, 62, 0, 62, 60, 0, 130, 159, 0, 130, 161, 0, 130, 163, 0, 130, 165, 0, 130, 167, 0, 129, 104, 0, 129, 65, 0, 129, 66, 0, 129, 69, 0, 36, 49, 0, 129, 105, 0, 129, 106, 0, 86, 83, 0, 129, 170, 0, 129, 171, 0, 49, 62, 0, 50, 62, 0, 51, 62, 0, 52, 62, 0, 53, 62, 0, 54, 62, 0, 55, 62, 0, 56, 62, 0, 131, 64, 0, 131, 68, 0, 146, 97, 0, 144, 182, 0, 147, 250, 0, 140, 142, 0, 140, 94, 0, 141, 192, 0, 143, 159, 0, 148, 115, 0, 149, 137, 0, 85, 80, 0, 68, 79, 0, 76, 69, 0, 82, 73, 0, 129, 149, 0, 136, 202, 0, 73, 73, 0, 129, 123, 0, 147, 95, 0, 129, 96, 0, 143, 92, 0, 48, 53, 0, 48, 54, 0, 48, 55, 0, 48, 56, 0, 48, 57, 0, 49, 48, 0, 48, 49, 50, 49, 50, 0, 49, 51, 0, 49, 52, 0, 49, 49, 0, 49, 57, 0, 49, 54, 0, 49, 55, 0, 49, 56, 0, 49, 57 ,0};//@ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ<>>>人『』をっゃゅょ０１２３４５６７８９あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんィ「ェォッャュョ゛゜ー…！？％／：」アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン<-->><ぁぃぅぇぉ”、。??$1（）VS↑↓1>2>3>4>5>6>7>8>ァゥ誕生日月型座勝敗負UPDOLERI＆位II＋点??十050607080910012121314111916171819

//中文版的数据
char byte_4B4158[] = { 129, 64, 0, 130, 96, 0, 130, 97, 0, 130, 98, 0, 130, 99, 0, 130, 100, 0, 130, 101, 0, 130, 102, 0, 130, 103, 0, 130, 104, 0, 130, 105, 0, 130, 106, 0, 130, 107, 0, 130, 108, 0, 130, 109, 0, 130, 110, 0, 130, 111, 0, 130, 112, 0, 130, 113, 0, 130, 114, 0, 130, 115, 0, 130, 116, 0, 130, 117, 0, 130, 118, 0, 130, 119, 0, 130, 120, 0, 130, 121, 0, 130, 129, 0, 130, 130, 0, 130, 131, 0, 130, 132, 0, 130, 133, 0, 130, 134, 0, 130, 135, 0, 130, 136, 0, 130, 137, 0, 130, 138, 0, 130, 139, 0, 130, 140, 0, 130, 141, 0, 130, 142, 0, 130, 143, 0, 130, 144, 0, 130, 145, 0, 130, 146, 0, 130, 147, 0, 130, 148, 0, 130, 149, 0, 130, 150, 0, 130, 151, 0, 130, 152, 0, 130, 153, 0, 130, 154, 0, 60, 62, 0, 62, 62, 0, 144, 108, 0, 129, 119, 0, 129, 120, 0, 130, 240, 0, 130, 193, 0, 130, 225, 0, 130, 227, 0, 130, 229, 0, 130, 79, 0, 130, 80, 0, 130, 81, 0, 130, 82, 0, 130, 83, 0, 130, 84, 0, 130, 85, 0, 130, 86, 0, 130, 87, 0, 130, 88, 0, 130, 160, 0, 130, 162, 0, 130, 164, 0, 130, 166, 0, 130, 168, 0, 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 200, 0, 130, 201, 0, 130, 202, 0, 130, 203, 0, 130, 204, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 130, 220, 0, 130, 221, 0, 130, 222, 0, 130, 223, 0, 130, 224, 0, 130, 226, 0, 130, 228, 0, 130, 230, 0, 130, 231, 0, 130, 232, 0, 130, 233, 0, 130, 234, 0, 130, 235, 0, 130, 237, 0, 130, 240, 0, 130, 241, 0, 131, 66, 0, 129, 117, 0, 186, 207, 0, 204, 229, 0, 188, 188, 0, 196, 220, 0, 191, 170, 0, 185, 216, 0, 129, 74, 0, 129, 75, 0, 129, 91, 0, 129, 99, 0, 129, 73, 0, 129, 72, 0, 129, 147, 0, 129, 94, 0, 129, 70, 0, 129, 118, 0, 194, 210, 0, 180, 230, 0, 185, 166, 0, 183, 242, 0, 202, 253, 0, 193, 191, 0, 213, 226, 0, 212, 241, 0, 181, 192, 0, 200, 225, 0, 201, 250, 0, 196, 209, 0, 188, 199, 0, 194, 188, 0, 208, 194, 0, 211, 206, 0, 207, 183, 0, 188, 204, 0, 208, 248, 0, 202, 189, 0, 203, 192, 0, 205, 246, 0, 190, 223, 0, 184, 196, 0, 177, 228, 0, 182, 212, 0, 192, 224, 0, 208, 205, 0, 179, 161, 0, 190, 176, 0, 205, 230, 0, 188, 210, 0, 207, 221, 0, 218, 229, 0, 196, 163, 0, 202, 194, 0, 201, 203, 0, 186, 166, 0, 206, 239, 0, 185, 202, 0, 213, 189, 0, 209, 161, 0, 184, 241, 0, 182, 183, 0, 177, 200, 46, 200, 252, 0, 60, 45, 0, 45, 62, 0, 62, 60, 0, 182, 211, 0, 206, 233, 0, 207, 212, 0, 202, 190, 0, 200, 203, 0, 129, 104, 0, 129, 65, 0, 129, 66, 0, 129, 69, 0, 36, 49, 0, 129, 105, 0, 129, 106, 0, 86, 83, 0, 129, 170, 0, 129, 171, 0, 49, 62, 0, 50, 62, 0, 51, 62, 0, 52, 62, 0, 53, 62, 0, 54, 62, 0, 55, 62, 0, 56, 62, 0, 202, 199, 0, 178, 187, 0, 181, 196, 0, 184, 246, 0, 211, 209, 0, 208, 197, 0, 207, 162, 0, 197, 197, 0, 195, 251, 0, 215, 197, 0, 181, 216, 0, 201, 207, 0, 207, 194, 0, 215, 243, 0, 211, 210, 0, 129, 149, 0, 136, 202, 0, 73, 73, 0, 129, 123, 0, 191, 236, 0, 129, 96, 0, 129, 148, 0, 187, 247, 0, 201, 232, 0, 214, 195, 0, 200, 173, 46, 205, 200, 0, 205, 182, 0, 203, 217, 46, 182, 200, 0, 183, 192, 46, 211, 249, 0, 183, 214, 0, 183, 180, 46, 206, 228, 0, 198, 247, 0, 204, 248, 0, 0, 0 };
char byte_4B4159[] = { 64, 0, 130, 96, 0, 130, 97, 0, 130, 98, 0, 130, 99, 0, 130, 100, 0, 130, 101, 0, 130, 102, 0, 130, 103, 0, 130, 104, 0, 130, 105, 0, 130, 106, 0, 130, 107, 0, 130, 108, 0, 130, 109, 0, 130, 110, 0, 130, 111, 0, 130, 112, 0, 130, 113, 0, 130, 114, 0, 130, 115, 0, 130, 116, 0, 130, 117, 0, 130, 118, 0, 130, 119, 0, 130, 120, 0, 130, 121, 0, 130, 129, 0, 130, 130, 0, 130, 131, 0, 130, 132, 0, 130, 133, 0, 130, 134, 0, 130, 135, 0, 130, 136, 0, 130, 137, 0, 130, 138, 0, 130, 139, 0, 130, 140, 0, 130, 141, 0, 130, 142, 0, 130, 143, 0, 130, 144, 0, 130, 145, 0, 130, 146, 0, 130, 147, 0, 130, 148, 0, 130, 149, 0, 130, 150, 0, 130, 151, 0, 130, 152, 0, 130, 153, 0, 130, 154, 0, 60, 62, 0, 62, 62, 0, 144, 108, 0, 129, 119, 0, 129, 120, 0, 130, 240, 0, 130, 193, 0, 130, 225, 0, 130, 227, 0, 130, 229, 0, 130, 79, 0, 130, 80, 0, 130, 81, 0, 130, 82, 0, 130, 83, 0, 130, 84, 0, 130, 85, 0, 130, 86, 0, 130, 87, 0, 130, 88, 0, 130, 160, 0, 130, 162, 0, 130, 164, 0, 130, 166, 0, 130, 168, 0, 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 200, 0, 130, 201, 0, 130, 202, 0, 130, 203, 0, 130, 204, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 130, 220, 0, 130, 221, 0, 130, 222, 0, 130, 223, 0, 130, 224, 0, 130, 226, 0, 130, 228, 0, 130, 230, 0, 130, 231, 0, 130, 232, 0, 130, 233, 0, 130, 234, 0, 130, 235, 0, 130, 237, 0, 130, 240, 0, 130, 241, 0, 131, 66, 0, 129, 117, 0, 186, 207, 0, 204, 229, 0, 188, 188, 0, 196, 220, 0, 191, 170, 0, 185, 216, 0, 129, 74, 0, 129, 75, 0, 129, 91, 0, 129, 99, 0, 129, 73, 0, 129, 72, 0, 129, 147, 0, 129, 94, 0, 129, 70, 0, 129, 118, 0, 194, 210, 0, 180, 230, 0, 185, 166, 0, 183, 242, 0, 202, 253, 0, 193, 191, 0, 213, 226, 0, 212, 241, 0, 181, 192, 0, 200, 225, 0, 201, 250, 0, 196, 209, 0, 188, 199, 0, 194, 188, 0, 208, 194, 0, 211, 206, 0, 207, 183, 0, 188, 204, 0, 208, 248, 0, 202, 189, 0, 203, 192, 0, 205, 246, 0, 190, 223, 0, 184, 196, 0, 177, 228, 0, 182, 212, 0, 192, 224, 0, 208, 205, 0, 179, 161, 0, 190, 176, 0, 205, 230, 0, 188, 210, 0, 207, 221, 0, 218, 229, 0, 196, 163, 0, 202, 194, 0, 201, 203, 0, 186, 166, 0, 206, 239, 0, 185, 202, 0, 213, 189, 0, 209, 161, 0, 184, 241, 0, 182, 183, 0, 177, 200, 46, 200, 252, 0, 60, 45, 0, 45, 62, 0, 62, 60, 0, 182, 211, 0, 206, 233, 0, 207, 212, 0, 202, 190, 0, 200, 203, 0, 129, 104, 0, 129, 65, 0, 129, 66, 0, 129, 69, 0, 36, 49, 0, 129, 105, 0, 129, 106, 0, 86, 83, 0, 129, 170, 0, 129, 171, 0, 49, 62, 0, 50, 62, 0, 51, 62, 0, 52, 62, 0, 53, 62, 0, 54, 62, 0, 55, 62, 0, 56, 62, 0, 202, 199, 0, 178, 187, 0, 181, 196, 0, 184, 246, 0, 211, 209, 0, 208, 197, 0, 207, 162, 0, 197, 197, 0, 195, 251, 0, 215, 197, 0, 181, 216, 0, 201, 207, 0, 207, 194, 0, 215, 243, 0, 211, 210, 0, 129, 149, 0, 136, 202, 0, 73, 73, 0, 129, 123, 0, 191, 236, 0, 129, 96, 0, 129, 148, 0, 187, 247, 0, 201, 232, 0, 214, 195, 0, 200, 173, 46, 205, 200, 0, 205, 182, 0, 203, 217, 46, 182, 200, 0, 183, 192, 46, 211, 249, 0, 183, 214, 0, 183, 180, 46, 206, 228, 0, 198, 247, 0, 204, 248, 0, 0, 0 };


//字符串匹配规则1
//合并了
//がぎぐげござじずぜぞだぢづでどばびぶべぼガギグゲゴザジズゼゾダヂヅデドバビブベボヴ
//突然间，突然间，突然间，突然间，这个是无效的，因为上面是发音
//char byte_4B443C[] = { 130, 170, 0, 130, 172, 0, 130, 174, 0, 130, 176, 0, 130, 178, 0, 130, 180, 0, 130, 182, 0, 130, 184, 0, 130, 186, 0, 130, 188, 0, 130, 190, 0, 130, 192, 0, 130, 195, 0, 130, 197, 0, 130, 199, 0, 130, 206, 0, 130, 209, 0, 130, 212, 0, 130, 215, 0, 130, 218, 0, 131, 75, 0, 131, 77, 0, 131, 79, 0, 131, 81, 0, 131, 83, 0, 131, 85, 0, 131, 87, 0, 131, 89, 0, 131, 91, 0, 131, 93, 0, 131, 95, 0, 131, 97, 0, 131, 100, 0, 131, 102, 0, 131, 104, 0, 131, 111, 0, 131, 114, 0, 131, 117, 0, 131, 120, 0, 131, 123, 0, 131, 148, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//??ぎぐげござじずぜぞだぢづでどばびぶべぼガギグゲゴザジズゼゾダヂヅデドバビブベボヴ
//char byte_4B443D[] = { 170, 0, 130, 172, 0, 130, 174, 0, 130, 176, 0, 130, 178, 0, 130, 180, 0, 130, 182, 0, 130, 184, 0, 130, 186, 0, 130, 188, 0, 130, 190, 0, 130, 192, 0, 130, 195, 0, 130, 197, 0, 130, 199, 0, 130, 206, 0, 130, 209, 0, 130, 212, 0, 130, 215, 0, 130, 218, 0, 131, 75, 0, 131, 77, 0, 131, 79, 0, 131, 81, 0, 131, 83, 0, 131, 85, 0, 131, 87, 0, 131, 89, 0, 131, 91, 0, 131, 93, 0, 131, 95, 0, 131, 97, 0, 131, 100, 0, 131, 102, 0, 131, 104, 0, 131, 111, 0, 131, 114, 0, 131, 117, 0, 131, 120, 0, 131, 123, 0, 131, 148, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//??ぎぐげござじずぜぞだぢづでどばびぶべぼガギグゲゴザジズゼゾダヂヅデドバビブベボヴ

//一样的
//中文版数据
char byte_4B443C[] = { 130, 170, 0, 130, 172, 0, 130, 174, 0, 130, 176, 0, 130, 178, 0, 130, 180, 0, 130, 182, 0, 130, 184, 0, 130, 186, 0, 130, 188, 0, 130, 190, 0, 130, 192, 0, 130, 195, 0, 130, 197, 0, 130, 199, 0, 130, 206, 0, 130, 209, 0, 130, 212, 0, 130, 215, 0, 130, 218, 0, 131, 75, 0, 131, 77, 0, 131, 79, 0, 131, 81, 0, 131, 83, 0, 131, 85, 0, 131, 87, 0, 131, 89, 0, 131, 91, 0, 131, 93, 0, 131, 95, 0, 131, 97, 0, 131, 100, 0, 131, 102, 0, 131, 104, 0, 131, 111, 0, 131, 114, 0, 131, 117, 0, 131, 120, 0, 131, 123, 0, 131, 148, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B443D[] = { 170, 0, 130, 172, 0, 130, 174, 0, 130, 176, 0, 130, 178, 0, 130, 180, 0, 130, 182, 0, 130, 184, 0, 130, 186, 0, 130, 188, 0, 130, 190, 0, 130, 192, 0, 130, 195, 0, 130, 197, 0, 130, 199, 0, 130, 206, 0, 130, 209, 0, 130, 212, 0, 130, 215, 0, 130, 218, 0, 131, 75, 0, 131, 77, 0, 131, 79, 0, 131, 81, 0, 131, 83, 0, 131, 85, 0, 131, 87, 0, 131, 89, 0, 131, 91, 0, 131, 93, 0, 131, 95, 0, 131, 97, 0, 131, 100, 0, 131, 102, 0, 131, 104, 0, 131, 111, 0, 131, 114, 0, 131, 117, 0, 131, 120, 0, 131, 123, 0, 131, 148, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };


//字符串规则1匹配后替换的字符
//合并了
//かきくけこさしすせそたちつてとはひふへほカキクケコサシスセソタチツテトハヒフヘホウ
//划伤操作，划伤操作，划伤操作，划伤操作，划伤操作，这个是无效的，因为上面是发音
//一样的
char byte_4B4530[] = { 130, 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 74, 0, 131, 76, 0, 131, 78, 0, 131, 80, 0, 131, 82, 0, 131, 84, 0, 131, 86, 0, 131, 88, 0, 131, 90, 0, 131, 92, 0, 131, 94, 0, 131, 96, 0, 131, 99, 0, 131, 101, 0, 131, 103, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 131, 69, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//??きくけこさしすせそたちつてとはひふへほカキクケコサシスセソタチツテトハヒフヘホウ
char byte_4B4531[] = { 169, 0, 130, 171, 0, 130, 173, 0, 130, 175, 0, 130, 177, 0, 130, 179, 0, 130, 181, 0, 130, 183, 0, 130, 185, 0, 130, 187, 0, 130, 189, 0, 130, 191, 0, 130, 194, 0, 130, 196, 0, 130, 198, 0, 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 74, 0, 131, 76, 0, 131, 78, 0, 131, 80, 0, 131, 82, 0, 131, 84, 0, 131, 86, 0, 131, 88, 0, 131, 90, 0, 131, 92, 0, 131, 94, 0, 131, 96, 0, 131, 99, 0, 131, 101, 0, 131, 103, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 131, 69, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//??きくけこさしすせそたちつてとはひふへほカキクケコサシスセソタチツテトハヒフヘホウ

//字符串匹配规则2
//合并
//ぱぴぷぺぽパピプペポ
//啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒啪嗒，这个是无效的，因为上面是发音
//中文一样的
char byte_4B4624[] = { 130, 207, 0, 130, 210, 0, 130, 213, 0, 130, 216, 0, 130, 219, 0, 131, 112, 0, 131, 115, 0, 131, 118, 0, 131, 121, 0, 131, 124, 0, 0, 0 };//??ぴぷぺぽパピプペポ
char byte_4B4625[] = { 207, 0, 130, 210, 0, 130, 213, 0, 130, 216, 0, 130, 219, 0, 131, 112, 0, 131, 115, 0, 131, 118, 0, 131, 121, 0, 131, 124, 0, 0, 0 };//??ぴぷぺぽパピプペポ

//字符串匹配规则2替换的字符
//合并
//はひふへほハヒフヘホ
//哈哈哈哈哈哈，这个是无效的，因为上面是发音
//char byte_4B4644[] = { 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 0, 0 };//??ひふへほハヒフヘホ
//char byte_4B4645[] = { 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 0, 0 };//??ひふへほハヒフヘホ

//中文版的
char byte_4B4644[] = { 130, 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 129, 91, 131, 86, 131, 131, 131, 139, 131, 65, 129, 91, 131, 99, 0, 0, 131, 74, 131, 147, 131, 116, 129, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 182, 130, 227, 130, 164, 130, 199, 130, 164, 130, 169, 0, 0, 0, 0, 0, 0, 131, 94, 131, 67, 131, 75, 129, 91, 131, 125, 131, 88, 131, 78, 0, 0, 0, 0, 0, 0 };
char byte_4B4645[] = { 205, 0, 130, 208, 0, 130, 211, 0, 130, 214, 0, 130, 217, 0, 131, 110, 0, 131, 113, 0, 131, 116, 0, 131, 119, 0, 131, 122, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 129, 91, 131, 86, 131, 131, 131, 139, 131, 65, 129, 91, 131, 99, 0, 0, 131, 74, 131, 147, 131, 116, 129, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 182, 130, 227, 130, 164, 130, 199, 130, 164, 130, 169, 0, 0, 0, 0, 0, 0, 131, 94, 131, 67, 131, 75, 129, 91, 131, 125, 131, 88, 131, 78, 0, 0, 0, 0, 0, 0 };


unk byte_4B4664[] = { 130, 169, 130, 173, 130, 198, 130, 164, 130, 169, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 129, 91, 131, 86, 131, 131, 131, 139, 131, 65, 129, 91, 131, 99, 0, 0, 131, 101, 131, 82, 131, 147, 131, 104, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 130, 182, 130, 227, 130, 164, 130, 199, 130, 164, 130, 169, 0, 0, 0, 0, 0, 0, 131, 94, 131, 67, 131, 75, 129, 91, 131, 125, 131, 88, 131, 78, 0, 0, 0, 0, 0, 0 };//かくとうかマーシャルアーツテコンドじゅうどうかタイガーマスク

/* 无马赫踢球马赫潘奇巴克雷茨基克斯皮尔·阿塔克马赫脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩脚踩
波吉洛丁－波多尔（Bostorm）护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板护板
每一个特殊的双凸点，特别是硝基攻击，超级防御，球尖，马赫
快速启动和未完成的技术人员
豆沙包和压缩和细分II
主控和分裂*/
//なしマッハキックマッハパンチバクレツキックスピンアタックマッハふみふみトルネードアタックハイスピンキックジャンプギロチンジャンプエルボーストーンガードりゅうびらんぷうきゃくばくまりゅうじんきゃくてんさつりゅうじんけんせんぷうきゃくばくだんパンチスクリューパイルドライバーダブルチョップマッハチョップのーてんチョップオーラパンチためパンチずつきスペシャルダブルラリアットはりてスペシャルニトロアタックハイパーガードひのたまスパイクマッハたたきわーぷしゅーともずおとししゅーとかんつうしゅーとぼうじゅつスペシャルハリケーンクラッシュやまだのじゅつにんげんどりるにんげんぎょらいじぶんぎょらいへんしんわざびっぐばんぐＪ??スルーくびかりなげマッハきうきうすくりゅうぶーめらんしゅーとさんれんぱんちマッハキックIIマッハパンチIIあんますぺしゃるかっくんしゅーとあっしゅくしゅーとおぶおぶしゅーとなっつしゅーとじぶんしゅりけんすくりゅうIIおんそくなげだぶるすくりゅーごーじゃすぱんちころころどんすーぱーげんこつかそくしゅーとあっぱーしゅーといなずましゅーとすくりゅうしゅーとぶんれつしゅーとすねーくしゅーとほえほえしゅーとえんりんしゅーとぶよぶよしゅーとでたらめしゅーとらんだむしゅーとオーバーヘッドキックテレポート
unk byte_4B46C0[] = { 130, 200, 130, 181, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 111, 131, 78, 131, 140, 131, 99, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 88, 131, 115, 131, 147, 131, 65, 131, 94, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 130, 211, 130, 221, 130, 211, 130, 221, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 103, 131, 139, 131, 108, 129, 91, 131, 104, 131, 65, 131, 94, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 110, 131, 67, 131, 88, 131, 115, 131, 147, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 131, 77, 131, 141, 131, 96, 131, 147, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 131, 71, 131, 139, 131, 123, 129, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 88, 131, 103, 129, 91, 131, 147, 131, 75, 129, 91, 131, 104, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 232, 130, 227, 130, 164, 130, 209, 130, 231, 130, 241, 130, 213, 130, 164, 130, 171, 130, 225, 130, 173, 0, 0, 0, 0, 0, 130, 206, 130, 173, 130, 220, 130, 232, 130, 227, 130, 164, 130, 182, 130, 241, 130, 171, 130, 225, 130, 173, 0, 0, 0, 0, 0, 130, 196, 130, 241, 130, 179, 130, 194, 130, 232, 130, 227, 130, 164, 130, 182, 130, 241, 130, 175, 130, 241, 0, 0, 0, 0, 0, 130, 185, 130, 241, 130, 213, 130, 164, 130, 171, 130, 225, 130, 173, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 206, 130, 173, 130, 190, 130, 241, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 88, 131, 78, 131, 138, 131, 133, 129, 91, 131, 112, 131, 67, 131, 139, 131, 104, 131, 137, 131, 67, 131, 111, 129, 91, 0, 131, 95, 131, 117, 131, 139, 131, 96, 131, 135, 131, 98, 131, 118, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 131, 96, 131, 135, 131, 98, 131, 118, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 204, 129, 91, 130, 196, 130, 241, 131, 96, 131, 135, 131, 98, 131, 118, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 73, 129, 91, 131, 137, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 189, 130, 223, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 184, 130, 194, 130, 171, 131, 88, 131, 121, 131, 86, 131, 131, 131, 139, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 117, 131, 139, 131, 137, 131, 138, 131, 65, 131, 98, 131, 103, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 205, 130, 232, 130, 196, 131, 88, 131, 121, 131, 86, 131, 131, 131, 139, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 106, 131, 103, 131, 141, 131, 65, 131, 94, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 110, 131, 67, 131, 112, 129, 91, 131, 75, 129, 91, 131, 104, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 208, 130, 204, 130, 189, 130, 220, 131, 88, 131, 112, 131, 67, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 130, 189, 130, 189, 130, 171, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 237, 129, 91, 130, 213, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 224, 130, 184, 130, 168, 130, 198, 130, 181, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 169, 130, 241, 130, 194, 130, 164, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 218, 130, 164, 130, 182, 130, 227, 130, 194, 131, 88, 131, 121, 131, 86, 131, 131, 131, 139, 0, 0, 0, 0, 0, 0, 0, 131, 110, 131, 138, 131, 80, 129, 91, 131, 147, 131, 78, 131, 137, 131, 98, 131, 86, 131, 133, 0, 0, 0, 0, 0, 0, 0, 130, 226, 130, 220, 130, 190, 130, 204, 130, 182, 130, 227, 130, 194, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 201, 130, 241, 130, 176, 130, 241, 130, 199, 130, 232, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 201, 130, 241, 130, 176, 130, 241, 130, 172, 130, 229, 130, 231, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 182, 130, 212, 130, 241, 130, 172, 130, 229, 130, 231, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 214, 130, 241, 130, 181, 130, 241, 130, 237, 130, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 209, 130, 193, 130, 174, 130, 206, 130, 241, 130, 174, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 105, 129, 69, 131, 88, 131, 139, 129, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 173, 130, 209, 130, 169, 130, 232, 130, 200, 130, 176, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 130, 171, 130, 164, 130, 171, 130, 164, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 173, 130, 232, 130, 227, 130, 164, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 212, 129, 91, 130, 223, 130, 231, 130, 241, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 179, 130, 241, 130, 234, 130, 241, 130, 207, 130, 241, 130, 191, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 131, 76, 131, 98, 131, 78, 73, 73, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 125, 131, 98, 131, 110, 131, 112, 131, 147, 131, 96, 73, 73, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 160, 130, 241, 130, 220, 130, 183, 130, 216, 130, 181, 130, 225, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 169, 130, 193, 130, 173, 130, 241, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 160, 130, 193, 130, 181, 130, 227, 130, 173, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 168, 130, 212, 130, 168, 130, 212, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 200, 130, 193, 130, 194, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 182, 130, 212, 130, 241, 130, 181, 130, 227, 130, 232, 130, 175, 130, 241, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 173, 130, 232, 130, 227, 130, 164, 73, 73, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 168, 130, 241, 130, 187, 130, 173, 130, 200, 130, 176, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 190, 130, 212, 130, 233, 130, 183, 130, 173, 130, 232, 130, 227, 129, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 178, 129, 91, 130, 182, 130, 225, 130, 183, 130, 207, 130, 241, 130, 191, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 177, 130, 235, 130, 177, 130, 235, 130, 199, 130, 241, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 129, 91, 130, 207, 129, 91, 130, 176, 130, 241, 130, 177, 130, 194, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 169, 130, 187, 130, 173, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 160, 130, 193, 130, 207, 129, 91, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 162, 130, 200, 130, 184, 130, 220, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 173, 130, 232, 130, 227, 130, 164, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 212, 130, 241, 130, 234, 130, 194, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 203, 129, 91, 130, 173, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 217, 130, 166, 130, 217, 130, 166, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 166, 130, 241, 130, 232, 130, 241, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 212, 130, 230, 130, 212, 130, 230, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 197, 130, 189, 130, 231, 130, 223, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 231, 130, 241, 130, 190, 130, 222, 130, 181, 130, 227, 129, 91, 130, 198, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 73, 129, 91, 131, 111, 129, 91, 131, 119, 131, 98, 131, 104, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 131, 101, 131, 140, 131, 124, 129, 91, 131, 103, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

unk byte_4B4E74[] = { 36, 49, 131, 88, 129, 91, 131, 112, 129, 91, 131, 65, 129, 91, 131, 125, 129, 91, 0, 0, 0, 36, 49, 131, 110, 131, 67, 131, 112, 129, 91, 131, 65, 129, 91, 131, 125, 129, 91, 0, 0, 0, 36, 49, 130, 203, 130, 193, 130, 175, 130, 194, 130, 177, 130, 164, 130, 205, 0, 0, 0, 0, 0, 36, 49, 130, 187, 130, 177, 130, 192, 130, 169, 130, 231, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 49, 130, 162, 130, 190, 130, 196, 130, 241, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 49, 131, 104, 131, 98, 131, 87, 131, 101, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 49, 130, 173, 130, 164, 130, 191, 130, 227, 130, 164, 130, 179, 130, 193, 130, 219, 130, 164, 0, 36, 49, 130, 212, 130, 171, 130, 200, 130, 176, 130, 169, 130, 173, 130, 185, 130, 162, 0, 0, 0, 36, 49, 130, 177, 130, 164, 130, 169, 130, 170, 130, 81, 130, 206, 130, 162, 0, 0, 0, 0, 0, 36, 49, 130, 212, 130, 171, 131, 75, 129, 91, 131, 104, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 49, 130, 218, 130, 241, 130, 206, 129, 91, 130, 220, 130, 241, 0, 0, 0, 0, 0, 0, 0, 36, 49, 130, 203, 130, 189, 130, 211, 130, 232, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 49, 130, 164, 130, 221, 130, 241, 130, 191, 130, 227, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//$1スーパーアーマー$1ハイパーアーマー$1ねっけつこうは$1そこぢから$1いだてん$1ドッジテク$1くうちゅうさっぽう$1ぶきなげかくせい$1こうかが２ばい$1ぶきガード$1ぼんばーまん$1ねたふり$1うみんちゅ

//脚蹬腿变化，冲头变化，冲头下降到脚蹬腿上，在脚蹬腿\n附近，脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬脚蹬拿着拳头破折号向DJ投掷武器\n拿着拳头向UP2打之后把倒下的角色\n顺便踢到空中的时候\nDO+在拳中的话\nDO＋穿孔＋踢球时\nUP2开破折号穿孔或\nDJ穿孔使之命中的DJ穿孔命中时\n十键的前马海苔上踢破折号跳跃垂下的脚的附近\n朝向踢破折号中或DJ中\n投掷武器的接口用穿孔或踢\n十键定向随机拉拽技能\n被决定
//キックがへんかパンチがへんかちゃくちじにキックちゃくちじにパンチダウンしたてきのあたまかあしの\nちかくでキックＤＪキックヒットじに\nDOいがいダッシュジャンプじにDOジャンプかこうちゅうに\nキックジャンプかこうちゅうに\nパンチガードがへんかジャンプちゅうにキックジャンプちゅうかＤＪちゅうに\nキックなげがへんかななめジャンプちゅうに\nパンチすいちょくジャンプちゅうに\nパンチパンチためダッシュかＤＪちゅうに\nパンチダッシュちゅうにパンチダッシュちゅうにまえ２かいこうげきをすんぜんでガードぶきをもってパンチダッシュちゅうに\nぶきをなげるＤＪちゅうに\nぶきをなげるぼうをもってパンチUP２かいのあとパンチDO２かいたおれているキャラを\nかついでキックくうちゅうにいるときに\nDO＋パンチくうちゅうにいるときに\nDO＋パンチ＋キックかがんだときに\nUP２かいダッシュパンチか\nＤＪパンチをヒットさせるＤＪパンチヒットじに\n十キーのまえうまのりじにキックダッシュジャンプたおれているてきのあしのちかく\nてきがわをむいてキックダッシュちゅうかＤＪちゅうに\nぶきをなげるちゃくちじにパンチかキック\n十キーでほうこうしていランダムでひっさつわざが\nけっていされる
unk byte_4B4F88[] = { 131, 76, 131, 98, 131, 78, 130, 170, 130, 214, 130, 241, 130, 169, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 112, 131, 147, 131, 96, 130, 170, 130, 214, 130, 241, 130, 169, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 191, 130, 225, 130, 173, 130, 191, 130, 182, 130, 201, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 191, 130, 225, 130, 173, 130, 191, 130, 182, 130, 201, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 69, 131, 147, 130, 181, 130, 189, 130, 196, 130, 171, 130, 204, 130, 160, 130, 189, 130, 220, 130, 169, 130, 160, 130, 181, 130, 204, 92, 110, 130, 191, 130, 169, 130, 173, 130, 197, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 99, 130, 105, 131, 76, 131, 98, 131, 78, 131, 113, 131, 98, 131, 103, 130, 182, 130, 201, 92, 110, 68, 79, 130, 162, 130, 170, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 131, 87, 131, 131, 131, 147, 131, 118, 130, 182, 130, 201, 68, 79, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 130, 169, 130, 177, 130, 164, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 130, 169, 130, 177, 130, 164, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 75, 129, 91, 131, 104, 130, 170, 130, 214, 130, 241, 130, 169, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 130, 191, 130, 227, 130, 164, 130, 201, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 87, 131, 131, 131, 147, 131, 118, 130, 191, 130, 227, 130, 164, 130, 169, 130, 99, 130, 105, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 200, 130, 176, 130, 170, 130, 214, 130, 241, 130, 169, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 200, 130, 200, 130, 223, 131, 87, 131, 131, 131, 147, 131, 118, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 162, 130, 191, 130, 229, 130, 173, 131, 87, 131, 131, 131, 147, 131, 118, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 112, 131, 147, 131, 96, 130, 189, 130, 223, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 130, 169, 130, 99, 130, 105, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 130, 191, 130, 227, 130, 164, 130, 201, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 130, 191, 130, 227, 130, 164, 130, 201, 130, 220, 130, 166, 130, 81, 130, 169, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 177, 130, 164, 130, 176, 130, 171, 130, 240, 130, 183, 130, 241, 130, 186, 130, 241, 130, 197, 131, 75, 129, 91, 131, 104, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 212, 130, 171, 130, 240, 130, 224, 130, 193, 130, 196, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 130, 212, 130, 171, 130, 240, 130, 200, 130, 176, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 99, 130, 105, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 130, 212, 130, 171, 130, 240, 130, 200, 130, 176, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 218, 130, 164, 130, 240, 130, 224, 130, 193, 130, 196, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 85, 80, 130, 81, 130, 169, 130, 162, 130, 204, 130, 160, 130, 198, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 68, 79, 130, 81, 130, 169, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 189, 130, 168, 130, 234, 130, 196, 130, 162, 130, 233, 131, 76, 131, 131, 131, 137, 130, 240, 92, 110, 130, 169, 130, 194, 130, 162, 130, 197, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 173, 130, 164, 130, 191, 130, 227, 130, 164, 130, 201, 130, 162, 130, 233, 130, 198, 130, 171, 130, 201, 92, 110, 68, 79, 129, 123, 131, 112, 131, 147, 131, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 173, 130, 164, 130, 191, 130, 227, 130, 164, 130, 201, 130, 162, 130, 233, 130, 198, 130, 171, 130, 201, 92, 110, 68, 79, 129, 123, 131, 112, 131, 147, 131, 96, 129, 123, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 169, 130, 170, 130, 241, 130, 190, 130, 198, 130, 171, 130, 201, 92, 110, 85, 80, 130, 81, 130, 169, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 131, 112, 131, 147, 131, 96, 130, 169, 92, 110, 130, 99, 130, 105, 131, 112, 131, 147, 131, 96, 130, 240, 131, 113, 131, 98, 131, 103, 130, 179, 130, 185, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 99, 130, 105, 131, 112, 131, 147, 131, 96, 131, 113, 131, 98, 131, 103, 130, 182, 130, 201, 92, 110, 143, 92, 131, 76, 129, 91, 130, 204, 130, 220, 130, 166, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 164, 130, 220, 130, 204, 130, 232, 130, 182, 130, 201, 131, 76, 131, 98, 131, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 131, 87, 131, 131, 131, 147, 131, 118, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 189, 130, 168, 130, 234, 130, 196, 130, 162, 130, 233, 130, 196, 130, 171, 130, 204, 130, 160, 130, 181, 130, 204, 130, 191, 130, 169, 130, 173, 92, 110, 130, 196, 130, 171, 130, 170, 130, 237, 130, 240, 130, 222, 130, 162, 130, 196, 131, 76, 131, 98, 131, 78, 0, 0, 0, 131, 95, 131, 98, 131, 86, 131, 133, 130, 191, 130, 227, 130, 164, 130, 169, 130, 99, 130, 105, 130, 191, 130, 227, 130, 164, 130, 201, 92, 110, 130, 212, 130, 171, 130, 240, 130, 200, 130, 176, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 191, 130, 225, 130, 173, 130, 191, 130, 182, 130, 201, 131, 112, 131, 147, 131, 96, 130, 169, 131, 76, 131, 98, 131, 78, 92, 110, 143, 92, 131, 76, 129, 91, 130, 197, 130, 217, 130, 164, 130, 177, 130, 164, 130, 181, 130, 196, 130, 162, 0, 0, 0, 0, 0, 0, 0, 131, 137, 131, 147, 131, 95, 131, 128, 130, 197, 130, 208, 130, 193, 130, 179, 130, 194, 130, 237, 130, 180, 130, 170, 92, 110, 130, 175, 130, 193, 130, 196, 130, 162, 130, 179, 130, 234, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

//即使受到攻击，即使受到了\n也不会退缩的攻击\n也不会退缩的HP的原子弹\n由于攻击力上升的HP的原子弹\n防御力上升的速度，奖金躲避球的压力\n变得很好跳跃\n还有在弹簧上偶尔丢奖金时的\n伤害上升的项目的效果，即使有2个刚开始的暴风也能防御的炸弹，一定能用\n爆炸的保护按钮使之上升的力量\n上升
//こうげきをくらっても\nひるまなくなるこうげきをくらっても\nひるまなくなるＨＰのげんしょうで\nこうげきりょくがあがるＨＰのげんしょうで\nぼうぎょりょくがあがるすばやさにボーナスドッジボールのあつかいが\nうまくなるにだんジャンプ\nさらにばねにボーナスたまにぶきをなげたときの\nダメージがあがるアイテムのこうかが２ばいかたてぶきをもっていても\nガードできるばくだんがかならず\nばくはつするガードボタンでおきあがるのを\nおくらせられるみずのなかにいると\nのうりょくがあがる
unk byte_4B5800[] = { 130, 177, 130, 164, 130, 176, 130, 171, 130, 240, 130, 173, 130, 231, 130, 193, 130, 196, 130, 224, 92, 110, 130, 208, 130, 233, 130, 220, 130, 200, 130, 173, 130, 200, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 177, 130, 164, 130, 176, 130, 171, 130, 240, 130, 173, 130, 231, 130, 193, 130, 196, 130, 224, 92, 110, 130, 208, 130, 233, 130, 220, 130, 200, 130, 173, 130, 200, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 103, 130, 111, 130, 204, 130, 176, 130, 241, 130, 181, 130, 229, 130, 164, 130, 197, 92, 110, 130, 177, 130, 164, 130, 176, 130, 171, 130, 232, 130, 229, 130, 173, 130, 170, 130, 160, 130, 170, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 103, 130, 111, 130, 204, 130, 176, 130, 241, 130, 181, 130, 229, 130, 164, 130, 197, 92, 110, 130, 218, 130, 164, 130, 172, 130, 229, 130, 232, 130, 229, 130, 173, 130, 170, 130, 160, 130, 170, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 183, 130, 206, 130, 226, 130, 179, 130, 201, 131, 123, 129, 91, 131, 105, 131, 88, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 104, 131, 98, 131, 87, 131, 123, 129, 91, 131, 139, 130, 204, 130, 160, 130, 194, 130, 169, 130, 162, 130, 170, 92, 110, 130, 164, 130, 220, 130, 173, 130, 200, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 201, 130, 190, 130, 241, 131, 87, 131, 131, 131, 147, 131, 118, 92, 110, 130, 179, 130, 231, 130, 201, 130, 206, 130, 203, 130, 201, 131, 123, 129, 91, 131, 105, 131, 88, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 189, 130, 220, 130, 201, 130, 212, 130, 171, 130, 240, 130, 200, 130, 176, 130, 189, 130, 198, 130, 171, 130, 204, 92, 110, 131, 95, 131, 129, 129, 91, 131, 87, 130, 170, 130, 160, 130, 170, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 65, 131, 67, 131, 101, 131, 128, 130, 204, 130, 177, 130, 164, 130, 169, 130, 170, 130, 81, 130, 206, 130, 162, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 169, 130, 189, 130, 196, 130, 212, 130, 171, 130, 240, 130, 224, 130, 193, 130, 196, 130, 162, 130, 196, 130, 224, 92, 110, 131, 75, 129, 91, 131, 104, 130, 197, 130, 171, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 206, 130, 173, 130, 190, 130, 241, 130, 170, 130, 169, 130, 200, 130, 231, 130, 184, 92, 110, 130, 206, 130, 173, 130, 205, 130, 194, 130, 183, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 131, 75, 129, 91, 131, 104, 131, 123, 131, 94, 131, 147, 130, 197, 130, 168, 130, 171, 130, 160, 130, 170, 130, 233, 130, 204, 130, 240, 92, 110, 130, 168, 130, 173, 130, 231, 130, 185, 130, 231, 130, 234, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 130, 221, 130, 184, 130, 204, 130, 200, 130, 169, 130, 201, 130, 162, 130, 233, 130, 198, 92, 110, 130, 204, 130, 164, 130, 232, 130, 229, 130, 173, 130, 170, 130, 160, 130, 170, 130, 233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

//CHAR aGraphic02dppal_1[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_1 = 0x005f9484 "Graphic\\%02dpPalette.bin"

//CHAR aGraphicSpcharg[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 112, 67, 104, 97, 114, 71, 114, 97, 112, 104, 105, 99, 37, 48, 50, 100, 46, 116, 120, 116, 0, 0, 0 };//aGraphicSpcharg = 0x005f9594 "Graphic\\SpCharGraphic%02d.txt"//Graphic\SpCharGraphic%02d.txt

CHAR String1[] = { 35, 71, 82, 65, 80, 72, 73, 67, 83, 84, 65, 82, 84, 0, 0, 0 };//String1 = 0x005f96f4 "#GRAPHICSTART"//#GRAPHICSTART

CHAR aGraphicend[] = { 35, 71, 82, 65, 80, 72, 73, 67, 69, 78, 68, 0 };//aGraphicend = 0x005f95b4 "#GRAPHICEND"//#GRAPHICEND

//CHAR aGraphic02dppal_2[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_2 = 0x005f9704 "Graphic\\%02dpPalette.bin"
//char aSpecialmovelis[] = { 83, 112, 101, 99, 105, 97, 108, 77, 111, 118, 101, 76, 105, 115, 116, 46, 116, 120, 116, 0 };//aSpecialmovelis = 0x005f977c "SpecialMoveList.txt"//SpecialMoveList.txt

//unk byte_4B5B70[] = { 130, 160, 0, 0 };//啊

//word word_4B5B74 = 0x2041;

//char byte_4B5B76;

//word word_4B5B78 = 0x2042;

//char byte_4B5B7A;

//word word_4B5B7C = 0x4142;

//char byte_4B5B7E;

//word word_4B5B80 = 0x204f;

//char byte_4B5B82;

//char a2d2d_0[] = { 37, 50, 100, 47, 37, 50, 100, 13, 10, 0, 0, 0 };//a2d2d_0 = 0x005fabcc "%2d/%2d\r\n"//%2d/%2d\r\n

//unk byte_4B5B90[] = { 32, 32, 32, 37, 115, 140, 94, 58, 0, 0, 0, 0 };//%s类型：

//unk byte_4B5B9C[] = { 32, 130, 200, 130, 181, 44, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 0, 0, 0 };//无，

//unk byte_4B5BBC[] = { 32, 130, 200, 130, 181, 44, 0, 0 };//无，

//char aS_0[] = { 32, 37, 115, 44, 0, 0, 0, 0 };//aS_0 = 0x005fac0c " %s,"//%s,

//char asc_4B5BCC[] = { 32, 0, 0, 0 };//asc_4B5BCC = 0x005fac14 " "// 

//char asc_4B5BD0[] = { 13, 10, 0, 0 };//asc_4B5BD4 = 0x005fac1c "\r\n"//\r\n

//char asc_4B5BD4[] = { 13, 10, 0, 0 };//asc_4B5BD4 = 0x005fac1c "\r\n"//\r\n

//头部资源
//aGraphicHeadBmp_0 = 0x005fac20 "Graphic\\Head.bmp"//Graphic\Head.bmp
CHAR aGraphicHeadBmp_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 72, 101, 97, 100, 46, 98, 109, 112, 0, 0, 0, 0 };

//CHAR aGraphic02dppal_3[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_3 = 0x005fac34 "Graphic\\%02dpPalette.bin"
char aKdIni[] = { 75, 68, 46, 105, 110, 105, 0, 0 };//aKdIni = 0x005fac50 "KD.ini"//KD.ini


//CHAR aSS_0[] = { 37, 115, 92, 37, 115, 0, 0, 0 };//aSS_0 = 0x005fac58 "%s\\%s"//%s\%s

//CHAR aStageKoWav[] = { 115, 116, 97, 103, 101, 92, 107, 111, 46, 119, 97, 118, 0, 0, 0, 0 };//aStageKoWav = 0x005fac60 "stage\\ko.wav"//stage\ko.wav

CHAR aStart_6[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_6 = 0x005fac70 "#START"//#START

CHAR aEnd_2[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_2 = 0x005fac78 "#END"//#END

CHAR aStart_7[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_7 = 0x005fac80 "#START"//#START

CHAR aEnd_3[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_3 = 0x005fac88 "#END"//#END

//aDataCheergirld = 0x005fac90 "Data\\CheerGirlData.txt"//Data\CheerGirlData.txt
CHAR aDataCheergirld[] = { 68, 97, 116, 97, 92, 67, 104, 101, 101, 114, 71, 105, 114, 108, 68, 97, 116, 97, 46, 116, 120, 116, 0, 0 };

CHAR aStart_8[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_8 = 0x005faca8 "#START"//#START

CHAR aEnd_4[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_4 = 0x005facb0 "#END"//#END

CHAR aDef[] = { 35, 68, 69, 70, 0, 0, 0, 0 };//aDef = 0x005facb8 "#DEF"//#DEF

CHAR aDefend_0[] = { 35, 68, 69, 70, 69, 78, 68, 0 };//aDefend_0 = 0x005facc0 "#DEFEND"//#DEFEND

CHAR aDemoKkResult1T_0[] = { 68, 101, 109, 111, 92, 75, 75, 95, 82, 101, 115, 117, 108, 116, 49, 46, 116, 120, 116, 0 };//aDemoKkResult1T_0 = 0x005facc8 "Demo\\KK_Result1.txt"//Demo\KK_Result1.txt

char a1st_1[] = { 42, 49, 115, 116, 0, 0, 0, 0 };//a1st_1 = 0x005facdc "*1st"//*1st

char a2nd_1[] = { 42, 50, 110, 100, 0, 0, 0, 0 };//a2nd_1 = 0x005face4 "*2nd"//*2nd

char a3rd_1[] = { 42, 51, 114, 100, 0, 0, 0, 0 };//a3rd_1 = 0x005facec "*3rd"//*3rd

char aBiri_0[] = { 42, 66, 105, 114, 105, 0, 0, 0 };//aBiri_0 = 0x005facf4 "*Biri"//*Biri

CHAR aStart_9[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_9 = 0x005facfc "#START"//#START

CHAR aEnd_5[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_5 = 0x005fad04 "#END"//#END

CHAR aWpgraphic[] = { 87, 112, 71, 114, 97, 112, 104, 105, 99, 32, 32, 0 };//aWpgraphic = 0x005fad0c "WpGraphic  "//WpGraphic

//皮肤颜色脚本
//aGraphicSkincol = 0x005fad18 "Graphic\\SkinColor.txt"//Graphic\SkinColor.txt
CHAR aGraphicSkincol[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 107, 105, 110, 67, 111, 108, 111, 114, 46, 116, 120, 116, 0, 0, 0 };

CHAR aEnd_6[] = { 35, 69, 78, 68, 0, 0, 0, 0 };//aEnd_6 = 0x005fad30 "#END"//#END

CHAR aStart_10[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_10 = 0x005fad38 "#START"//#START

CHAR aStart_11[] = { 35, 83, 84, 65, 82, 84, 0, 0 };//aStart_11 = 0x005fad40 "#START"//#START

//CHAR aSDataWeapontpD[] = { 37, 115, 92, 68, 97, 116, 97, 92, 87, 101, 97, 112, 111, 110, 84, 80, 46, 100, 97, 116, 0, 0, 0, 0 };//aSDataWeapontpD = 0x005fad48 "%s\\Data\\WeaponTP.dat"//%s\Data\WeaponTP.dat

//CHAR aSDataWeaponcgD[] = { 37, 115, 92, 68, 97, 116, 97, 92, 87, 101, 97, 112, 111, 110, 67, 71, 46, 100, 97, 116, 0, 0, 0, 0 };//aSDataWeaponcgD = 0x005fad60 "%s\\Data\\WeaponCG.dat"//%s\Data\WeaponCG.dat

//CHAR aSDataTilepat02[] = { 37, 115, 92, 68, 97, 116, 97, 92, 84, 105, 108, 101, 80, 97, 116, 37, 48, 50, 100, 46, 100, 97, 116, 0 };//aSDataTilepat02 = 0x005fad78 "%s\\Data\\TilePat%02d.dat"//%s\Data\TilePat%02d.dat

//CHAR aSDataChargraph[] = { 37, 115, 92, 68, 97, 116, 97, 92, 67, 104, 97, 114, 71, 114, 97, 112, 104, 105, 99, 37, 48, 50, 100, 46, 100, 97, 116, 0 };//aSDataChargraph = 0x005fad90 "%s\\Data\\CharGraphic%02d.dat"//%s\Data\CharGraphic%02d.dat

//CHAR aSDataMisuzuTpD[] = { 37, 115, 92, 68, 97, 116, 97, 92, 109, 105, 115, 117, 122, 117, 95, 116, 112, 46, 100, 97, 116, 0, 0, 0 };//aSDataMisuzuTpD = 0x005fadac "%s\\Data\\misuzu_tp.dat"//%s\Data\misuzu_tp.dat

//CHAR aSDataMisuzuCgD[] = { 37, 115, 92, 68, 97, 116, 97, 92, 109, 105, 115, 117, 122, 117, 95, 99, 103, 46, 100, 97, 116, 0, 0, 0 };//aSDataMisuzuCgD = 0x005fadc4 "%s\\Data\\misuzu_cg.dat"//%s\Data\misuzu_cg.dat

//CHAR aSDataDoubleDra[] = { 37, 115, 92, 68, 97, 116, 97, 92, 68, 111, 117, 98, 108, 101, 95, 68, 114, 97, 103, 111, 110, 95, 84, 80, 46, 100, 97, 116, 0, 0, 0, 0 };//aSDataDoubleDra = 0x005faddc "%s\\Data\\Double_Dragon_TP.dat"//%s\Data\Double_Dragon_TP.dat

//CHAR aSDataDoubleDra_0[] = { 37, 115, 92, 68, 97, 116, 97, 92, 68, 111, 117, 98, 108, 101, 95, 68, 114, 97, 103, 111, 110, 95, 67, 71, 46, 100, 97, 116, 0, 0, 0, 0 };//aSDataDoubleDra_0 = 0x005fadfc "%s\\Data\\Double_Dragon_CG.dat"//%s\Data\Double_Dragon_CG.dat

//CHAR aGraphic02dppal_4[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_4 = 0x005fae1c "Graphic\\%02dpPalette.bin"
CHAR aGraphicCharsel[] = { 71, 114, 97, 112, 104, 105, 99, 92, 67, 104, 97, 114, 83, 101, 108, 66, 111, 100, 121, 46, 98, 109, 112, 0 };//aGraphicCharsel = 0x005fae38"Graphic\\CharSelBody.bmp"//Graphic\CharSelBody.bmp

CHAR aGraphicCharsel_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 67, 104, 97, 114, 83, 101, 108, 66, 111, 100, 121, 46, 98, 109, 112, 0 };//aGraphicCharsel_0 = 0x005fae50 "Graphic\\CharSelBody.bmp"//Graphic\CharSelBody.bmp


//CHAR aGraphic02dppal_5[] = {71, 114, 97, 112, 104, 105, 99, 92, 37, 48, 50, 100, 112, 80, 97, 108, 101, 116, 116, 101, 46, 98, 105, 110, 0, 0, 0, 0};//aGraphic02dppal_5 = 0x005fae68 "Graphic\\%02dpPalette.bin"
CHAR aGraphicFont00B[] = { 71, 114, 97, 112, 104, 105, 99, 92, 70, 111, 110, 116, 48, 48, 46, 98, 109, 112, 0, 0 };//aGraphicFont00B = 0x005fae84 "Graphic\\Font00.bmp"//Graphic\Font00.bmp

CHAR aError_13[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_13 = 0x005fae98 "Error"//Error

//字体模式创建失败。
//CHAR byte_4B5E58[] = { 131, 116, 131, 72, 131, 147, 131, 103, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
CHAR byte_4B5E58[] = "字体模式创建失败。";

CHAR aGraphicFont01B[] = { 71, 114, 97, 112, 104, 105, 99, 92, 70, 111, 110, 116, 48, 49, 46, 98, 109, 112, 0, 0 };//aGraphicFont01B = 0x005faec8 "Graphic\\Font01.bmp"//Graphic\Font01.bmp

CHAR aError_14[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_14 = 0x005faedc "Error"//Error

//字体模式创建失败。
//CHAR byte_4B5E9C[] = { 131, 116, 131, 72, 131, 147, 131, 103, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
CHAR byte_4B5E9C[] = "字体模式创建失败。";

CHAR aGraphicDamagef[] = { 71, 114, 97, 112, 104, 105, 99, 92, 68, 97, 109, 97, 103, 101, 70, 111, 110, 116, 46, 98, 109, 112, 0, 0 };//aGraphicDamagef = 0x005faf0c "Graphic\\DamageFont.bmp"//Graphic\DamageFont.bmp

CHAR aError_15[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_15 = 0x005faf24 "Error"//Error

//伤害用字体图案制作失败。
CHAR byte_4B5EE4[] = { 131, 95, 131, 129, 129, 91, 131, 87, 151, 112, 131, 116, 131, 72, 131, 147, 131, 103, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_2[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 52, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_2 = 0x005faf5c "Graphic\\System04.bmp"//Graphic\System04.bmp

CHAR aError_16[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_16 = 0x005faf74 "Error"//Error

CHAR byte_4B5F34[] = { 131, 129, 131, 106, 131, 133, 129, 91, 151, 112, 148, 119, 140, 105, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_3[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 52, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_3 = 0x005fafa8 "Graphic\\System04.bmp"//Graphic\System04.bmp

CHAR aError_17[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_17 = 0x005fafc0 "Error"//Error

//菜单用反转背景图案制作失败。
//CHAR byte_4B5F80[] = { 131, 129, 131, 106, 131, 133, 129, 91, 151, 112, 148, 189, 147, 93, 148, 119, 140, 105, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR byte_4B5F80[] = "菜单用反转背景图案制作失败。";

CHAR aGraphicSystem0_4[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 52, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_4 = 0x005faff8 "Graphic\\System04.bmp"//Graphic\System04.bmp

CHAR aError_18[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_18 = 0x005fb010 "Error"//Error

//菜单框架阵列创建失败。
CHAR byte_4B5FD0[] = { 131, 129, 131, 106, 131, 133, 129, 91, 151, 112, 131, 116, 131, 140, 129, 91, 131, 128, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicEffect0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 69, 102, 102, 101, 99, 116, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicEffect0 = 0x005fb048 "Graphic\\Effect01.bmp"//Graphic\Effect01.bmp

CHAR aError_19[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_19 = 0x005fb060 "Error"//Error

//效果图形导入失败。
CHAR byte_4B6020[] = { 131, 71, 131, 116, 131, 70, 131, 78, 131, 103, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 147, 199, 130, 221, 141, 158, 130, 221, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicEffect0_0[] = { 71, 114, 97, 112, 104, 105, 99, 92, 69, 102, 102, 101, 99, 116, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicEffect0_0 = 0x005fb098 "Graphic\\Effect01.bmp"//Graphic\Effect01.bmp

CHAR aError_20[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_20 = 0x005fb0b0 "Error"//Error
//效果图形导入失败。
CHAR byte_4B6070[] = { 131, 71, 131, 116, 131, 70, 131, 78, 131, 103, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 147, 199, 130, 221, 141, 158, 130, 221, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicEffect0_1[] = { 71, 114, 97, 112, 104, 105, 99, 92, 69, 102, 102, 101, 99, 116, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicEffect0_1 = 0x005fb0e8 "Graphic\\Effect01.bmp"//Graphic\Effect01.bmp

CHAR aError_21[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_21 = 0x005fb100 "Error"//Error
//效果图形导入失败。
CHAR byte_4B60C0[] = { 131, 71, 131, 116, 131, 70, 131, 78, 131, 103, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 147, 199, 130, 221, 141, 158, 130, 221, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicEffect0_2[] = { 71, 114, 97, 112, 104, 105, 99, 92, 69, 102, 102, 101, 99, 116, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicEffect0_2 = 0x005fb138 "Graphic\\Effect01.bmp"//Graphic\Effect01.bmp

CHAR aError_22[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_22 = 0x005fb150 "Error"//Error
//效果图形导入失败。
CHAR byte_4B6110[] = { 131, 71, 131, 116, 131, 70, 131, 78, 131, 103, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 147, 199, 130, 221, 141, 158, 130, 221, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicEffect0_3[] = { 71, 114, 97, 112, 104, 105, 99, 92, 69, 102, 102, 101, 99, 116, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicEffect0_3 = 0x005fb188 "Graphic\\Effect01.bmp"//Graphic\Effect01.bmp

CHAR aError_23[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_23 = 0x005fb1a0 "Error"//Error
//效果图形导入失败。
CHAR byte_4B6160[] = { 131, 71, 131, 116, 131, 70, 131, 78, 131, 103, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 147, 199, 130, 221, 141, 158, 130, 221, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_5[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 49, 95, 83, 46, 98, 109, 112, 0, 0 };//aGraphicSystem0_5 = 0x005fb1d8 "Graphic\\System01_S.bmp"//Graphic\System01_S.bmp

CHAR aGraphicSystem0_6[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 49, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_6 = 0x005fb1f0 "Graphic\\System01.bmp"//Graphic\System01.bmp

CHAR aError_24[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_24 = 0x005fb208 "Error"//Error
//窗口阵列创建失败。
CHAR byte_4B61C8[] = { 131, 69, 131, 67, 131, 147, 131, 104, 131, 69, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_7[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_7 = 0x005fb238 "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_25[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_25 = 0x005fb250 "Error"//Error
//生命条模式创建失败。
CHAR byte_4B6210[] = { 131, 137, 131, 67, 131, 116, 131, 111, 129, 91, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_8[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_8 = 0x005fb280 "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_26[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_26 = 0x005fb298 "Error"//Error

CHAR byte_4B6258[] = { 131, 88, 129, 91, 131, 112, 129, 91, 131, 82, 131, 147, 131, 123, 131, 81, 129, 91, 131, 87, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };

CHAR aGraphicSystem0_9[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_9 = 0x005fb2d4 "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_27[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_27 = 0x005fb2ec "Error"//Error
//超级组合规数字模式创建失败。
CHAR byte_4B62AC[] = { 131, 88, 129, 91, 131, 112, 129, 91, 131, 82, 131, 147, 131, 123, 131, 81, 129, 91, 131, 87, 144, 148, 142, 154, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };

CHAR aGraphicSystem0_10[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_10 = 0x005fb32c "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_28[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_28 = 0x005fb344 "Error"//Error
//在生活窗口上创建数字图形失败。
CHAR byte_4B6304[] = { 131, 137, 131, 67, 131, 116, 131, 69, 131, 67, 131, 147, 131, 104, 131, 69, 143, 227, 144, 148, 142, 154, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicSystem0_11[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_11 = 0x005fb384 "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_29[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_29 = 0x005fb39c "Error"//Error
//合体技能量规制作失败。
CHAR byte_4B635C[] = { 141, 135, 145, 204, 139, 90, 131, 81, 129, 91, 131, 87, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };

CHAR aGraphicSystem0_12[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 50, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_12 = 0x005fb3c8 "Graphic\\System02.bmp"//Graphic\System02.bmp

CHAR aError_30[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_30 = 0x005fb3e0 "Error"//Error
//合体技光标制作失败。
CHAR byte_4B63A0[] = { 141, 135, 145, 204, 139, 90, 131, 74, 129, 91, 131, 92, 131, 139, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

CHAR aGraphicShadowB[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 104, 97, 100, 111, 119, 46, 98, 109, 112, 0, 0 };//aGraphicShadowB = 0x005fb40c "Graphic\\Shadow.bmp"//Graphic\Shadow.bmp

CHAR aError_31[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//Error
//无法阵列阴影。
CHAR byte_4B63E0[] = { 137, 101, 130, 204, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };

CHAR aGraphicRectBmp[] = { 71, 114, 97, 112, 104, 105, 99, 92, 82, 101, 99, 116, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicRectBmp = 0x005fb44c "Graphic\\Rect.bmp"//Graphic\Rect.bmp

CHAR aError_32[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_32 = 0x005fb460 "Error"//Error
//判定框模式制作失败。
CHAR byte_4B6420[] = { 148, 187, 146, 232, 152, 103, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };

//CHAR aStageKickassWa[] = { 115, 116, 97, 103, 101, 92, 107, 105, 99, 107, 97, 115, 115, 46, 119, 97, 118, 0, 0, 0 };//aStageKickassWa = 0x005fb48c "stage\\kickass.wav"//stage\kickass.wav

CHAR aError_33[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_33 = 0x005fb4a0 "Error"//Error
//面部图形图案制作失败。
CHAR byte_4B6460[] = { 138, 231, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 129, 66, 0, 0 };

CHAR aGraphicSystem0_13[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 121, 115, 116, 101, 109, 48, 51, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicSystem0_13 = 0x005fb4cc "Graphic\\System03.bmp"//Graphic\System03.bmp

CHAR aError_34[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_34 = 0x005fb4e4 "Error"//Error
//无法创建陆地呼叫图形阵列
CHAR byte_4B64A4[] = { 131, 137, 131, 147, 131, 104, 131, 82, 129, 91, 131, 139, 151, 112, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };

CHAR aGraphicStagese_1[] = { 71, 114, 97, 112, 104, 105, 99, 92, 83, 116, 97, 103, 101, 83, 101, 108, 101, 99, 116, 46, 98, 109, 112, 0 };//aGraphicStagese_1 = 0x005fb524 "Graphic\\StageSelect.bmp"//Graphic\StageSelect.bmp

CHAR aError_35[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_35 = 0x005fb53c "Error"//Error

CHAR byte_4B64FC[] = { 131, 88, 131, 101, 129, 91, 131, 87, 131, 90, 131, 140, 131, 78, 131, 103, 151, 112, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };

CHAR aGraphicItemBmp[] = { 71, 114, 97, 112, 104, 105, 99, 92, 73, 116, 101, 109, 46, 98, 109, 112, 0, 0, 0, 0 };//aGraphicItemBmp = 0x005fb580 "Graphic\\Item.bmp"//Graphic\Item.bmp

CHAR aError_36[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_36 = 0x005fb594 "Error"//Error

CHAR byte_4B6554[] = { 131, 65, 131, 67, 131, 101, 131, 128, 151, 112, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };

CHAR aGraphicWeaponB[] = { 71, 114, 97, 112, 104, 105, 99, 92, 87, 101, 97, 112, 111, 110, 46, 98, 109, 112, 0, 0 };//aGraphicWeaponB = 0x005fb5d0 "Graphic\\Weapon.bmp"//Graphic\Weapon.bmp

CHAR aError_37[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_37 = 0x005fb5e4 "Error"//Error
//武器图形图案制作失败
CHAR byte_4B65A4[] = { 149, 144, 138, 237, 151, 112, 131, 79, 131, 137, 131, 116, 131, 66, 131, 98, 131, 78, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };

CHAR aSoundCursourWa[] = { 83, 111, 117, 110, 100, 92, 67, 117, 114, 115, 111, 117, 114, 46, 119, 97, 118, 0, 0, 0 };//aSoundCursourWa = 0x005fb61c "Sound\\Cursour.wav"//Sound\Cursour.wav

CHAR aSoundClickWav[] = { 83, 111, 117, 110, 100, 92, 67, 108, 105, 99, 107, 46, 119, 97, 118, 0 };//aSoundClickWav = 0x005fb630 "Sound\\Click.wav"//Sound\Click.wav

CHAR aSoundJumpWav[] = { 83, 111, 117, 110, 100, 92, 74, 117, 109, 112, 46, 119, 97, 118, 0, 0 };//aSoundJumpWav = 0x005fb640 "Sound\\Jump.wav"//Sound\Jump.wav

CHAR aSoundKaraburiW[] = { 83, 111, 117, 110, 100, 92, 75, 97, 114, 97, 98, 117, 114, 105, 46, 119, 97, 118, 0, 0 };//aSoundKaraburiW = 0x005fb650 "Sound\\Karaburi.wav"//Sound\Karaburi.wav

CHAR aSoundHit01Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 49, 46, 119, 97, 118, 0 };//aSoundHit01Wav = 0x005fb664 "Sound\\Hit01.wav"//Sound\Hit01.wav

CHAR aSoundHit02Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 50, 46, 119, 97, 118, 0 };//aSoundHit02Wav = 0x005fb674 "Sound\\Hit02.wav"//Sound\Hit02.wav

CHAR aSoundDown01Wav[] = { 83, 111, 117, 110, 100, 92, 68, 111, 119, 110, 48, 49, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundDown01Wav = 0x005fb684 "Sound\\Down01.wav"//Sound\Down01.wav

CHAR aSoundSlidingWa[] = { 83, 111, 117, 110, 100, 92, 83, 108, 105, 100, 105, 110, 103, 46, 119, 97, 118, 0, 0, 0 };//aSoundSlidingWa = 0x005fb698 "Sound\\Sliding.wav"//Sound\Sliding.wav

CHAR aSoundTsukamiWa[] = { 83, 111, 117, 110, 100, 92, 84, 115, 117, 107, 97, 109, 105, 46, 119, 97, 118, 0, 0, 0 };//aSoundTsukamiWa = 0x005fb6ac "Sound\\Tsukami.wav"//Sound\Tsukami.wav

CHAR aSoundHit03Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 51, 46, 119, 97, 118, 0 };//aSoundHit03Wav = 0x005fb6c0 "Sound\\Hit03.wav"//Sound\Hit03.wav

CHAR aSoundTsukitoba[] = { 83, 111, 117, 110, 100, 92, 84, 115, 117, 107, 105, 116, 111, 98, 97, 115, 105, 46, 119, 97, 118, 0, 0, 0 };//aSoundTsukitoba = 0x005fb6d0 "Sound\\Tsukitobasi.wav"//Sound\Tsukitobasi.wav

//窗口类名
CHAR aSoundGuard01Wa[] = { 83, 111, 117, 110, 100, 92, 71, 117, 97, 114, 100, 48, 49, 46, 119, 97, 118, 0, 0, 0 };//aSoundGuard01Wa = 0x005fb6e8 "Sound\\Guard01.wav"//Sound\Guard01.wav
CHAR aSoundDown03Wav[] = { 83, 111, 117, 110, 100, 92, 68, 111, 119, 110, 48, 51, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundDown03Wav = 0x005fb6fc "Sound\\Down03.wav"//Sound\Down03.wav
CHAR aSoundGoodbyWav[] = { 83, 111, 117, 110, 100, 92, 71, 111, 111, 100, 66, 121, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundGoodbyWav = 0x005fb710 "Sound\\GoodBy.wav"//Sound\GoodBy.wav
CHAR aSoundExplosion[] = { 83, 111, 117, 110, 100, 92, 69, 120, 112, 108, 111, 115, 105, 111, 110, 48, 49, 46, 119, 97, 118, 0, 0, 0 };//aSoundExplosion = 0x005fb724 "Sound\\Explosion01.wav"//Sound\Explosion01.wav
CHAR aSoundSpecial01[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 49, 46, 119, 97, 118, 0 };//aSoundSpecial01 = 0x005fb73c "Sound\\Special01.wav"//Sound\Special01.wav
CHAR aSoundSpecial02[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 50, 46, 119, 97, 118, 0 };//aSoundSpecial02 = 0x005fb750 "Sound\\Special02.wav"//Sound\Special02.wav
CHAR aSoundSpecial03[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 51, 46, 119, 97, 118, 0 };//aSoundSpecial03 = 0x005fb764 "Sound\\Special03.wav"//Sound\Special03.wav
CHAR aSoundSpecial04[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 52, 46, 119, 97, 118, 0 };//aSoundSpecial04 = 0x005fb778 "Sound\\Special04.wav"//Sound\Special04.wav
CHAR aSoundDown02Wav[] = { 83, 111, 117, 110, 100, 92, 68, 111, 119, 110, 48, 50, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundDown02Wav = 0x005fb78c "Sound\\Down02.wav"//Sound\Down02.wav
CHAR aSoundTaihouWav[] = { 83, 111, 117, 110, 100, 92, 84, 97, 105, 104, 111, 117, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundTaihouWav = 0x005fb7a0 "Sound\\Taihou.wav"//Sound\Taihou.wav
CHAR aSoundSpecial05[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 53, 46, 119, 97, 118, 0 };//aSoundSpecial05 = 0x005fb7b4 "Sound\\Special05.wav"//Sound\Special05.wav
CHAR aSoundSpecial06[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 54, 46, 119, 97, 118, 0 };//aSoundSpecial06 = 0x005fb7c8 "Sound\\Special06.wav"//Sound\Special06.wav
CHAR aSoundSpecial07[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 55, 46, 119, 97, 118, 0 };//aSoundSpecial07 = 0x005fb7dc "Sound\\Special07.wav"//Sound\Special07.wav
CHAR aSoundHit04Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 52, 46, 119, 97, 118, 0 };//aSoundHit04Wav = 0x005fb7f0 "Sound\\Hit04.wav"//Sound\Hit04.wav
CHAR aSoundSpecial08[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 56, 46, 119, 97, 118, 0 };//aSoundSpecial08 = 0x005fb800 "Sound\\Special08.wav"//Sound\Special08.wav
CHAR aSoundHit05Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 53, 46, 119, 97, 118, 0 };//aSoundHit05Wav = 0x005fb814 "Sound\\Hit05.wav"//Sound\Hit05.wav
CHAR aSoundSpecial09[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 48, 57, 46, 119, 97, 118, 0 };//aSoundSpecial09 = 0x005fb824 "Sound\\Special09.wav"//Sound\Special09.wav
CHAR aSoundSpecial10[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 48, 46, 119, 97, 118, 0 };//aSoundSpecial10 = 0x005fb838 "Sound\\Special10.wav"//Sound\Special10.wav
CHAR aSoundSpecial11[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 49, 46, 119, 97, 118, 0 };//aSoundSpecial11 = 0x005fb84c "Sound\\Special11.wav"//Sound\Special11.wav
CHAR aSoundWeaponget[] = { 83, 111, 117, 110, 100, 92, 87, 101, 97, 112, 111, 110, 71, 101, 116, 46, 119, 97, 118, 0 };//aSoundWeaponget = 0x005fb860 "Sound\\WeaponGet.wav"//Sound\WeaponGet.wav
CHAR aSoundBound01Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 49, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound01Wa = 0x005fb874 "Sound\\Bound01.wav"//Sound\Bound01.wav
CHAR aSoundBound02Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 50, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound02Wa = 0x005fb888 "Sound\\Bound02.wav"//Sound\Bound02.wav
CHAR aSoundBound03Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 51, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound03Wa = 0x005fb89c "Sound\\Bound03.wav"//Sound\Bound03.wav
CHAR aSoundBound04Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 52, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound04Wa = 0x005fb8b0 "Sound\\Bound04.wav"//Sound\Bound04.wav
CHAR aSoundKaraburi2[] = { 83, 111, 117, 110, 100, 92, 75, 97, 114, 97, 98, 117, 114, 105, 50, 46, 119, 97, 118, 0 };//aSoundKaraburi2 = 0x005fb8c4 "Sound\\Karaburi2.wav"//Sound\Karaburi2.wav
CHAR aSoundBound05Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 53, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound05Wa = 0x005fb8d8 "Sound\\Bound05.wav"//Sound\Bound05.wav
CHAR aSoundSpecial12[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 50, 46, 119, 97, 118, 0 };//aSoundSpecial12 = 0x005fb8ec "Sound\\Special12.wav"//Sound\Special12.wav
CHAR aSoundSpecial13[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 51, 46, 119, 97, 118, 0 };//aSoundSpecial13 = 0x005fb900 "Sound\\Special13.wav"//Sound\Special13.wav
CHAR aSoundSpecial14[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 52, 46, 119, 97, 118, 0 };//aSoundSpecial14 = 0x005fb914 "Sound\\Special14.wav"//Sound\Special14.wav
CHAR aSoundSpecial15[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 53, 46, 119, 97, 118, 0 };//aSoundSpecial15 = 0x005fb928 "Sound\\Special15.wav"//Sound\Special15.wav
CHAR aSoundSpecial16[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 54, 46, 119, 97, 118, 0 };//aSoundSpecial16 = 0x005fb93c "Sound\\Special16.wav"//Sound\Special16.wav
CHAR aSoundSpecial17[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 55, 46, 119, 97, 118, 0 };//aSoundSpecial17 = 0x005fb950 "Sound\\Special17.wav"//Sound\Special17.wav
CHAR aSoundSpecial18[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 56, 46, 119, 97, 118, 0 };//aSoundSpecial18 = 0x005fb964 "Sound\\Special18.wav"//Sound\Special18.wav
CHAR aSoundSpecial19[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 49, 57, 46, 119, 97, 118, 0 };//aSoundSpecial19 = 0x005fb978 "Sound\\Special19.wav"//Sound\Special19.wav
CHAR aSoundSpecial20[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 50, 48, 46, 119, 97, 118, 0 };//aSoundSpecial20 = 0x005fb98c "Sound\\Special20.wav"//Sound\Special20.wav
CHAR aSoundCommand01[] = { 83, 111, 117, 110, 100, 92, 67, 111, 109, 109, 97, 110, 100, 48, 49, 46, 119, 97, 118, 0 };//aSoundCommand01 = 0x005fb9a0 "Sound\\Command01.wav"//Sound\Command01.wav
CHAR aSoundSpecial21[] = { 83, 111, 117, 110, 100, 92, 83, 112, 101, 99, 105, 97, 108, 50, 49, 46, 119, 97, 118, 0 };//aSoundSpecial21 = 0x005fb9b4 "Sound\\Special21.wav"//Sound\Special21.wav
CHAR aSoundHit06Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 54, 46, 119, 97, 118, 0 };//aSoundHit06Wav = 0x005fb9c8 "Sound\\Hit06.wav"//Sound\Hit06.wav
CHAR aSoundHit07Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 55, 46, 119, 97, 118, 0 };//aSoundHit07Wav = 0x005fb9d8 "Sound\\Hit07.wav"//Sound\Hit07.wav
CHAR aSoundExplosion_0[] = { 83, 111, 117, 110, 100, 92, 69, 120, 112, 108, 111, 115, 105, 111, 110, 48, 50, 46, 119, 97, 118, 0, 0, 0 };//aSoundExplosion_0 = 0x005fb9e8 "Sound\\Explosion02.wav"//Sound\Explosion02.wav
CHAR aSoundDashWav[] = { 83, 111, 117, 110, 100, 92, 68, 97, 115, 104, 46, 119, 97, 118, 0, 0 };//aSoundDashWav = 0x005fba00 "Sound\\Dash.wav"//Sound\Dash.wav
CHAR aSoundBound06Wa[] = { 83, 111, 117, 110, 100, 92, 66, 111, 117, 110, 100, 48, 54, 46, 119, 97, 118, 0, 0, 0 };//aSoundBound06Wa = 0x005fba10 "Sound\\Bound06.wav"//Sound\Bound06.wav
CHAR aSoundThrow01Wa[] = { 83, 111, 117, 110, 100, 92, 84, 104, 114, 111, 119, 48, 49, 46, 119, 97, 118, 0, 0, 0 };//aSoundThrow01Wa = 0x005fba24 "Sound\\Throw01.wav"//Sound\Throw01.wav
CHAR aSoundLvupWav[] = { 83, 111, 117, 110, 100, 92, 76, 118, 85, 112, 33, 33, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundLvupWav = 0x005fba38 "Sound\\LvUp!!.wav"//Sound\LvUp!!.wav
CHAR aSoundCheerWav[] = { 83, 111, 117, 110, 100, 92, 67, 104, 101, 101, 114, 46, 119, 97, 118, 0 };//aSoundCheerWav = 0x005fba4c "Sound\\Cheer.wav"//Sound\Cheer.wav
CHAR aSoundHit08Wav[] = { 83, 111, 117, 110, 100, 92, 72, 105, 116, 48, 56, 46, 119, 97, 118, 0 };//aSoundHit08Wav = 0x005fba5c "Sound\\Hit08.wav"//Sound\Hit08.wav
CHAR aSoundSupercomb[] = { 83, 111, 117, 110, 100, 92, 83, 117, 112, 101, 114, 67, 111, 109, 98, 111, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundSupercomb = 0x005fba6c "Sound\\SuperCombo.wav"//Sound\SuperCombo.wav
CHAR aSoundSplashdow[] = { 83, 111, 117, 110, 100, 92, 83, 112, 108, 97, 115, 104, 68, 111, 119, 110, 46, 119, 97, 118, 0, 0, 0, 0 };//aSoundSplashdow = 0x005fba84 "Sound\\SplashDown.wav"//Sound\SplashDown.wav
CHAR aSoundTeleportW[] = { 83, 111, 117, 110, 100, 92, 84, 101, 108, 101, 112, 111, 114, 116, 46, 119, 97, 118, 0, 0 };//aSoundTeleportW = 0x005fba9c "Sound\\Teleport.wav"//Sound\Teleport.wav
CHAR pszFaceName[] = { 130, 108, 130, 114, 32, 130, 111, 131, 83, 131, 86, 131, 98, 131, 78, 32, 40, 147, 250, 150, 123, 140, 234, 41, 0, 0, 0, 0 };//pszFaceName = 0x005fbab0 "俵俽 俹僑僔僢僋 (擔杮岅)"//S P哥特式（日语）
//CHAR aD_13[] = { 37, 100, 0, 0 };//aD_13 = 0x005fbacc "%d"//%d
//CHAR aDD_0[] = { 37, 100, 44, 37, 100, 0, 0, 0 };//aDD_0 = 0x005fbad0 "%d,%d"//%d,%d
//char aKdIni_0[] = { 75, 68, 46, 105, 110, 105, 0, 0 };//aKdIni_0 = 0x005fbad8 "KD.ini"//KD.ini
//CHAR aSS_1[] = { 37, 115, 92, 37, 115, 0, 0, 0 };//aSS_1 = 0x005fbae0 "%s\\%s"//%s\%s
char aLegendOfBurnin[] = { 76, 101, 103, 101, 110, 100, 32, 111, 102, 32, 66, 117, 114, 110, 105, 110, 103, 32, 70, 105, 103, 104, 116, 101, 114, 115, 0, 0 };//aLegendOfBurnin = 0x005fbae8 "Legend of Burning Fighters"//Legend of Burning Fighters
//窗口标题
//char aLegendOfBurnin[] = {"窗口标题"};
CHAR WindowName[] = { 76, 101, 103, 101, 110, 100, 32, 111, 102, 32, 66, 117, 114, 110, 105, 110, 103, 32, 70, 105, 103, 104, 116, 101, 114, 115, 0, 0 };//WindowName = 0x005fbb04 "Legend of Burning Fighters"//Legend of Burning Fighters
CHAR ClassName[] = { 76, 101, 103, 101, 110, 100, 32, 111, 102, 32, 66, 117, 114, 110, 105, 110, 103, 32, 70, 105, 103, 104, 116, 101, 114, 115, 0, 0 };//ClassName = 0x005fbb20 "Legend of Burning Fighters"//Legend of Burning Fighters
CHAR aLegendOfBurnin_2[] = { 76, 101, 103, 101, 110, 100, 32, 111, 102, 32, 66, 117, 114, 110, 105, 110, 103, 32, 70, 105, 103, 104, 116, 101, 114, 115, 0, 0 };//aLegendOfBurnin_2 = 0x005fbb3c "Legend of Burning Fighters"//Legend of Burning Fighters
CHAR aLegendOfBurnin_3[] = { 76, 101, 103, 101, 110, 100, 32, 111, 102, 32, 66, 117, 114, 110, 105, 110, 103, 32, 70, 105, 103, 104, 116, 101, 114, 115, 0, 0 };//aLegendOfBurnin_3 = 0x005fbb58 "Legend of Burning Fighters"//Legend of Burning Fighters
CHAR aError_38[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_38 = 0x005fbb74 "Error"//Error
CHAR byte_4B6B34[] = { 131, 95, 131, 67, 131, 140, 131, 78, 131, 103, 131, 84, 131, 69, 131, 147, 131, 104, 130, 204, 143, 137, 138, 250, 137, 187, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };//直接声音初始化失败。
//CHAR aS_10[] = { 37, 115, 0, 0 };//aS_10 = 0x005fbba8 "%s"//%s
CHAR aS_11[] = { 37, 115, 0, 0 };//aS_11 = 0x005fbbac "%s"//%s
//CHAR aD_14[] = { 37, 100, 0, 0 };//aD_14 = 0x005fbbb0 "%d"//%d
CHAR asc_4B6B6C[] = { 62, 62, 0, 0 };//asc_4B6B6C = 0x005fbbb4 ">>"//>>
CHAR byte_4B6B70[] = { 129, 170, 0, 0 };//↑
CHAR byte_4B6B74[] = { 129, 171, 0, 0 };//↓
//CHAR byte_4B6B78[] = { 130, 189, 130, 162, 130, 185, 130, 241, 130, 169, 130, 162, 130, 183, 130, 164, 0, 0, 0, 0 };//对数
//unk byte_4B6B8C[] = { 131, 86, 131, 147, 131, 79, 131, 139, 0, 131, 94, 131, 98, 131, 79, 0, 0, 0, 0, 0 };//シングルタッグ
//CHAR byte_4B6BA0[] = { 130, 189, 130, 162, 130, 185, 130, 241, 130, 175, 130, 162, 130, 181, 130, 171, 0, 0, 0, 0 };//对角线形式
//CHAR byte_4B6BB4[] = { 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 130, 201, 130, 241, 130, 184, 130, 164, 0, 0 };//游戏者人数
//unk byte_4B6BC8[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ
//CHAR byte_4B6BD8[] = { 131, 65, 131, 67, 131, 101, 131, 128, 130, 204, 130, 181, 130, 230, 130, 164, 0, 0, 0, 0 };//项目说明
//CHAR byte_4B6BEC[] = { 130, 212, 130, 171, 130, 204, 130, 177, 130, 183, 130, 164, 0, 0, 0, 0 };//暴风雪
//unk byte_4B6BFC[] = { 130, 200, 130, 181, 0, 130, 160, 130, 232, 0, 0, 0 };//なしあり
//CHAR byte_4B6C08[] = { 130, 198, 130, 173, 130, 196, 130, 241, 130, 204, 130, 208, 130, 229, 130, 164, 130, 182, 0, 0 };//特征表示
//unk byte_4B6C1C[] = { 130, 200, 130, 181, 0, 130, 160, 130, 232, 0, 0, 0 };//なしあり
//CHAR byte_4B6C28[] = { 130, 191, 130, 175, 130, 162, 131, 95, 131, 129, 129, 91, 131, 87, 0, 0 };//地形伤害
//unk byte_4B6C38[] = { 130, 160, 130, 232, 0, 130, 200, 130, 181, 0, 130, 176, 130, 241, 130, 196, 130, 241, 0, 0 };//ありなしげんてん
//CHAR byte_4B6C4C[] = { 130, 187, 130, 173, 130, 181, 130, 191, 130, 175, 130, 162, 0, 0, 0, 0 };//测地仪
//CHAR byte_4B6C5C[] = { 131, 96, 129, 91, 131, 128, 131, 90, 131, 140, 131, 78, 131, 103, 130, 214, 0, 0, 0, 0 };//到团队选择
//unk byte_4B6C70[] = { 130, 200, 130, 181, 0, 130, 160, 130, 232, 0, 0, 0 };//なしあり
//CHAR byte_4B6C7C[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 0, 0, 0, 0 };//翻筋斗
//unk byte_4B6C8C[] = { 130, 160, 130, 189, 130, 231, 130, 200, 130, 162, 0, 130, 160, 130, 189, 130, 233, 0, 0, 0 };//あたらないあたる
//CHAR byte_4B6CA0[] = { 130, 221, 130, 169, 130, 189, 130, 199, 130, 164, 130, 181, 130, 204, 130, 177, 130, 164, 130, 176, 130, 171, 0, 0 };//表观相互的攻击
//CHAR byte_4B6CB8[] = { 131, 96, 129, 91, 131, 128, 130, 237, 130, 232, 130, 211, 130, 232, 0, 0 };//分队
CHAR aKdMapdata[] = { 75, 68, 95, 77, 65, 80, 68, 65, 84, 65, 0, 0 };//aKdMapdata = 0x005fbd10 "KD_MAPDATA"//KD_MAPDATA
//unk byte_4B6CD4[] = { 2, 0, 0, 0 };//
//CHAR aPosDSizeD[] = { 32, 112, 111, 115, 32, 37, 100, 32, 115, 105, 122, 101, 32, 37, 100, 32, 0, 0, 0, 0, 9 };//aPosDSizeD = 0x005fbd20 " pos %d size %d "//pos %d size %d
char byte_4B6CED[] = { 8, 7, 2, 1, 6, 3, 4, 5, 0, 0, 0 };//
CHAR aKdReplayFile[] = { 75, 68, 95, 82, 101, 112, 108, 97, 121, 95, 70, 105, 108, 101, 0, 0 };//aKdReplayFile = 0x005fbd44 "KD_Replay_File"//KD_Replay_File
CHAR aKdReplayFile_0[] = { 75, 68, 95, 82, 101, 112, 108, 97, 121, 95, 70, 105, 108, 101, 0, 0 };//aKdReplayFile_0 = 0x005fbd54 "KD_Replay_File"//KD_Replay_File
//CHAR byte_4B6D18[] = { 130, 201, 130, 241, 130, 184, 130, 164, 129, 64, 131, 118, 131, 140, 131, 67, 131, 132, 129, 91, 129, 64, 129, 64, 130, 98, 130, 111, 130, 116, 0, 0 };//用户CPU
//CHAR aD_15[] = { 37, 100, 0, 0 };//aD_15 = 0x005fbd84 "%d"//%d
//CHAR byte_4B6D3C[] = { 144, 108, 0, 0 };//个人
//CHAR aD_16[] = { 37, 100, 0, 0 };//aD_16 = 0x005fbd8c "%d"//%d
//CHAR byte_4B6D44[] = { 144, 108, 0, 0 };//个人
//CHAR aD_17[] = { 37, 100, 0, 0 };//aD_17 = 0x005fbd94 "%d"//%d
//CHAR byte_4B6D4C[] = { 144, 108, 0, 0 };//个人
CHAR asc_4B6D50[] = { 62, 62, 0, 0 };//asc_4B6D50 = 0x005fbd9c ">>"//>>
//CHAR byte_4B6D54[] = { 130, 200, 130, 241, 130, 162, 130, 199, 129, 64, 129, 64, 129, 64, 130, 171, 130, 235, 130, 173, 0, 0, 0, 0 };//耐蚀性记录
//CHAR byte_4B6D6C[] = { 130, 191, 130, 229, 130, 226, 130, 179, 0, 0, 0, 0 };//预烧
//CHAR byte_4B6D78[] = { 130, 226, 130, 179, 130, 181, 130, 162, 0, 0, 0, 0 };//温柔的
//CHAR byte_4B6D84[] = { 130, 211, 130, 194, 130, 164, 0, 0 };//普通
//CHAR byte_4B6D8C[] = { 130, 222, 130, 184, 130, 169, 130, 181, 130, 162, 0, 0 };//难，难
//CHAR byte_4B6D98[] = { 130, 191, 130, 229, 130, 222, 130, 184, 0, 0, 0, 0 };//直缝
//CHAR a3d_19[] = { 37, 51, 100, 0 };//a3d_19 = 0x005fbdf0 "%3d"//%3d
//CHAR byte_4B6DA8[] = { 144, 108, 0, 0 };//个人
//CHAR asc_4B6DAC[] = { 62, 62, 0, 0 };//asc_4B6DAC = 0x005fbdf8 ">>"//>>
CHAR aThis[] = { 42, 116, 104, 105, 115, 0, 0, 0 };//aThis = 0x005fbdfc "*this"//*this
//CHAR aS_12[] = { 37, 115, 32, 130, 198, 130, 162, 130, 164, 131, 137, 131, 120, 131, 139, 130, 205, 130, 160, 130, 232, 130, 220, 130, 185, 130, 241, 0 };//没有%s标签
//string
CHAR byte_4B6DD4[] = { 131, 137, 131, 120, 131, 139, 131, 71, 131, 137, 129, 91, 0, 0, 0, 0 };//标签错误
//CHAR aStage02dWav[] = { 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 119, 97, 118, 0, 0, 0 };//aStage02dWav = 0x005fbe30 "Stage%02d.wav"//Stage%02d.wav
//CHAR aStageStage02dB_1[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 98, 109, 112, 0 };//aStageStage02dB_1 = 0x005fbe40 "Stage\\Stage%02d.bmp"//Stage\Stage%02d.bmp
CHAR aError_39[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_39 = 0x005fbe54 "Error"//Error
//战斗用背景的模式制作失败。
CHAR byte_4B6E10[] = { 144, 237, 147, 172, 151, 112, 148, 119, 140, 105, 130, 204, 131, 112, 131, 94, 129, 91, 131, 147, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
//CHAR aStageStage02dD_0[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 100, 97, 116, 0 };//aStageStage02dD_0 = 0x005fbe88 "Stage\\Stage%02d.dat"//Stage\Stage%02d.dat
//CHAR aStageStage02dO[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 95, 79, 98, 106, 46, 116, 120, 116, 0 };//aStageStage02dO = 0x005fbe9c "Stage\\Stage%02d_Obj.txt"//Stage\Stage%02d_Obj.txt
CHAR aInit[] = { 35, 73, 78, 73, 84, 0, 0, 0 };//aInit = 0x005fbeb4 "#INIT"//#INIT
CHAR aInitend[] = { 35, 73, 78, 73, 84, 69, 78, 68, 0, 0, 0, 0 };//aInitend = 0x005fbebc "#INITEND"//#INITEND
CHAR aLoadbmp[] = { 76, 111, 97, 100, 66, 109, 112, 0 };//aLoadbmp = 0x005fbec8 "LoadBmp"//LoadBmp
CHAR aS_1[] = { 37, 115, 0, 0 };//aS_1 = 0x005fbed0 "%s"//%s
CHAR aEntrypat[] = { 69, 110, 116, 114, 121, 80, 97, 116, 0, 0, 0, 0 };//aEntrypat = 0x005fbed4 "EntryPat"//EntryPat
CHAR aN_0[] = { 110, 0, 0, 0 };//aN_0 = 0x005fbee0 "n"//n
CHAR aLoadchargraphi[] = { 76, 111, 97, 100, 67, 104, 97, 114, 71, 114, 97, 112, 104, 105, 99, 0 };//aLoadchargraphi = 0x005fbee4 "LoadCharGraphic"//LoadCharGraphic
CHAR aN_1[] = { 110, 0, 0, 0 };//aN_1 = 0x005fbef4 "n"//n
CHAR aLoadcgtp[] = { 76, 111, 97, 100, 67, 71, 84, 80, 0, 0, 0, 0 };//aLoadcgtp = 0x005fbef8 "LoadCGTP"//LoadCGTP
CHAR aN_2[] = { 110, 0, 0, 0 };//aN_2 = 0x005fbf04 "n"//n
CHAR aStartpos[] = { 83, 116, 97, 114, 116, 80, 111, 115, 0, 0, 0, 0 };//aStartpos = 0x005fbf08 "StartPos"//StartPos
CHAR aStartline[] = { 83, 116, 97, 114, 116, 76, 105, 110, 101, 0, 0, 0 };//aStartline = 0x005fbf14 "StartLine"//StartLine
CHAR aLoadbackbmp[] = { 76, 111, 97, 100, 66, 97, 99, 107, 66, 109, 112, 0 };//aLoadbackbmp = 0x005fbf20 "LoadBackBmp"//LoadBackBmp
CHAR aNextdemofilena[] = { 78, 101, 120, 116, 68, 101, 109, 111, 70, 105, 108, 101, 78, 97, 109, 101, 0, 0, 0, 0 };//aNextdemofilena = 0x005fbf2c "NextDemoFileName"//NextDemoFileName
CHAR aCopypalettes[] = { 67, 111, 112, 121, 80, 97, 108, 101, 116, 116, 101, 115, 0, 0, 0, 0 };//aCopypalettes = 0x005fbf40 "CopyPalettes"//CopyPalettes
CHAR aN_3[] = { 110, 0, 0, 0 };//aN_3 = 0x005fbf50 "n"//n
CHAR aBgmfilename[] = { 66, 103, 109, 70, 105, 108, 101, 78, 97, 109, 101, 0 };//aBgmfilename = 0x005fbf54 "BgmFileName"//BgmFileName
CHAR aString[] = { 35, 83, 84, 82, 73, 78, 71, 0 };//aString = 0x005fbf60 "#STRING"//#STRING
CHAR aStringend[] = { 35, 83, 84, 82, 73, 78, 71, 69, 78, 68, 0, 0 };//aStringend = 0x005fbf68 "#STRINGEND"//#STRINGEND
CHAR aString_0[] = { 35, 83, 84, 82, 73, 78, 71, 0 };//aString_0 = 0x005fbf74 "#STRING"//#STRING
CHAR aSound[] = { 35, 83, 79, 85, 78, 68, 0, 0 };//aSound = 0x005fbf7c "#SOUND"//#SOUND
CHAR aSoundend[] = { 35, 83, 79, 85, 78, 68, 69, 78, 68, 0, 0, 0 };//aSoundend = 0x005fbf84 "#SOUNDEND"//#SOUNDEND
CHAR aSound_0[] = { 35, 83, 79, 85, 78, 68, 0, 0 };//aSound_0 = 0x005fbf90 "#SOUND"//#SOUND
CHAR aMove[] = { 35, 77, 79, 86, 69, 0, 0, 0 };//aMove = 0x005fbf98 "#MOVE"//#MOVE
CHAR aMoveend[] = { 35, 77, 79, 86, 69, 69, 78, 68, 0, 0, 0, 0 };//aMoveend = 0x005fbfa0 "#MOVEEND"//#MOVEEND
CHAR aPut[] = { 35, 80, 85, 84, 0, 0, 0, 0 };//aPut = 0x005fbfac "#PUT"//#PUT
CHAR aPutend[] = { 35, 80, 85, 84, 69, 78, 68, 0 };//aPutend = 0x005fbfb4 "#PUTEND"//#PUTEND
CHAR aPut_0[] = { 35, 80, 85, 84, 0, 0, 0, 0 };//aPut_0 = 0x005fbfbc "#PUT"//#PUT
CHAR aPutend_0[] = { 35, 80, 85, 84, 69, 78, 68, 0 };//aPutend_0 = 0x005fbfc4 "#PUTEND"//#PUTEND
CHAR aEtcdata[] = { 35, 69, 84, 67, 68, 65, 84, 65, 0, 0, 0, 0 };//aEtcdata = 0x005fbfcc "#ETCDATA"//#ETCDATA
CHAR aEtcdataend[] = { 35, 69, 84, 67, 68, 65, 84, 65, 69, 78, 68, 0 };//aEtcdataend = 0x005fbfd8 "#ETCDATAEND"//#ETCDATAEND
//CHAR aStageStage02dD_1[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 46, 100, 97, 116, 0 };//aStageStage02dD_1 = 0x005fbfe4 "Stage\\Stage%02d.dat"//Stage\Stage%02d.dat
CHAR aMove_0[] = { 35, 77, 79, 86, 69, 0, 0, 0 };//aMove_0 = 0x005fbff8 "#MOVE"//#MOVE
CHAR aMoveend_0[] = { 35, 77, 79, 86, 69, 69, 78, 68, 0, 0, 0, 0 };//aMoveend_0 = 0x005fc000 "#MOVEEND"//#MOVEEND
CHAR aStage00Wav[] = { 83, 116, 97, 103, 101, 48, 48, 46, 119, 97, 118, 0 };//aStage00Wav = 0x005fc00c "Stage00.wav"//Stage00.wav
//CHAR aStageStage02dD_2[] = { 83, 116, 97, 103, 101, 92, 83, 116, 97, 103, 101, 37, 48, 50, 100, 95, 100, 97, 116, 97, 46, 116, 120, 116, 0, 0, 0, 0 };//aStageStage02dD_2 = 0x005fc018 "Stage\\Stage%02d_data.txt"//Stage\Stage%02d_data.txt
CHAR aHelp_0[] = { 35, 72, 69, 76, 80, 0, 0, 0 }; //aHelp_0 = 0x005fc034 "#HELP"//#HELP
CHAR aName[] = { 35, 78, 65, 77, 69, 0, 0, 0 };//aName = 0x005fc03c "#NAME"//#NAME
//unk byte_4B6FF8[] = { 130, 191, 130, 229, 130, 226, 130, 179, 0, 130, 226, 130, 179, 130, 181, 130, 162, 0, 130, 211, 130, 194, 130, 164, 0, 130, 222, 130, 184, 130, 169, 130, 181, 130, 162, 0, 130, 191, 130, 229, 130, 222, 130, 184, 0, 0, 0, 0 };//ちょやさやさしいふつうむずかしいちょむず
//CHAR byte_4B7028[] = { 130, 200, 130, 241, 130, 162, 130, 199, 0, 0, 0, 0 };//软土
//unk byte_4B7034[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ
//CHAR byte_4B7044[] = { 130, 221, 130, 169, 130, 189, 130, 199, 130, 164, 130, 181, 130, 204, 130, 160, 130, 189, 130, 232, 130, 205, 130, 241, 130, 196, 130, 162, 0, 0, 0, 0 };//视在同一方向上的估计
//unk byte_4B7064[] = { 131, 116, 131, 64, 131, 67, 131, 139, 0, 131, 137, 131, 147, 131, 95, 131, 128, 0, 0, 0 };//ファイルランダム
//CHAR byte_4B7078[] = { 130, 98, 130, 111, 130, 116, 131, 96, 129, 91, 131, 128, 130, 204, 130, 173, 130, 221, 130, 160, 130, 237, 130, 185, 0, 0, 0, 0 };//处理器组组合
//CHAR byte_4B7094[] = { 130, 212, 130, 171, 130, 204, 130, 169, 130, 184, 0, 0 };//木屑
//CHAR byte_4B70A0[] = { 130, 179, 130, 241, 130, 169, 130, 183, 130, 233, 131, 96, 129, 91, 131, 128, 130, 183, 130, 164, 0, 0, 0, 0 };//要氧化的组数
//CHAR byte_4B70B8[] = { 130, 162, 130, 191, 130, 199, 130, 201, 130, 189, 130, 189, 130, 169, 130, 164, 131, 96, 129, 91, 131, 128, 130, 183, 130, 164, 0, 0 };//一次战斗的队数
//unk byte_4B70D4[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0, 0 };//ＯＦＦＯＮ

//CHAR byte_4B70E4[] = { 130, 170, 130, 193, 130, 189, 130, 162, 130, 237, 130, 180, 130, 204, 130, 181, 130, 230, 130, 164, 0, 0, 0, 0 };//假象
//unk byte_4B70FC[] = { 130, 200, 130, 181, 0, 130, 160, 130, 232, 0, 0, 0 };//なしあり
//CHAR byte_4B7108[] = { 130, 191, 130, 175, 130, 162, 131, 95, 131, 129, 129, 91, 131, 87, 0, 0 };//地形伤害
//unk byte_4B7118[] = { 130, 160, 130, 232, 0, 130, 200, 130, 181, 0, 0, 0 };//ありなし
//CHAR byte_4B7124[] = { 130, 187, 130, 173, 130, 181, 130, 191, 130, 175, 130, 162, 0, 0, 0, 0 };//测地仪

//CHAR aD_18[] = { 37, 100, 0, 0 };//aD_18 = 0x005fc180 "%d"//%d
CHAR aVs[] = { 86, 83, 0, 0 };//aVs = 0x005fc184 "VS"//VS
//CHAR aDp_4[] = { 37, 100, 80, 0 };//aDp_4 = 0x005fc188 "%dP"//%dP
CHAR asc_4B7140[] = { 62, 62, 0, 0 };//asc_4B7140 = 0x005fc18c ">>"//>>
//CHAR byte_4B7144[] = { 130, 201, 130, 241, 130, 184, 130, 164, 130, 170, 129, 64, 130, 160, 130, 220, 130, 193, 130, 196, 130, 162, 130, 220, 130, 183, 129, 66, 0, 0, 0, 0 };//人太多了。
//CHAR byte_4B7164[] = { 131, 96, 129, 91, 131, 128, 130, 183, 130, 164, 0, 0 };//组数
//CHAR aD_19[] = { 37, 100, 0, 0 };//aD_19 = 0x005fc1bc "%d"//%d
//CHAR aD_20[] = { 37, 100, 0, 0 };//aD_20 = 0x005fc1c0 "%d"//%d
CHAR aVs_0[] = { 86, 83, 0, 0 };//aVs_0 = 0x005fc1c4 "VS"//VS
CHAR byte_4B717C[] = { 129, 171, 0, 0 };//↓
CHAR dword_4B7180[] = { 129, 171, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0 };//↓
char dword_4B719C[] = { 8, 0, 0, 0, 9, 0, 0, 0, 9, 0, 0, 0, 10, 0, 0, 0, 13, 0, 0, 0, 3, 0, 0, 0, 6, 0, 0, 0, 3, 0, 0, 0, 4, 0, 0, 0, 5, 0, 0, 0, 3, 0, 0, 0, 21, 0, 0, 0, 3, 0, 0, 0, 3, 0, 0, 0, 11, 0, 0, 0, 3, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 22, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0, 12, 0, 0, 0, 7, 0, 0, 0, 24, 0, 0, 0, 25, 0, 0, 0, 26, 0, 0, 0, 25, 0, 0, 0, 24, 0, 0, 0, 24, 0, 0, 0, 23, 0, 0, 0, 24, 0, 0, 0, 24, 0, 0, 0, 24, 0, 0, 0, 24, 0, 0, 0, 34, 0, 0, 0, 35, 0, 0, 0, 35, 0, 0, 0, 35, 0, 0, 0, 35, 0, 0, 0, 35, 0, 0, 0, 36, 0, 0, 0, 37, 0, 0, 0, 37, 0, 0, 0, 38, 0, 0, 0, 39, 0, 0, 0, 48, 0, 0, 0, 48, 0, 0, 0, 48, 0, 0, 0, 48, 0, 0, 0, 48, 0, 0, 0, 48, 0, 0, 0, 53, 0, 0, 0, 49, 0, 0, 0, 50, 0, 0, 0, 51, 0, 0, 0, 52, 0, 0, 0, 57, 0, 0, 0, 58, 0, 0, 0, 58, 0, 0, 0, 58, 0, 0, 0, 58, 0, 0, 0, 58, 0, 0, 0, 59, 0, 0, 0, 60, 0, 0, 0, 60, 0, 0, 0, 61, 0, 0, 0, 62, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 67, 0, 0, 0, 65, 0, 0, 0, 65, 0, 0, 0, 66, 0, 0, 0, 65, 0, 0, 0, 69, 0, 0, 0, 70, 0, 0, 0, 71, 0, 0, 0, 70, 0, 0, 0, 69, 0, 0, 0, 69, 0, 0, 0, 72, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 80, 0, 0, 0, 81, 0, 0, 0, 82, 0, 0, 0, 83, 0, 0, 0, 80, 0, 0, 0, 80, 0, 0, 0, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 96, 0, 0, 0, 97, 0, 0, 0, 98, 0, 0, 0, 97, 0, 0, 0, 96, 0, 0, 0, 96, 0, 0, 0, 99, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 123, 0, 0, 0, 111, 0, 0, 0, 111, 0, 0, 0, 117, 0, 0, 0, 111, 0, 0, 0, 173, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 157, 0, 0, 0, 180, 0, 0, 0, 181, 0, 0, 0, 182, 0, 0, 0, 181, 0, 0, 0, 181, 0, 0, 0, 181, 0, 0, 0, 183, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//char aType2dDhD[] = { 84, 89, 80, 69, 58, 37, 50, 100, 44, 68, 72, 58, 37, 100, 0, 0 };//aType2dDhD = 0x005fc438 "TYPE:%2d,DH:%d"//TYPE:%2d,DH:%d
//char aV5d5d5dG3d3d3d[] = { 86, 40, 37, 53, 100, 44, 37, 53, 100, 44, 37, 53, 100, 41, 32, 71, 40, 37, 51, 100, 44, 37, 51, 100, 44, 37, 51, 100, 41, 0, 0, 0 };//aV5d5d5dG3d3d3d = 0x005fc448 "V(%5d,%5d,%5d) G(%3d,%3d,%3d)"//V(%5d,%5d,%5d) G(%3d,%3d,%3d)
//char aParent2d[] = { 80, 65, 82, 69, 78, 84, 58, 37, 50, 100, 0, 0 };//aParent2d = 0x005fc468 "PARENT:%2d"//PARENT:%2d
CHAR aError_40[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_40 = 0x005fc474 "Error"//Error
CHAR aDdrawerror[] = { 68, 68, 114, 97, 119, 69, 114, 114, 111, 114, 0, 0 };//aDdrawerror = 0x005fc47c "DDrawError"//DDrawError
//无法制作DirectDraw object。
CHAR aDirectdrawObje[] = { 68, 105, 114, 101, 99, 116, 68, 114, 97, 119, 32, 111, 98, 106, 101, 99, 116, 32, 130, 170, 141, 236, 130, 234, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };
//DDrawError
CHAR aDdrawerror_0[] = { 68, 68, 114, 97, 119, 69, 114, 114, 111, 114, 0, 0 };
//QueryInterface失败。
CHAR aQueryinterface[] = { 81, 117, 101, 114, 121, 73, 110, 116, 101, 114, 102, 97, 99, 101, 32, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0 };
CHAR aDdrawerror_1[] = { 68, 68, 114, 97, 119, 69, 114, 114, 111, 114, 0, 0 };//aDdrawerror_1 = 0x005fc4dc "DDrawError"//DDrawError
CHAR byte_4B749C[] = { 139, 166, 146, 178, 131, 140, 131, 120, 131, 139, 130, 240, 144, 221, 146, 232, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aError03[] = { 69, 82, 82, 79, 82, 48, 51, 0 };//aError03 = 0x005fc50c "ERROR03"//ERROR03
//无法设置显示模式。
CHAR byte_4B74C8[] = { 149, 92, 142, 166, 131, 130, 129, 91, 131, 104, 130, 240, 144, 221, 146, 232, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aNot16bit[] = { 78, 111, 116, 49, 54, 98, 105, 116, 0, 0, 0, 0 };//aNot16bit = 0x005fc538 "Not16bit"//Not16bit
CHAR byte_4B74F8[] = { 199, 235, 189, 171, 215, 192, 195, 230, 201, 232, 214, 195, 206, 170, 49, 54, 206, 187, 201, 171, 163, 172, 215, 192, 195, 230, 45, 202, 244, 208, 212, 49, 54, 206, 187, 201, 171, 0, 0, 0 };
CHAR aError04[] = { 69, 82, 82, 79, 82, 48, 52, 0 };//aError04 = 0x005fc56c "ERROR04"//ERROR04
//无法创建主曲面。
CHAR byte_4B7528[] = { 131, 118, 131, 137, 131, 67, 131, 125, 131, 138, 129, 91, 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
CHAR aError05[] = { 69, 82, 82, 79, 82, 48, 53, 0 };//aError05 = 0x005fc5a8 "ERROR05"//ERROR05
//无法创建越屏屏幕。
CHAR byte_4B7564[] = { 131, 73, 131, 116, 131, 88, 131, 78, 131, 138, 129, 91, 131, 147, 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aError_41[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_41 = 0x005fc5e4 "Error"//Error
//无法创建系统内存的背面缓冲区。
CHAR byte_4B75A0[] = { 131, 86, 131, 88, 131, 101, 131, 128, 131, 129, 131, 130, 131, 138, 151, 112, 151, 160, 131, 111, 131, 98, 131, 116, 131, 64, 130, 240, 10, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0 };
CHAR byte_4B75D4[] = { 131, 71, 131, 137, 129, 91, 0, 0 };//错误
//ClientToScreen失败
CHAR aClienttoscreen[] = { 67, 108, 105, 101, 110, 116, 84, 111, 83, 99, 114, 101, 101, 110, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };
CHAR byte_4B75FC[] = { 131, 71, 131, 137, 129, 91, 0, 0 };//错误
CHAR aMPddssysscGetd[] = { 109, 95, 112, 68, 68, 83, 83, 121, 115, 83, 99, 45, 62, 71, 101, 116, 68, 67, 130, 201, 142, 184, 148, 115, 0, 0, 0, 0 };//aMPddssysscGetd = 0x005fc650 "m_pDDSSysSc->GetDC偵幐攕"//m_pDDSSysSc->GetDC失败
//char aError01[] = { 69, 82, 82, 79, 82, 48, 49, 0 };//aError01 = 0x005fc66c "ERROR01"//ERROR01
//unk byte_4B7628[] = { 131, 141, 131, 88, 130, 198, 0, 0 };//损耗和
//char aEntrypaterror[] = { 69, 110, 116, 114, 121, 80, 97, 116, 69, 114, 114, 111, 114, 0, 0, 0 };//aEntrypaterror = 0x005fc67c "EntryPatError"//EntryPatError
//unk byte_4B7640[] = { 149, 115, 144, 179, 130, 200, 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 214, 130, 204, 131, 124, 131, 67, 131, 147, 131, 94, 130, 197, 130, 183, 0, 0 };//指向错误曲面的指针
//unk byte_4B7664[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 201, 137, 230, 145, 156, 130, 240, 131, 82, 131, 115, 129, 91, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 37, 100, 0, 0 };//无法将图像复制到曲面。%d
//char aEntrypaterror_0[] = { 69, 110, 116, 114, 121, 80, 97, 116, 69, 114, 114, 111, 114, 0, 0, 0 };//aEntrypaterror_0 = 0x005fc6e0 "EntryPatError"//EntryPatError
CHAR aError_42[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_42 = 0x005fc6f0 "Error"//Error
//表面损失
CHAR byte_4B76AC[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 129, 69, 131, 141, 131, 88, 131, 103, 0, 0, 0, 0 };
//CHAR aError_43[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_43 = 0x005fc710 "Error"//Error
//CHAR byte_4B76CC[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 170, 141, 236, 130, 231, 130, 234, 130, 196, 130, 162, 130, 200, 130, 162, 130, 204, 130, 201, 10, 69, 110, 116, 114, 121, 66, 105, 116, 32, 130, 240, 142, 192, 141, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };//我运行了\nEntryBit，而没有创建曲面
//CHAR aError_44[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_44 = 0x005fc754 "Error"//Error
//CHAR byte_4B7710[] = { 131, 141, 131, 88, 130, 198, 0, 0 };//损耗和
//CHAR aError_45[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_45 = 0x005fc764 "Error"//Error
//CHAR byte_4B7720[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 131, 65, 131, 147, 129, 69, 131, 141, 131, 98, 131, 78, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法解锁曲面。
//CHAR aError_46[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_46 = 0x005fc79c "Error"//Error
//CHAR byte_4B7758[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 170, 141, 236, 130, 231, 130, 234, 130, 196, 130, 162, 130, 200, 130, 162, 130, 204, 130, 201, 10, 69, 110, 116, 114, 121, 66, 105, 116, 32, 130, 240, 142, 192, 141, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };//我运行了\nEntryBit，而没有创建曲面
//CHAR aError_47[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_47 = 0x005fc7e0 "Error"//Error
//CHAR byte_4B779C[] = { 130, 99, 130, 98, 130, 204, 142, 230, 147, 190, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };//无法获取直流。
//CHAR aError_48[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_48 = 0x005fc804 "Error"//Error
//CHAR byte_4B77C0[] = { 130, 99, 130, 104, 130, 97, 130, 204, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//DIB创建失败。
CHAR aError_49[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_49 = 0x005fc82c "Error"//Error
//指向非法直接行的指针
CHAR byte_4B77E8[] = { 149, 115, 144, 179, 130, 200, 131, 95, 131, 67, 131, 140, 131, 78, 131, 103, 131, 104, 131, 141, 131, 69, 130, 214, 130, 204, 131, 124, 131, 67, 131, 147, 131, 94, 130, 197, 130, 183, 0, 0 };
CHAR aError_50[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_50 = 0x005fc85c "Error"//Error
//我没能做新的曲面。
CHAR byte_4B7818[] = { 144, 86, 130, 181, 130, 162, 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 130, 233, 130, 177, 130, 198, 130, 170, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
//char aError06[] = { 69, 82, 82, 79, 82, 48, 54, 0 };//aError06 = 0x005fc898 "ERROR06"//ERROR06
//unk byte_4B7854[] = { 131, 112, 131, 140, 131, 98, 131, 103, 130, 240, 141, 236, 144, 172, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法创建调色板。
//char aError07[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07 = 0x005fc8c4 "ERROR07"//ERROR07
//unk byte_4B7880[] = { 130, 87, 131, 114, 131, 98, 131, 103, 131, 74, 131, 137, 129, 91, 130, 197, 130, 205, 130, 160, 130, 232, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0 };//不是8位颜色。
//char aError07_0[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_0 = 0x005fc8ec "ERROR07"//ERROR07
//unk byte_4B78A8[] = { 131, 112, 131, 140, 131, 98, 131, 103, 130, 170, 131, 65, 131, 94, 131, 98, 131, 96, 130, 179, 130, 234, 130, 196, 130, 162, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0 };//未附着调色板。
//char aError07_1[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_1 = 0x005fc918 "ERROR07"//ERROR07
//unk byte_4B78D4[] = { 131, 112, 131, 140, 131, 98, 131, 103, 130, 170, 131, 84, 131, 124, 129, 91, 131, 103, 130, 179, 130, 234, 130, 196, 130, 162, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0 };//不支持调色板。
//char aError07_2[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_2 = 0x005fc944 "ERROR07"//ERROR07
//unk byte_4B7900[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 170, 131, 141, 131, 88, 131, 103, 130, 181, 130, 196, 130, 162, 130, 220, 130, 183, 129, 66, 0, 0, 0, 0 };//曲面丢失了。
//char aError07_3[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_3 = 0x005fc970 "ERROR07"//ERROR07
//char aGeneric[] = { 71, 69, 78, 69, 82, 73, 67, 0 };//aGeneric = 0x005fc978 "GENERIC"//GENERIC
//char aError07_4[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_4 = 0x005fc980 "ERROR07"//ERROR07
//char aInvalidobject[] = { 73, 78, 86, 65, 76, 73, 68, 79, 66, 74, 69, 67, 84, 0, 0, 0 };//aInvalidobject = 0x005fc988 "INVALIDOBJECT"//INVALIDOBJECT
//char aError07_5[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_5 = 0x005fc998 "ERROR07"//ERROR07
//char aInvalidparams[] = { 73, 78, 86, 65, 76, 73, 68, 80, 65, 82, 65, 77, 83, 0, 0, 0 };//aInvalidparams = 0x005fc9a0 "INVALIDPARAMS"//INVALIDPARAMS
//char aError07_6[] = { 69, 82, 82, 79, 82, 48, 55, 0 };//aError07_6 = 0x005fc9b0 "ERROR07"//ERROR07
//char aInvalidpixelfo[] = { 73, 78, 86, 65, 76, 73, 68, 80, 73, 88, 69, 76, 70, 79, 82, 77, 65, 84, 0, 0 };//aInvalidpixelfo = 0x005fc9b8 "INVALIDPIXELFORMAT"//INVALIDPIXELFORMAT
CHAR aError_51[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_51 = 0x005fc9cc "Error"//Error
CHAR byte_4B7988[] = { 131, 129, 131, 130, 131, 138, 130, 170, 145, 171, 130, 232, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0, 0, 0 };//内存不足。
//CHAR aError_52[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_52 = 0x005fc9ec "Error"//Error
//CHAR byte_4B79A8[] = { 131, 129, 131, 130, 131, 138, 130, 170, 145, 171, 130, 232, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0, 0, 0 };//内存不足。
//CHAR aError_53[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_53 = 0x005fca0c "Error"//Error
//CHAR aImg[] = { 73, 77, 71, 32, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 131, 141, 129, 91, 131, 104, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0 };//无法加载IMG文件。
//CHAR aError_54[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_54 = 0x005fca3c "Error"//Error
//CHAR byte_4B79F8[] = { 131, 114, 131, 98, 131, 103, 131, 125, 131, 98, 131, 118, 130, 170, 138, 214, 152, 65, 149, 116, 130, 175, 130, 231, 130, 234, 130, 196, 130, 162, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0 };//未关联位图。
//CHAR aError_55[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_55 = 0x005fca6c "ERROR"//ERROR
//CHAR byte_4B7A28[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };//读取的数量太大了。
//CHAR aEntrypat_0[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_0 = 0x005fca90 "EntryPat 偺僄儔乕"//输入路径错误
//CHAR byte_4B7A58[] = { 142, 119, 146, 232, 130, 181, 130, 189, 131, 84, 131, 67, 131, 89, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 0, 0, 0, 0 };//指定的尺寸太大
CHAR aEntrypat_1[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_1 = 0x005fcac4 "EntryPat 偺僄儔乕"//输入路径错误
CHAR aI[] = { 105, 32, 130, 170, 32, 77, 65, 88, 95, 80, 65, 95, 78, 85, 77, 32, 130, 240, 146, 180, 130, 166, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };//aI = 0x005fcad8 "i 偑 MAX_PA_NUM 傪挻偊傑偟偨丅"//i超过MAX_PA_NUM。
//CHAR aEntrypat_2[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_2 = 0x005fcaf8 "EntryPat 偺僄儔乕"//输入路径错误
CHAR aBitmap[] = { 66, 105, 116, 77, 97, 112, 32, 143, 73, 146, 91, 130, 201, 151, 136, 130, 220, 130, 181, 130, 189, 129, 66, 0 };//aBitmap = 0x005fcb0c "BitMap 廔抂偵棃傑偟偨丅"//我来到了BitMap终端。
//CHAR aEntrypat_3[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_3 = 0x005fcb24 "EntryPat 偺僄儔乕"//输入路径错误
//CHAR byte_4B7AEC[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法创建曲面。
//CHAR aEntrypat_4[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_4 = 0x005fcb60 "EntryPat 偺僄儔乕"//输入路径错误
CHAR aCutbit[] = { 67, 117, 116, 66, 105, 116, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0 };//aCutbit = 0x005fcb74 "CutBit 偑僄儔乕傪曉偟傑偟偨丅"//CutBit返回错误。
//CHAR aEntrypat_5[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_5 = 0x005fcb94 "EntryPat 偺僄儔乕"//输入路径错误
CHAR aEntrybit[] = { 69, 110, 116, 114, 121, 66, 105, 116, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0 };//aEntrybit = 0x005fcba8 "EntryBit 偑僄儔乕傪曉偟傑偟偨丅"//EntryBit返回错误。
//CHAR aEntrypat_6[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_6 = 0x005fcbc8 "EntryPat 偺僄儔乕"//输入路径错误
//CHAR aEntrybit2[] = { 69, 110, 116, 114, 121, 66, 105, 116, 50, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//aEntrybit2 = 0x005fcbdc "EntryBit2 偑僄儔乕傪曉偟傑偟偨丅"//EntryBit2返回错误。
//char aError_56[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_56 = 0x005fcc00 "ERROR"//ERROR
//unk byte_4B7BBC[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };//读取的数量太大了。
//unk byte_4B7BD8[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//输入路径错误
//unk byte_4B7BEC[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法创建曲面。
//char aError_57[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_57 = 0x005fcc60 "ERROR"//ERROR
//unk byte_4B7C1C[] = { 80, 97, 116, 78, 117, 109, 32, 130, 170, 149, 115, 144, 179, 130, 197, 130, 183, 0, 0, 0 };//PatNum无效
//CHAR aError_58[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_58 = 0x005fcc7c "Error"//Error
//CHAR byte_4B7C38[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 170, 141, 236, 130, 231, 130, 234, 130, 196, 130, 162, 130, 220, 130, 185, 130, 241, 0, 0 };//没有制作曲面
//CHAR aError_59[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_59 = 0x005fcca4 "Error"//Error
//CHAR byte_4B7C60[] = { 131, 141, 131, 88, 130, 198, 0, 0 };//损耗和
//char aError_60[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_60 = 0x005fccb4 "ERROR"//ERROR
//unk byte_4B7C70[] = { 80, 97, 116, 78, 117, 109, 32, 130, 170, 149, 115, 144, 179, 130, 197, 130, 183, 0, 0, 0 };//PatNum无效
//CHAR aError_61[] = { 69, 114, 114, 111, 114, 0, 0, 0 };//aError_61 = 0x005fccd0 "Error"//Error
//CHAR byte_4B7C8C[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 131, 65, 131, 147, 129, 69, 131, 141, 131, 98, 131, 78, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法解锁曲面。
CHAR aLpddsNull[] = { 108, 112, 68, 68, 83, 32, 61, 32, 78, 85, 76, 76, 0, 0, 0, 0 };//aLpddsNull = 0x005fcd08 "lpDDS = NULL"//lpDDS = NULL
CHAR aMPddsbufNull[] = { 109, 95, 112, 68, 68, 83, 98, 117, 102, 32, 61, 32, 78, 85, 76, 76, 32, 0, 0, 0 };//aMPddsbufNull = 0x005fcd18 "m_pDDSbuf = NULL "//m_pDDSbuf = NULL
CHAR byte_4B7CE0[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 129, 69, 131, 141, 131, 88, 131, 103, 0, 0, 0, 0 };//萨费斯·罗斯特
//CHAR asc_4B7CF8[] = { 37, 88, 0, 0 };//asc_4B7CF8 = 0x005fcd44 "%X"//%X
//char aError_62[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_62 = 0x005fcd48 "ERROR"//ERROR
//unk byte_4B7D04[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };//读取的数量太大了。
CHAR aGetdcFailed[] = { 71, 101, 116, 68, 67, 32, 70, 97, 105, 108, 101, 100, 33, 0, 0, 0 };//aGetdcFailed = 0x005fcd6c "GetDC Failed!"//GetDC Failed!
CHAR aReleasedcFaile[] = { 82, 101, 108, 101, 97, 115, 101, 68, 67, 32, 70, 97, 105, 108, 101, 100, 33, 0, 0, 0 };//aReleasedcFaile = 0x005fcd7c "ReleaseDC Failed!"//ReleaseDC Failed!
//char aError_63[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_63 = 0x005fcd90 "ERROR"//ERROR
//unk byte_4B7D4C[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };//读取的数量太大了。
CHAR byte_4B7D68[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 170, 141, 236, 130, 231, 130, 234, 130, 196, 130, 162, 130, 200, 130, 162, 130, 204, 130, 201, 10, 69, 110, 116, 114, 121, 66, 105, 116, 32, 130, 240, 142, 192, 141, 115, 130, 181, 130, 220, 130, 181, 130, 189, 0, 0, 0, 0 };//我运行了\nEntryBit，而没有创建曲面
CHAR byte_4B7DA4[] = { 130, 99, 130, 98, 130, 204, 142, 230, 147, 190, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };//无法获取直流。
CHAR byte_4B7DC0[] = { 130, 99, 130, 104, 130, 97, 130, 204, 141, 236, 144, 172, 130, 201, 142, 184, 148, 115, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//DIB创建失败。
//未关联位图。
CHAR byte_4B7DE0[] = { 131, 114, 131, 98, 131, 103, 131, 125, 131, 98, 131, 118, 130, 170, 138, 214, 152, 65, 149, 116, 130, 175, 130, 231, 130, 234, 130, 196, 130, 162, 130, 220, 130, 185, 130, 241, 129, 66, 0, 0 };
CHAR aError_64[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_64 = 0x005fce54 "ERROR"//ERROR
//读取的数量太大了。
CHAR byte_4B7E10[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };
//aTypeDXDYDWDHDB = 0x005fce78 "type=%d, x=%d, y=%d, w=%d, h=%d, bw=%d, bh=%d"
//CHAR aTypeDXDYDWDHDB[] = { 116, 121, 112, 101, 61, 37, 100, 44, 32, 120, 61, 37, 100, 44, 32, 121, 61, 37, 100, 44, 32, 119, 61, 37, 100, 44, 32, 104, 61, 37, 100, 44, 32, 98, 119, 61, 37, 100, 44, 32, 98, 104, 61, 37, 100, 0, 0, 0 };//type=%d, x=%d, y=%d, w=%d, h=%d, bw=%d, bh=%d
CHAR aEntrypat_7[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_7 = 0x005fcea8 "EntryPat 偺僄儔乕"//输入路径错误
//指定的尺寸太大
CHAR byte_4B7E70[] = { 142, 119, 146, 232, 130, 181, 130, 189, 131, 84, 131, 67, 131, 89, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 0, 0, 0, 0 };
CHAR aEntrypat_8[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_8 = 0x005fcedc "EntryPat 偺僄儔乕"//输入路径错误
//i超过MAX_PA_NUM。
CHAR aI_0[] = { 105, 32, 130, 170, 32, 77, 65, 88, 95, 80, 65, 95, 78, 85, 77, 32, 130, 240, 146, 180, 130, 166, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0 };
CHAR aEntrypat_9[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_9 = 0x005fcf10 "EntryPat 偺僄儔乕"//输入路径错误
//我来到了BitMap终端。
CHAR aBitmap_0[] = { 66, 105, 116, 77, 97, 112, 32, 143, 73, 146, 91, 130, 201, 151, 136, 130, 220, 130, 181, 130, 189, 129, 66, 0 };
CHAR aEntrypat_10[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_10 = 0x005fcf3c "EntryPat 偺僄儔乕"//输入路径错误
//无法创建曲面。
CHAR byte_4B7F04[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
CHAR aEntrypat_11[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//aEntrypat_11 = 0x005fcf78 "EntryPat 偺僄儔乕"//输入路径错误
//CutBit返回错误。
CHAR aCutbit_0[] = { 67, 117, 116, 66, 105, 116, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0 };
//输入路径错误
CHAR aEntrypat_12[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };
//EntryBit3返回错误。
CHAR aEntrybit3[] = { 69, 110, 116, 114, 121, 66, 105, 116, 51, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };
//char aLpddsNull_0[] = { 108, 112, 68, 68, 83, 32, 61, 32, 78, 85, 76, 76, 0, 0, 0, 0 };//aLpddsNull_0 = 0x005fcfe4 "lpDDS = NULL"//lpDDS = NULL
//unk byte_4B7FA8[] = { 109, 95, 112, 68, 68, 83, 98, 117, 102, 32, 61, 32, 78, 85, 76, 76, 32, 149, 96, 137, 230, 130, 170, 130, 197, 130, 171, 130, 220, 130, 185, 130, 241, 129, 66, 0 };//m_pDDSbuf=无法绘制NULL。
//unk byte_4B7FCC[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 129, 69, 131, 141, 131, 88, 131, 103, 0, 0, 0, 0 };//萨费斯·罗斯特
//char aDderrInvalidre[] = { 68, 68, 69, 82, 82, 95, 73, 78, 86, 65, 76, 73, 68, 82, 69, 67, 84, 0, 0, 0 };//aDderrInvalidre = 0x005fd030 "DDERR_INVALIDRECT"//DDERR_INVALIDRECT
//char aDDDD[] = { 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 32, 45, 32, 40, 32, 37, 100, 32, 44, 32, 37, 100, 32, 41, 0, 0, 0, 0 };//aDDDD = 0x005fd044 "( %d, %d ) - ( %d , %d )"//( %d, %d ) - ( %d , %d )
//char asc_4B8014[] = { 37, 88, 0, 0 };//asc_4B8014 = 0x005fd060 "%X"//%X
//CHAR aLockerrorDDDD[] = {76, 111, 99, 107, 69, 114, 114, 111, 114, 32, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 45, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 0};//aLockerrorDDDD = 0x005fd064 "LockError ( %d, %d )-( %d, %d )"
CHAR aLockerror2[] = { 76, 111, 99, 107, 69, 114, 114, 111, 114, 33, 32, 50, 0, 0, 0, 0 };//aLockerror2 = 0x005fd084 "LockError! 2"//LockError! 2
//CHAR aLockerrorDDDD_0[] = {76, 111, 99, 107, 69, 114, 114, 111, 114, 32, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 45, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 0};//aLockerrorDDDD_0 = 0x005fd094 "LockError ( %d, %d )-( %d, %d )"
CHAR aLockerror2_0[] = { 76, 111, 99, 107, 69, 114, 114, 111, 114, 33, 32, 50, 0, 0, 0, 0 };//aLockerror2_0 = 0x005fd0b4 "LockError! 2"//LockError! 2
CHAR aFillrect[] = { 70, 105, 108, 108, 82, 101, 99, 116, 142, 184, 148, 115, 32, 114, 101, 99, 116, 40, 37, 100, 44, 32, 37, 100, 44, 32, 37, 100, 44, 32, 37, 100, 41, 0, 0, 0 };//aFillrect = 0x005fd0c4 "FillRect幐攕 rect(%d, %d, %d, %d)"//FillRect失败rect（%d，%d，%d，%d）
CHAR byte_4B809C[] = { 142, 184, 148, 115, 0, 0, 0, 0 };//失败
CHAR aMPddsbackNull[] = { 109, 95, 112, 68, 68, 83, 66, 97, 99, 107, 32, 61, 32, 78, 85, 76, 76, 0, 0, 0 };//aMPddsbackNull = 0x005fd0f0 "m_pDDSBack = NULL"//m_pDDSBack = NULL
//CHAR aLockerrorDDDD_1[] = {76, 111, 99, 107, 69, 114, 114, 111, 114, 32, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 45, 40, 32, 37, 100, 44, 32, 37, 100, 32, 41, 0};//aLockerrorDDDD_1 = 0x005fd104 "LockError ( %d, %d )-( %d, %d )"
//CHAR aLockerror2DDDD[] = { 76, 111, 99, 107, 69, 114, 114, 111, 114, 33, 32, 50, 32, 40, 37, 100, 44, 37, 100, 41, 45, 40, 37, 100, 44, 37, 100, 41, 0, 0, 0, 0 };//aLockerror2DDDD = 0x005fd124 "LockError! 2 (%d,%d)-(%d,%d)"//LockError! 2 (%d,%d)-(%d,%d)
//char aError_65[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_65 = 0x005fd144 "ERROR"//ERROR
//unk byte_4B8100[] = { 131, 67, 131, 129, 129, 91, 131, 87, 131, 116, 131, 64, 131, 67, 131, 139, 130, 240, 147, 199, 130, 221, 141, 158, 130, 223, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法读取图像文件。
//char aError_66[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_66 = 0x005fd178 "ERROR"//ERROR
//unk byte_4B8134[] = { 147, 199, 130, 221, 130, 177, 130, 222, 144, 148, 130, 170, 145, 229, 130, 171, 130, 183, 130, 172, 130, 220, 130, 183, 129, 66, 0, 0 };//读取的数量太大了。
//unk byte_4B8150[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//输入路径错误
//unk byte_4B8164[] = { 105, 32, 130, 170, 32, 77, 65, 88, 95, 80, 65, 84, 95, 78, 85, 77, 32, 130, 240, 146, 180, 130, 166, 130, 220, 130, 181, 130, 189, 129, 66, 0 };//i超过MAX_PAT_NUM。
//unk byte_4B8184[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//输入路径错误
//unk byte_4B8198[] = { 131, 84, 129, 91, 131, 116, 131, 70, 131, 67, 131, 88, 130, 240, 141, 236, 144, 172, 143, 111, 151, 136, 130, 220, 130, 185, 130, 241, 130, 197, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//无法创建曲面。
//char aIDEndDWDHD[] = { 105, 61, 37, 100, 44, 32, 101, 110, 100, 61, 37, 100, 44, 32, 87, 61, 37, 100, 44, 32, 72, 61, 37, 100, 0, 0, 0, 0 };//aIDEndDWDHD = 0x005fd20c "i=%d, end=%d, W=%d, H=%d"//i=%d, end=%d, W=%d, H=%d
//char aError_67[] = { 69, 82, 82, 79, 82, 0, 0, 0 };//aError_67 = 0x005fd228 "ERROR"//ERROR
//unk byte_4B81E4[] = { 69, 110, 116, 114, 121, 80, 97, 116, 32, 130, 204, 131, 71, 131, 137, 129, 91, 0, 0, 0 };//输入路径错误
//unk byte_4B81F8[] = { 69, 110, 116, 114, 121, 66, 105, 116, 51, 32, 130, 170, 131, 71, 131, 137, 129, 91, 130, 240, 149, 212, 130, 181, 130, 220, 130, 181, 130, 189, 129, 66, 0, 0, 0, 0 };//EntryBit3返回错误。
CHAR aImagefile[] = { 73, 77, 65, 71, 69, 70, 73, 76, 69, 0, 0, 0 };//aImagefile = 0x005fd268 "IMAGEFILE"//IMAGEFILE
//char aHandleIsNull[] = { 104, 97, 110, 100, 108, 101, 32, 105, 115, 32, 110, 117, 108, 108, 10, 0 };//aHandleIsNull = 0x005fd274 "handle is null\n"//handle is null\n
//char aDdcopybitmapFa[] = { 100, 100, 99, 111, 112, 121, 98, 105, 116, 109, 97, 112, 32, 102, 97, 105, 108, 101, 100, 10, 0, 0, 0, 0 };//aDdcopybitmapFa = 0x005fd284 "ddcopybitmap failed\n"//ddcopybitmap failed\n
//CHAR OutputString[] = { 99, 114, 101, 97, 116, 101, 99, 111, 109, 112, 97, 116, 105, 98, 108, 101, 32, 100, 99, 32, 102, 97, 105, 108, 101, 100, 10, 0 };//OutputString = 0x005fd29c "createcompatible dc failed\n"//createcompatible dc failed\n
//char aLockResourceFa[] = { 108, 111, 99, 107, 32, 114, 101, 115, 111, 117, 114, 99, 101, 32, 102, 97, 105, 108, 101, 100, 10, 0, 0, 0 };//aLockResourceFa = 0x005fd2b8 "lock resource failed\n"//lock resource failed\n
//不管
unk dword_4B8284[] = { 32, 5, 147, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//char dword_4B82A0[] = {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 117, 152, 0, 0, 115, 152, 0, 0};

//保存时间用的//不管，因为这个变量根本没有用到
int dword_4B82A0;

//char off_4B82B8[] = {181, 46, 74, 0, 204, 46, 74, 0, 204, 46, 74, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
//int off_4B82B8 = (int)_fpmath;
int off_4B82B8 = 0;//不管
//unk byte_4B82D0[] = { 115, 105, 110, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//sin
//unk byte_4B82E0[] = { 99, 111, 115, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//cos
//char aLog10[] = { 108, 111, 103, 49, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//aLog10 = 0x005fd30c "log10"//log10
off off_4B8300 = 0xa15a4a00;//不管
char dword_4B8304[] = { 2, 0, 0, 0, 21, 101, 74, 0, 0, 0, 0, 0, 204, 63, 74, 0 };//dword_4B8304 = 0x005fd320 "\x2"//eJ???J
//off off_4B8314 = 0xcc3f4a00;//不管
off off_4B8318 = 0xb47c4a00;//不管
off off_4B831C = 0xb47c4a00;//不管
off off_4B8320 = 0xb47c4a00;//不管
off off_4B8324 = 0xb47c4a00;//不管
off off_4B8328 = 0xb47c4a00;//不管
off off_4B832C = 0xb47c4a00;//不管
//char tbyte_4B8330[] = { 0, 0, 0, 0, 0, 0, 0, 192, 255, 255 };
char tbyte_4B833A[] = { 53, 194, 104, 33, 162, 218, 15, 201, 255, 63 };//不管
//char dbl_4B8344[] = { 0, 0, 0, 0, 0, 0, 240, 63, 1 };
//unk byte_4B834D[] = { 8, 4, 8, 8, 8, 4, 8, 8, 0, 4, 12, 8, 0, 4, 12, 8, 0, 0, 0 };//
//unk byte_4B8360[] = { 5, 97, 116, 97, 110, 50, 0, 0, 0, 0, 0, 0, 0, 2, 16, 0, 172, 73, 74, 0, 34, 74, 74, 0, 15, 71, 74, 0, 5, 74, 74, 0, 5, 74, 74, 0, 5, 74, 74, 0, 15, 71, 74, 0, 5, 74, 74, 0, 13, 71, 74, 0, 13, 71, 74, 0, 55, 71, 74, 0, 13, 71, 74, 0, 34, 74, 74, 0, 34, 74, 74, 0, 15, 71, 74, 0, 118, 71, 74, 0 };//atan2??IJ"JJGJJJJJJJGJJJ
//GJ
//GJ7GJ
//GJ"JJ"JJGJvGJ
//char tbyte_4B83B0[] = { 0, 0, 0, 0, 0, 0, 0, 128, 255, 127 };
//char tbyte_4B83BA[] = { 0, 0, 0, 0, 0, 0, 0, 128, 255, 255, 220, 167, 215, 185, 133, 102, 113, 177, 13, 64 };
//char tbyte_4B83CE[] = { 0, 0, 0, 0, 0, 0, 255, 255, 13, 64, 247, 54, 67, 12, 152, 25, 246, 149, 253, 63 };
//char dbl_4B83E2[] = { 0, 0, 0, 0, 0, 0, 224, 63, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 101, 120, 112, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 20, 0, 161, 76, 74, 0, 221, 70, 74, 0, 226, 70, 74, 0, 225, 77, 74, 0 };
// 不管
char off_4B8414[] = { 30, 132, 75, 0, 30, 132, 75, 0 };////不管//КК
char __ctype[] = { 0, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 40, 0, 40, 0, 40, 0, 40, 0, 40, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 32, 0, 72, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 132, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 129, 0, 129, 0, 129, 0, 129, 0, 129, 0, 129, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 16, 0, 130, 0, 130, 0, 130, 0, 130, 0, 130, 0, 130, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 16, 0, 16, 0, 16, 0, 16, 0, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
int cbMultiByte = 0x01000000;
char byte_4B8624[] = { 46, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 };//不管//.
char Str[] = { 204, 197, 74, 0 };//鲫鱼J
off off_4B8634 = 0xbcc54a00;
//dword dword_4B8638 = 0x050000c0;
//char dword_4B863C[] = { 11, 0, 0, 0, 0, 0, 0, 0, 29, 0, 0, 192, 4, 0, 0, 0, 0, 0, 0, 0, 150, 0, 0, 192, 4, 0, 0, 0, 0, 0, 0, 0, 141, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 142, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 143, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 144, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 145, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 146, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0, 147, 0, 0, 192, 8, 0, 0, 0, 0, 0, 0, 0 };
//dword dword_4B86B0 = 0x03000000;
//dword dword_4B86B4 = 0x07000000;
//dword dword_4B86B8 = 0x0a000000;
//dword dword_4B86BC = 0x8c000000;
unk byte_4B86C0[] = { 255, 255, 255, 255, 0, 10, 0, 0, 16, 0, 0, 0, 0, 0, 0, 0 };
dword dword_4B86D0[] = { 0x02000000 };//不管

//不管
char off_4B86D4[] = { 56, 200, 74, 0, 8, 0, 0, 0, 12, 200, 74, 0, 9, 0, 0, 0, 224, 199, 74, 0, 10, 0, 0, 0, 188, 199, 74, 0, 16, 0, 0, 0, 144, 199, 74, 0, 17, 0, 0, 0, 96, 199, 74, 0, 18, 0, 0, 0, 60, 199, 74, 0, 19, 0, 0, 0, 16, 199, 74, 0, 24, 0, 0, 0, 216, 198, 74, 0, 25, 0, 0, 0, 176, 198, 74, 0, 26, 0, 0, 0, 120, 198, 74, 0, 27, 0, 0, 0, 64, 198, 74, 0, 28, 0, 0, 0, 24, 198, 74, 0, 120, 0, 0, 0, 8, 198, 74, 0, 121, 0, 0, 0, 248, 197, 74, 0, 122, 0, 0, 0, 232, 197, 74, 0, 252, 0, 0, 0, 228, 197, 74, 0, 255, 0, 0, 0, 212, 197, 74, 0 };
char dword_4B8760[] = { 248, 3, 0, 0, 0, 0, 0, 0 };////不管
//unk byte_4B8768[] = { 0, 4, 0, 0, 1, 252, 255, 255, 53, 0, 0, 0, 11, 0, 0, 0, 64, 0, 0, 0, 255, 3, 0, 0 };
//unk byte_4B8780[] = { 128, 0, 0, 0, 129, 255, 255, 255, 24, 0, 0, 0, 8, 0, 0, 0, 32, 0, 0, 0, 127, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//char byte_4B87A0[] = { 0, 1, 0, 0, 4, 0, 0, 7, 0, 0, 10, 0, 0, 13, 0, 0 };
//flt flt_4B87B0 = 0x0000703f;
//flt flt_4B87B4 = 0x0000883f;
//flt flt_4B87B8 = 0x0000005f;
//char byte_4B87BC[] = { 0, 1, 0, 0, 4, 0, 0, 7, 0, 0, 10, 0, 0, 13, 0, 0, 0, 0, 0, 0, 0, 0, 238, 63 };
//char dbl_4B87D4[] = { 0, 0, 0, 0, 0, 0, 240, 67 };
//char dbl_4B87DC[] = { 0, 0, 0, 0, 0, 0, 240, 59, 0, 0, 0, 0, 0, 0, 240, 63 };
//char dbl_4B87EC[] = { 0, 0, 0, 0, 0, 0, 224, 63 };
//char tbyte_4B87F4[] = { 0, 0, 0, 0, 0, 0, 255, 255, 254, 127 };
//char jpt_4A804D[] = { 84, 128, 74, 0, 90, 128, 74, 0, 95, 128, 74, 0, 101, 128, 74, 0, 106, 128, 74, 0, 112, 128, 74, 0, 118, 128, 74, 0, 124, 128, 74, 0, 130, 128, 74, 0, 158, 128, 74, 0, 163, 128, 74, 0, 185, 128, 74, 0, 190, 128, 74, 0, 218, 128, 74, 0, 234, 128, 74, 0, 254, 128, 74, 0, 14, 129, 74, 0, 46, 129, 74, 0, 51, 129, 74, 0, 77, 129, 74, 0, 82, 129, 74, 0, 114, 129, 74, 0, 134, 129, 74, 0, 158, 129, 74, 0, 178, 129, 74, 0, 210, 129, 74, 0, 215, 129, 74, 0, 241, 129, 74, 0, 246, 129, 74, 0, 22, 130, 74, 0, 42, 130, 74, 0, 66, 130, 74, 0, 86, 130, 74, 0, 118, 130, 74, 0, 123, 130, 74, 0, 149, 130, 74, 0, 154, 130, 74, 0, 186, 130, 74, 0, 206, 130, 74, 0, 230, 130, 74, 0, 250, 130, 74, 0, 26, 131, 74, 0, 31, 131, 74, 0, 57, 131, 74, 0, 62, 131, 74, 0, 94, 131, 74, 0, 114, 131, 74, 0, 138, 131, 74, 0, 158, 131, 74, 0, 190, 131, 74, 0, 195, 131, 74, 0, 221, 131, 74, 0, 226, 131, 74, 0, 2, 132, 74, 0, 22, 132, 74, 0, 46, 132, 74, 0, 66, 132, 74, 0, 98, 132, 74, 0, 103, 132, 74, 0, 129, 132, 74, 0, 134, 132, 74, 0, 166, 132, 74, 0, 186, 132, 74, 0, 210, 132, 74, 0, 0, 0 };
//不管
char off_4B8900[] = { 160, 182, 76, 0, 0, 0, 0, 0, 160, 182, 76, 0, 1, 1, 0, 0 };
//不管
unk byte_4B8910[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 0, 0, 0, 0, 0, 0 };
unk byte_4B8920[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
unk byte_4B8940[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//不管
unk byte_4B8970[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B8B80[] = { 1, 2, 4, 8, 0, 0, 0, 0 };//不管//
unk byte_4B8B88[] = { 164, 3, 0, 0 };//不管//、
unk byte_4B8B8C[] = { 96, 130, 121, 130, 33, 0, 0, 0, 0, 0, 0, 0 };//不管
//不管
unk byte_4B8B98[] = { 166, 223, 0, 0, 0, 0, 0, 0, 161, 165, 0, 0, 0, 0, 0, 0, 129, 159, 224, 252, 0, 0, 0, 0, 64, 126, 128, 252, 0, 0, 0, 0, 168, 3, 0, 0, 193, 163, 218, 163, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 129, 254, 0, 0, 0, 0, 0, 0, 64, 254, 0, 0, 0, 0, 0, 0, 181, 3, 0, 0, 193, 163, 218, 163, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 129, 254, 0, 0, 0, 0, 0, 0, 65, 254, 0, 0, 0, 0, 0, 0, 182, 3, 0, 0, 207, 162, 228, 162, 26, 0, 229, 162, 232, 162, 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 129, 254, 0, 0, 0, 0, 0, 0, 64, 126, 161, 254, 0, 0, 0, 0, 81, 5, 0, 0, 81, 218, 94, 218, 32, 0, 95, 218, 106, 218, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 129, 211, 216, 222, 224, 249, 0, 0, 49, 126, 129, 254, 0, 0, 0, 0 };
//不管
unk byte_4B8C78[] = { 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 202, 74, 0, 29, 0, 0, 0, 252, 201, 74, 0, 26, 0, 0, 0, 248, 201, 74, 0, 27, 0, 0, 0, 240, 201, 74, 0, 31, 0, 0, 0, 232, 201, 74, 0, 19, 0, 0, 0, 224, 201, 74, 0, 33, 0, 0, 0, 216, 201, 74, 0, 14, 0, 0, 0, 208, 201, 74, 0, 13, 0, 0, 0, 200, 201, 74, 0, 15, 0, 0, 0, 192, 201, 74, 0, 16, 0, 0, 0, 184, 201, 74, 0, 5, 0, 0, 0, 176, 201, 74, 0, 30, 0, 0, 0, 172, 201, 74, 0, 18, 0, 0, 0, 168, 201, 74, 0, 32, 0, 0, 0, 164, 201, 74, 0, 12, 0, 0, 0, 156, 201, 74, 0, 11, 0, 0, 0, 148, 201, 74, 0, 21, 0, 0, 0, 140, 201, 74, 0, 28, 0, 0, 0, 132, 201, 74, 0, 25, 0, 0, 0, 124, 201, 74, 0, 17, 0, 0, 0, 116, 201, 74, 0, 24, 0, 0, 0, 108, 201, 74, 0, 22, 0, 0, 0, 100, 201, 74, 0, 23, 0, 0, 0, 92, 201, 74, 0, 34, 0, 0, 0, 88, 201, 74, 0, 35, 0, 0, 0, 84, 201, 74, 0, 36, 0, 0, 0, 80, 201, 74, 0 };
//dword dword_4B8D58 = 0x94260000;
//char tbyte_4B8D5C[] = { 0, 0, 0, 0, 0, 0, 0, 128, 16, 68, 0, 0 };
//char tbyte_4B8D68[] = { 1, 0, 0, 0, 0, 0, 0, 128, 0, 48, 0, 0, 0, 0, 0, 0 };
//char dbl_4B8D78[] = { 0, 0, 0, 0, 0, 0, 240, 127 };
//char dbl_4B8D80[] = { 0, 0, 0, 0, 0, 0, 248, 255 };
//char dbl_4B8D88[] = { 255, 255, 255, 255, 255, 255, 239, 127, 0, 0, 0, 0, 0, 0, 16, 0 };
//char dbl_4B8D98[] = { 0, 0, 0, 0, 0, 0, 0, 128 };
unk byte_4B8DA0[] = { 1, 0, 0, 0 };////不管
//不管
char dword_4B8DA4[] = { 22, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 3, 0, 0, 0, 2, 0, 0, 0, 4, 0, 0, 0, 24, 0, 0, 0, 5, 0, 0, 0, 13, 0, 0, 0, 6, 0, 0, 0, 9, 0, 0, 0, 7, 0, 0, 0, 12, 0, 0, 0, 8, 0, 0, 0, 12, 0, 0, 0, 9, 0, 0, 0, 12, 0, 0, 0, 10, 0, 0, 0, 7, 0, 0, 0, 11, 0, 0, 0, 8, 0, 0, 0, 12, 0, 0, 0, 22, 0, 0, 0, 13, 0, 0, 0, 22, 0, 0, 0, 15, 0, 0, 0, 2, 0, 0, 0, 16, 0, 0, 0, 13, 0, 0, 0, 17, 0, 0, 0, 18, 0, 0, 0, 18, 0, 0, 0, 2, 0, 0, 0, 33, 0, 0, 0, 13, 0, 0, 0, 53, 0, 0, 0, 2, 0, 0, 0, 65, 0, 0, 0, 13, 0, 0, 0, 67, 0, 0, 0, 2, 0, 0, 0, 80, 0, 0, 0, 17, 0, 0, 0, 82, 0, 0, 0, 13, 0, 0, 0, 83, 0, 0, 0, 13, 0, 0, 0, 87, 0, 0, 0, 22, 0, 0, 0, 89, 0, 0, 0, 11, 0, 0, 0, 108, 0, 0, 0, 13, 0, 0, 0, 109, 0, 0, 0, 32, 0, 0, 0, 112, 0, 0, 0, 28, 0, 0, 0, 114, 0, 0, 0, 9, 0, 0, 0, 6, 0, 0, 0, 22, 0, 0, 0, 128, 0, 0, 0, 10, 0, 0, 0, 129, 0, 0, 0, 10, 0, 0, 0, 130, 0, 0, 0, 9, 0, 0, 0, 131, 0, 0, 0, 22, 0, 0, 0, 132, 0, 0, 0, 13, 0, 0, 0, 145, 0, 0, 0, 41, 0, 0, 0, 158, 0, 0, 0, 13, 0, 0, 0, 161, 0, 0, 0, 2, 0, 0, 0, 164, 0, 0, 0, 11, 0, 0, 0, 167, 0, 0, 0, 13, 0, 0, 0, 183, 0, 0, 0, 17, 0, 0, 0, 206, 0, 0, 0, 2, 0, 0, 0, 215, 0, 0, 0, 11, 0, 0, 0, 24, 7, 0, 0, 12, 0, 0, 0 };
//不管
unk byte_4B8F08[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 160, 2, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 5, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 250, 8, 64, 0, 0, 0, 0, 0, 0, 0, 0, 64, 156, 12, 64, 0, 0, 0, 0, 0, 0, 0, 0, 80, 195, 15, 64, 0, 0, 0, 0, 0, 0, 0, 0, 36, 244, 18, 64, 0, 0, 0, 0, 0, 0, 0, 128, 150, 152, 22, 64, 0, 0, 0, 0, 0, 0, 0, 32, 188, 190, 25, 64, 0, 0, 0, 0, 0, 4, 191, 201, 27, 142, 52, 64, 0, 0, 0, 161, 237, 204, 206, 27, 194, 211, 78, 64, 32, 240, 158, 181, 112, 43, 168, 173, 197, 157, 105, 64, 208, 93, 253, 37, 229, 26, 142, 79, 25, 235, 131, 64, 113, 150, 215, 149, 67, 14, 5, 141, 41, 175, 158, 64, 249, 191, 160, 68, 237, 129, 18, 143, 129, 130, 185, 64, 191, 60, 213, 166, 207, 255, 73, 31, 120, 194, 211, 64, 111, 198, 224, 140, 233, 128, 201, 71, 186, 147, 168, 65, 188, 133, 107, 85, 39, 57, 141, 247, 112, 224, 124, 66, 188, 221, 142, 222, 249, 157, 251, 235, 126, 170, 81, 67, 161, 230, 118, 227, 204, 242, 41, 47, 132, 129, 38, 68, 40, 16, 23, 170, 248, 174, 16, 227, 197, 196, 250, 68, 235, 167, 212, 243, 247, 235, 225, 74, 122, 149, 207, 69, 101, 204, 199, 145, 14, 166, 174, 160, 25, 227, 163, 70, 13, 101, 23, 12, 117, 129, 134, 117, 118, 201, 72, 77, 88, 66, 228, 167, 147, 57, 59, 53, 184, 178, 237, 83, 77, 167, 229, 93, 61, 197, 93, 59, 139, 158, 146, 90, 255, 93, 166, 240, 161, 32, 192, 84, 165, 140, 55, 97, 209, 253, 139, 90, 139, 216, 37, 93, 137, 249, 219, 103, 170, 149, 248, 243, 39, 191, 162, 200, 93, 221, 128, 110, 76, 201, 155, 151, 32, 138, 2, 82, 96, 196, 37, 117, 0, 0, 0, 0 };
unk byte_4B9068[] = { 205, 204, 205, 204, 204, 204, 204, 204, 204, 204, 251, 63, 113, 61, 10, 215, 163, 112, 61, 10, 215, 163, 248, 63, 90, 100, 59, 223, 79, 141, 151, 110, 18, 131, 245, 63, 195, 211, 44, 101, 25, 226, 88, 23, 183, 209, 241, 63, 208, 15, 35, 132, 71, 27, 71, 172, 197, 167, 238, 63, 64, 166, 182, 105, 108, 175, 5, 189, 55, 134, 235, 63, 51, 61, 188, 66, 122, 229, 213, 148, 191, 214, 231, 63, 194, 253, 253, 206, 97, 132, 17, 119, 204, 171, 228, 63, 47, 76, 91, 225, 77, 196, 190, 148, 149, 230, 201, 63, 146, 196, 83, 59, 117, 68, 205, 20, 190, 154, 175, 63, 222, 103, 186, 148, 57, 69, 173, 30, 177, 207, 148, 63, 36, 35, 198, 226, 188, 186, 59, 49, 97, 139, 122, 63, 97, 85, 89, 193, 126, 177, 83, 124, 18, 187, 95, 63, 215, 238, 47, 141, 6, 190, 146, 133, 21, 251, 68, 63, 36, 63, 165, 233, 57, 165, 39, 234, 127, 168, 42, 63, 125, 172, 161, 228, 188, 100, 124, 70, 208, 221, 85, 62, 99, 123, 6, 204, 35, 84, 119, 131, 255, 145, 129, 61, 145, 250, 58, 25, 122, 99, 37, 67, 49, 192, 172, 60, 33, 137, 209, 56, 130, 71, 151, 184, 0, 253, 215, 59, 220, 136, 88, 8, 27, 177, 232, 227, 134, 166, 3, 59, 198, 132, 69, 66, 7, 182, 153, 117, 55, 219, 46, 58, 51, 113, 28, 210, 35, 219, 50, 238, 73, 144, 90, 57, 166, 135, 190, 192, 87, 218, 165, 130, 166, 162, 181, 50, 226, 104, 178, 17, 167, 82, 159, 68, 89, 183, 16, 44, 37, 73, 228, 45, 54, 52, 79, 83, 174, 206, 107, 37, 143, 89, 4, 164, 192, 222, 194, 125, 251, 232, 198, 30, 158, 231, 136, 90, 87, 145, 60, 191, 80, 131, 34, 24, 78, 75, 101, 98, 253, 131, 143, 175, 6, 148, 125, 17, 228, 45, 222, 159, 206, 210, 200, 4, 221, 166, 216, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

char byte_4B91D0; //byte_4B91D0是判断是否垂直同步等待
char byte_4B91D1;
dword dword_4B91D4 = 0x00000000;
char byte_4B91D8;
char byte_4B91D9;//判断调试模式
dword dword_4B91DC = 0x00000000;//Graphic\System02.bmp 资源数量
dword dword_4B91E0 = 0x00000000;
dword dword_4B91E4 = 0x00000000;
dword dword_4B91E8 = 0x00000000;
dword dword_4B91EC = 0x00000000;
dword dword_4B91F0 = 0x00000000;
dword dword_4B91F4 = 0x00000000;
dword dword_4B91F8 = 0x00000000;
dword dword_4B91FC = 0x00000000;
dword dword_4B9200 = 0x00000000;
dword dword_4B9204 = 0x00000000;
dword dword_4B9208 = 0x00000000;
dword dword_4B920C = 0x00000000;
dword dword_4B9210 = 0x00000000;
dword dword_4B9214 = 0x00000000;//Graphic\Shadow.bmp 资源数量
dword dword_4B9218 = 0x00000000;
dword dword_4B921C = 0x00000000;//可能是显示帧数DDSf对象的下标，这个对象专门用来显示字体字符相关的
char dword_4B9220[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
dword dword_4B9234 = 0x00000000;
int dword_4B9238;
dword dword_4B9240 = 0x00000000;
dword dword_4B9244 = 0x00000000;
dword dword_4B9248;
char word_4B9250[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char word_4B9290[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
dword dword_4B92D0 = 0x00000000;
dword dword_4B92D4 = 0x00000000;
dword dword_4B92D8 = 0x00000000;
void* dword_4B92DC = 0x00000000;
dword dword_4B92E0 = 0x00000000;
size_t Size = 0;
dword dword_4B92E8 = 0x00000000;//"%s\\Data\\WeaponCG.dat"存储该文件内数据的内存的指针
word word_4B92EC = 0;//"%s\\Data\\WeaponCG.dat"存储该文件内拥有的图形数据的数量
dword dword_4B92F0 = 0x00000000;
word word_4B92F4 = 0;
word word_4B92F8[2];
//unk byte_4B92FA;short
short byte_4B92FA;
dword dword_4B92FC[2];
//unk byte_4B9300;int
int byte_4B9300;
//unk byte_4B9304;short
int byte_4B9304;
//unk byte_4B9306;short
short byte_4B9306;
dword dword_4B9308[2];
//unk byte_4B930C;int
int byte_4B930C;
int dword_4B9310[2];//??????原来是指针的
char word_4B9318[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }; //CG.dat的小对象数组的地址
dword dword_4B9324[6];
char dword_4B9328[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
int dword_4B9348[6] = { 0 };
void* dword_4B9360 = 0x00000000;//头部资源文件的高度 / 8，也就是有多少行资源，有64行资源，64再乘以4的大小，256
void* dword_4B9364 = 0x00000000;////头部资源文件的高度 / 8，也就是有多少行资源，有64行资源，64再乘以4的大小，256
dword dword_4B9368 = 0x00000000;//存储，头部资源文件的高度/8，也就是有多少行资源，有64行资源
dword dword_4B936C = 0x00000000;
void* dword_4B9370;
dword dword_4B9370_1[3] = { 0,0,0 };

void* dword_4B9380 = 0;
void* dword_4B9380_1[4] = { 0 };


void* dword_4B9394 = 0x00000000;//txt有效行数乘以8的内存块大小，8 * dword_4B93A0,这个数据被写入new的地址后就不会改变了，会改变都是报错

dword dword_4B9398 = 0x00000000;

void* Src = 0;//txt有效行数乘以2的内存块大小，2 * dword_4B93A0

size_t dword_4B93A0 = 0x00000000;//存储txt配置项内容有效行的行数

streambuf* dword_4B93A4 = 0x00000000;//streambuf是某未解析的类，dword_4B93A4是这个类的指针，sub_485B30对象数组的指针，sub_485B30对象是处理一行txt内存的对象

dword dword_4B93A8 = 0x00000000;//是否绘制碰撞框
dword dword_4B93AC = 0x00000000;//"FRAME:%d"游戏经过多少逻辑帧
dword dword_4B93B0 = 0x00000000;
char byte_4B93B4[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

/*
*
* 原版char byte_4B93EC[] = { 0 };
char byte_4B93ED[] = { 0 };
char byte_4B93EE[] = { 0 };
char byte_4B93EF[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

*/

//合并了，解决了多个界面的ui同时显示的问题
char byte_4B93EC[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//+ 1 char byte_4B93ED[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//+ 2char byte_4B93EE[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//+ 3char byte_4B93EF[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };


//这是存储程序所在目录的，用于读取游戏配置和资源
//CHAR Buffer[] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
char Buffer[260] = { 0 };

char byte_4B9874[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
dword dword_4B9974 = 0x00000000;//是否播放录制
dword dword_4B9978 = 0x00000000;//是否开启录制
char byte_4B997C;
dword dword_4B9980 = 0x00000000;
char byte_4B9984;//
char byte_4B9985;//对局角色数量？？？

//人类玩家数量？
char byte_4B9986;

char byte_4B9987;
char byte_4B9988[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B9990;
char byte_4B9998;
char byte_4B9999;
char byte_4B999A;
char byte_4B999B[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B99A3[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char word_4B99AC[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B99C8;
char byte_4B99C9;
char byte_4B99CA;
char byte_4B99CB;
char byte_4B99CC;
char byte_4B99CD;
char word_4B99CE[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
char byte_4B99DF;
char byte_4B99E0;
word word_4B99E4 = 0x0000;


char byte_4B99E6; //byte_4B99E6配置是否可以后台运行

char byte_4B99E7;
char byte_4B99E8;


int byte_4B99E9;//是否全屏

//如果获取焦点的时候，且程序设置又是不允许后台运行，该值为1，失去焦点又不允许后台允许该值为0
dword dword_4B99EC = 0x00000000;

dword dword_4B99F0 = 0x00000000;//是否造成损坏，可能用于检测

//是否显示FPS
dword dword_4B99F4 = 0x00000000;

//dword_4B99F8是通过消息判断是否前或后台
dword dword_4B99F8 = 0x00000000; //窗口是否获取焦点

//61个资源文件
dword dword_4B99FC[1] = {};//61
dword dword_4B9A00 = 0x00000000;
dword dword_4B9A04 = 0x00000000;
dword dword_4B9A08 = 0x00000000;
dword dword_4B9A0C = 0x00000000;
dword dword_4B9A10 = 0x00000000;
dword dword_4B9A14 = 0x00000000;
dword dword_4B9A18 = 0x00000000;
dword dword_4B9A1C = 0x00000000;
dword dword_4B9A20 = 0x00000000;
dword dword_4B9A24 = 0x00000000;
dword dword_4B9A28 = 0x00000000;
dword dword_4B9A2C = 0x00000000;
dword dword_4B9A30 = 0x00000000;//FPS帧数
dword dword_4B9A34 = 0x00000000;
dword dword_4B9A38 = 0x00000000;
dword dword_4B9A3C = 0x00000000;
dword dword_4B9A40 = 0x00000000;
dword dword_4B9A44 = 0x00000000;
dword dword_4B9A48 = 0x00000000;
dword dword_4B9A4C = 0x00000000;
dword dword_4B9A50 = 0x00000000;
dword dword_4B9A54 = 0x00000000;
dword dword_4B9A58 = 0x00000000;
dword dword_4B9A5C = 0x00000000;
dword dword_4B9A60 = 0x00000000;
dword dword_4B9A64 = 0x00000000;
dword dword_4B9A68 = 0x00000000;
dword dword_4B9A6C = 0x00000000;
dword dword_4B9A70 = 0x00000000;
dword dword_4B9A74 = 0x00000000;
dword dword_4B9A78 = 0x00000000;
dword dword_4B9A7C = 0x00000000;
dword dword_4B9A80 = 0x00000000;
dword dword_4B9A84 = 0x00000000;
dword dword_4B9A88 = 0x00000000;
dword dword_4B9A8C = 0x00000000;
dword dword_4B9A90 = 0x00000000;
dword dword_4B9A94 = 0x00000000;
dword dword_4B9A98 = 0x00000000;
dword dword_4B9A9C = 0x00000000;
dword dword_4B9AA0 = 0x00000000;
dword dword_4B9AA4 = 0x00000000;
dword dword_4B9AA8 = 0x00000000;
dword dword_4B9AAC = 0x00000000;
dword dword_4B9AB0 = 0x00000000;
dword dword_4B9AB4 = 0x00000000;
dword dword_4B9AB8 = 0x00000000;
dword dword_4B9ABC = 0x00000000;
dword dword_4B9AC0 = 0x00000000;
dword dword_4B9AC4 = 0x00000000;
dword dword_4B9AC8 = 0x00000000;
dword dword_4B9ACC = 0x00000000;
dword dword_4B9AD0 = 0x00000000;
dword dword_4B9AD4 = 0x00000000;
dword dword_4B9AD8 = 0x00000000;
dword dword_4B9ADC = 0x00000000;
dword dword_4B9AE0 = 0x00000000;
dword dword_4B9AE4 = 0x00000000;
dword dword_4B9AE8 = 0x00000000;
char dword_4B9AEC[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
int dword_4B9AF8;
int dword_4B9B08;


//char byte_4BDB28[] = {255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255};
//在线程中被用到,这是一个LPDIRECTSOUND对象，处理声音的，估计是在线程中处理声音
char byte_4BDB28[312] = {};
//[0-3]
//[4-7]是一个大小为524的内存块地址


HGDIOBJ ho = 0;//字体
HWND hWnd = 0;//窗口句柄
dword dword_4CA1CC = 0;//当前帧数
dword dword_4CA1D0 = 0;//不管，不理解这个变量，因为全程被赋值为0，可能没有被用到。。。
dword dword_4CA1D4 = 0;
int dword_4CA1D8;
dword dword_4CA1E0 = 0;
dword dword_4CA1E4 = 0;
dword dword_4CA1E8 = 0;
dword dword_4CA1EC = 0;

int word_4CA1F0[3];//数组
//word word_4CA1F2 = 0xffff;
//word word_4CA1F4 = 0;

struct tagRECT rc;
char word_4CA208[] = { 255, 255, 255, 255, 255, 255, 255, 255 };
char byte_4CA210[] = { 255 };
char byte_4CA211;
char byte_4CA212;

//数组
int byte_4CA214[3];
char byte_4CA218[] = { 255 };
//char byte_4CA219[] = {255};

char byte_4CA21A;
char byte_4CA21C[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
word word_4CB21C = 0;
//dword dword_4CB220 = 0;
//dword dword_4CB224 = 0;
dword dword_4CB228 = 0;//不管
char* Block;
dword dword_4CB234 = 0;//不管
void* lp = 0;
//dword dword_4CB23C = 0;
//dword dword_4CB240 = 0;
dword dword_4CB244 = 0;
dword dword_4CB248 = 0;//不管
char byte_4CB24C;//不管
dword dword_4CB250 = 0;//不管
//char byte_4CB254[] = {255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255};
char byte_4CB254;
//dbl dbl_4CB260;
//char byte_4CB268;
dword dword_4CB26C = 0;//不管
int dword_4CB270;//不管

//不管
//main函数内获取存储系统信息的变量
dword dword_4CB278 = 0;//系统版本信息
dword dword_4CB27C = 0;//系统版本信息
dword dword_4CB280 = 0;//系统版本信息
dword dword_4CB284 = 0;//系统版本信息

//_setargv()函数，记录控制台程序参数相关信息的变量
dword dword_4CB288 = 0;//不管
int dword_4CB28C;//不管


//char dword_4CB294[] = {255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255};
int dword_4CB294;
//char dword_4CB2A4[] = {255, 255, 255, 255, 255, 255, 255, 255};
int dword_4CB2A4;//不管
char byte_4CB2AC;//不管
dword dword_4CB2B0 = 0;
dword dword_4CB2B4 = 0;
//dword dword_4CB2B8 = 0;
CHAR Filename[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
dword dword_4CB3C0 = 0;//不管
dword dword_4CB3C4 = 0;
LPTOP_LEVEL_EXCEPTION_FILTER lpfn = 0;
//int dword_4CB3CC = 0;
//char dword_4CB3D0[] = { 255, 255, 255, 255, 255, 255, 255, 255 };
word word_4CB3D8 = 0xffff;//不管
char byte_4CB3DA;//不管
//不管
unk byte_4CB3DC[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
dword dword_4CB3F8 = 0;//不管
dword dword_4CB3FC = 0;//不管
dword dword_4CB400 = 0;//不管
dword dword_4CB404 = 0;//不管
dword dword_4CB408 = 0;//不管
dword dword_4CB40C = 0;//不管
dword dword_4CB410 = 0;//不管
//dword dword_4CB414 = 0;
//dword dword_4CB418 = 0;
//dword dword_4CB41C = 0;
//dword dword_4CB420 = 0;
//dword dword_4CB424 = 0;
//dword dword_4CB428 = 0;
//dword dword_4CB42C;
dword dword_4CB434;//不管
dword dword_4CB440;//不管
UINT CodePage;//不管
dword dword_4CB458;//不管
//unk byte_4CB460[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
//char dword_4CB46C_ex[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
dword dword_4CB46C;//不管
char byte_4CB480[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
unk byte_4CB580[] = { 255 };//不管
//不管
char byte_4CB581[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
LCID Locale = 0;//不管
//char dword_4CB688[] = {255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255};
int dword_4CB688;//不管
//unk byte_4CB6A0[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
size_t Count = 0;
dword dword_4CC6A4 = 0;//__sbh_heap_init//不管
dword dword_4CC6A8 = 0;
dword dword_4CC6AC = 0;//__sbh_heap_init//不管
int dword_4CC6B0 = 0;//__sbh_heap_init//不管
dword dword_4CC6B4 = 0;//__sbh_heap_init//不管
LPVOID lpMem = 0;
HANDLE hHeap = 0;
dword dword_4CC6C0[] = { 0xffffffff };//不管

//不管
unk byte_4CC6C4[] = { 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255 };
UINT uNumber = 0;
dword dword_4CC7C4 = 0;//不管
dword dword_4CC7C8 = 0;//不管
dword dword_4CC7CC = 0;//不管
int dword_4CC7D0 = 0;//不管

////不管
dword dword_4CC7D4 = 0;//返回GetCommandLineA();是程序参数字符串的指针








//-----------

CHAR dword_4ABAEC[] = { 129, 64, 200, 203, 202, 253, 129, 64, 129, 64, 129, 64, 129, 64, 205, 230, 188, 210, 46, 46, 129, 64, 129, 64, 130, 98, 130, 111, 130, 116, 0, 0 }; //dword_4ABAEC = 0x005fcd2c "丂人数丂丂丂丂玩家..丂丂俠俹倀",人数玩家

int dword_4ABB0C[1] = { 25637 };

int dword_4ABB10;
//Ｓｅｌｅｃｔ　ｐａｒｔｉｃｉｐａｎｔｓ//选择参与者
CHAR dword_4ABB14[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 144, 130, 129, 130, 146, 130, 148, 130, 137, 130, 131, 130, 137, 130, 144, 130, 129, 130, 142, 130, 148, 130, 147, 0, 0 };//Ｓｅｌｅｃｔ　ｐａｒｔｉｃｉｐａｎｔｓ//选择参与者

//选择人物..............队伍设置..............设置............																																																					//
CHAR byte_4ABB3C[] = { 0, 0, 209, 161, 212, 241, 200, 203, 206, 239, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 182, 211, 206, 233, 201, 232, 214, 195, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 201, 232, 214, 195, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//Ａｆｔｅｒ　ｃｏｎｆｉｇｕｒａｔｉｏｎ、配置后
CHAR word_4ABB7E[] = { 130, 96, 130, 134, 130, 148, 130, 133, 130, 146, 129, 64, 130, 131, 130, 143, 130, 142, 130, 134, 130, 137, 130, 135, 130, 149, 130, 146, 130, 129, 130, 148, 130, 137, 130, 143, 130, 142, 129, 65, 0, 0 };
//ｃｏｎｔｉｎｕｅ　ｔｏ　Ｃｈａｒａｃｔｅｒ　ｓｅｌｅｃｔ。
CHAR dword_4ABBA8[] = { 130, 131, 130, 143, 130, 142, 130, 148, 130, 137, 130, 142, 130, 149, 130, 133, 129, 64, 130, 148, 130, 143, 129, 64, 130, 98, 130, 136, 130, 129, 130, 146, 130, 129, 130, 131, 130, 148, 130, 133, 130, 146, 129, 64, 130, 147, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 66, 0, 0 };
//Ａｓｓｉｇｎ　ｔｅａｍｓ分配团队
CHAR dword_4ABBE4[] = { 130, 96, 130, 147, 130, 147, 130, 137, 130, 135, 130, 142, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 0, 0 };

CHAR word_4ABBFE[] = { 130, 115, 130, 133, 130, 129, 130, 141, 130, 147, 0, 0 };//Ｔｅａｍｓ
//Ｓｅｌｅｃｔ　ｔｈｅ　ｎｕｍｂｅｒ　ｏｆ　ｔｅａｍｓ
CHAR word_4ABC0A[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 142, 130, 149, 130, 141, 130, 130, 130, 133, 130, 146, 129, 64, 130, 143, 130, 134, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 0, 0 };

CHAR dword_4ABC40[] = { 130, 129, 130, 142, 130, 132, 129, 64, 130, 129, 130, 147, 130, 147, 130, 137, 130, 135, 130, 142, 129, 64, 130, 144, 130, 140, 130, 129, 130, 153, 130, 133, 130, 146, 130, 147, 129, 66, 0, 0 };//ａｎｄ　ａｓｓｉｇｎ　ｐｌａｙｅｒｓ。
//Ｓｅｌｅｃｔ　ｉｔｅｍ　ａｎｄ　ｆｒｉｅｎｄｌｙ　ｆｉｒｅ　ｓｅｔｔｉｎｇｓ。选择项目和友军火力设置
CHAR dword_4ABC68[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 137, 130, 148, 130, 133, 130, 141, 129, 64, 130, 129, 130, 142, 130, 132, 129, 64, 130, 134, 130, 146, 130, 137, 130, 133, 130, 142, 130, 132, 130, 140, 130, 153, 129, 64, 130, 134, 130, 137, 130, 146, 130, 133, 129, 64, 130, 147, 130, 133, 130, 148, 130, 148, 130, 137, 130, 142, 130, 135, 130, 147, 129, 66, 0, 0 };

//CHAR dword_4ABCB8[] = { 181, 192, 190, 223, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//dword_4ABCB8 = 0x005fe010 "道具.................."
//ｏｎ　ｃａｕｓｅｓ　ｉｔｅｍｓ　ｔｏ　ａｐｐｅａｒ　ｏｎ　ｄｅｆｅａｔ论项目失败的原因
CHAR dword_4ABCD0[] = { 130, 143, 130, 142, 129, 64, 130, 131, 130, 129, 130, 149, 130, 147, 130, 133, 130, 147, 129, 64, 130, 137, 130, 148, 130, 133, 130, 141, 130, 147, 129, 64, 130, 148, 130, 143, 129, 64, 130, 129, 130, 144, 130, 144, 130, 133, 130, 129, 130, 146, 129, 64, 130, 143, 130, 142, 129, 64, 130, 132, 130, 133, 130, 134, 130, 133, 130, 129, 130, 148, 0, 0 };

//char dword_4ABD18[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0 };//ＯＦＦＯＮ

//CHAR byte_4ABD25[] = { 130, 101, 130, 98, 196, 163, 202, 189, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//byte_4ABD25 = 0x005fdfa4 "俥俠模式.................."
//Ｏｎ　ｅｎａｂｌｅｓ　Ｆｒｉｅｎｄｌｙ　ｆｉｒｅ启用友军火力
CHAR byte_4ABD41[] = { 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 101, 130, 146, 130, 137, 130, 133, 130, 142, 130, 132, 130, 140, 130, 153, 129, 64, 130, 134, 130, 137, 130, 146, 130, 133, 0, 0 };
//ｂｅｔｗｅｅｎ　ｔｅａｍ　ｍａｔｅｓ队友之间
CHAR byte_4ABD73[] = { 130, 130, 130, 133, 130, 148, 130, 151, 130, 133, 130, 133, 130, 142, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 129, 64, 130, 141, 130, 129, 130, 148, 130, 133, 130, 147, 0, 0 };

//CHAR byte_4ABD99[] = { 186, 207, 204, 229, 188, 188, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//byte_4ABD99 = 0x005fe0dc "合体技................"
//Ｏｎ　ａｌｌｏｗｓ　ｃｏｍｂｉｎａｔｉｏｎ　ａｔｔａｃｋｓ
CHAR byte_4ABDB1[] = { 130, 110, 130, 142, 129, 64, 130, 129, 130, 140, 130, 140, 130, 143, 130, 151, 130, 147, 129, 64, 130, 131, 130, 143, 130, 141, 130, 130, 130, 137, 130, 142, 130, 129, 130, 148, 130, 137, 130, 143, 130, 142, 129, 64, 130, 129, 130, 148, 130, 148, 130, 129, 130, 131, 130, 139, 130, 147, 0, 0 };

//CHAR byte_4ABDED[] = { 206, 228, 198, 247, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 }; //byte_4ABDED = 0x005fe130 "武器.........."

//byte_4ABDFD = 0x005fe140 "选择武器数量丅........................................................"
CHAR byte_4ABDFD[] = { 209, 161, 212, 241, 206, 228, 198, 247, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//byte_4ABE45 = 0x005fe188 "场景伤害陷阱............"
//CHAR byte_4ABE45[] = { 179, 161, 190, 176, 201, 203, 186, 166, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//Ｏｎ　ｅｎａｂｌｅｓ　ｔｅｒｒａｉｎ　ｈａｚａｒｄｓ
CHAR byte_4ABE5F[] = { 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 148, 130, 133, 130, 146, 130, 146, 130, 129, 130, 137, 130, 142, 129, 64, 130, 136, 130, 129, 130, 154, 130, 129, 130, 146, 130, 132, 130, 147, 0, 0 };

//char byte_4ABE95[] = { 130, 110, 130, 134, 130, 134, 0, 130, 110, 130, 142, 0, 0 };//ＯｆｆＯｎ

//word_4ABEA2 = 0x005fe1ec "场景死亡陷阱........"
//CHAR word_4ABEA2[] = { 179, 161, 190, 176, 203, 192, 205, 246, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//Ｏｎ　ｅｎａｂｌｅｓ　ｉｎｓｔａｎｔ　ｄｅａｔｈ　ｈａｚａｒｄｓ
CHAR dword_4ABEB8[] = { 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 137, 130, 142, 130, 147, 130, 148, 130, 129, 130, 142, 130, 148, 129, 64, 130, 132, 130, 133, 130, 129, 130, 148, 130, 136, 129, 64, 130, 136, 130, 129, 130, 154, 130, 129, 130, 146, 130, 132, 130, 147, 0, 0 };

//char word_4ABEFA[] = { 130, 110, 130, 142, 0, 130, 110, 130, 134, 130, 134, 0, 0, 129, 64, 129, 64, 129, 64, 129, 64, 201, 232, 214, 195, 46, 0, 207, 212, 202, 190, 129, 64, 130, 101, 130, 111, 130, 114, 0, 0, 0, 0, 0, 0 };//ＯｎＯｆｆ　　　　??靹??.????????　ＦＰＳ

//CHAR byte_4ABF27[] = { 130, 110, 130, 109, 129, 64, 130, 132, 130, 137, 130, 147, 130, 144, 130, 140, 130, 129, 130, 153, 130, 147, 129, 64, 130, 101, 130, 111, 130, 114, 129, 64, 130, 131, 130, 143, 130, 149, 130, 142, 130, 148, 130, 133, 130, 146, 0, 0 };//ＯＮ　ｄｉｓｐｌａｙｓ　ＦＰＳ　ｃｏｕｎｔｅｒ

//CHAR byte_4ABF57[] = { 79, 78, 0 };//ON

//int off_4ABF5A;

//word_4ABF5E = 0x005fe2ac "游戏速度.."
//CHAR word_4ABF5E[] = { 211, 206, 207, 183, 203, 217, 182, 200, 46, 46, 0, 0 };

//word_4ABF6A = 0x005fe2b8 "选择游戏的速度丅.........................."
//CHAR word_4ABF6A[] = { 209, 161, 212, 241, 211, 206, 207, 183, 181, 196, 203, 217, 182, 200, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//CHAR a100[] = { 49, 48, 48, 37, 37, 0 };

//CHAR a50[] = { 32, 53, 48, 37, 37, 0 };
 //CHAR a66[] = { 32, 54, 54, 37, 37, 0 };
 //CHAR a75[] = { 32, 55, 53, 37, 37, 0 };
 //CHAR a80[] = { 32, 56, 48, 37, 37, 0 };
 //CHAR a83[] = { 32, 56, 51, 37, 37, 0 };
 //CHAR a85[] = { 32, 56, 53, 37, 37, 0 };
 //CHAR a87[] = { 32, 56, 55, 37, 37, 0 };
 //CHAR a88[] = { 32, 56, 56, 37, 37, 0 };
 //CHAR a90[] = { 32, 57, 48, 37, 37, 0 };

//CHAR word_4ABFD2[] = { 130, 103, 130, 137, 130, 148, 130, 114, 130, 148, 130, 143, 130, 144, 0, 0, 130, 98, 130, 140, 130, 143, 130, 142, 130, 133, 130, 98, 130, 136, 130, 129, 130, 146, 0, 0 };//ＨｉｔＳｔｏｐＣｌｏｎｅＣｈａｒ
 //CHAR aD_9[] = { 37, 100, 0 };

//CHAR a1d[] = { 37, 49, 100, 0, 0, 0, 0 };//%1d


 //--------------------------------------------------
//byte_4B2D5B = 0x005fe310 "选择难度丅........................"
CHAR byte_4B2D5B[] = { 209, 161, 212, 241, 196, 209, 182, 200, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0, 0, 0, 0, 0, 0 };
//byte_4B08F8 = 0x005fe33c "选择队伍................"
CHAR byte_4B08F8[] = { 209, 161, 212, 241, 182, 211, 206, 233, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0, 0, 0, 0, 0, 0, 0 };
//Ｌｅｆｔ／Ｒｉｇｈｔ：　ｐｌａｙｅｒ　　Ｕｐ／Ｄｏｗｎ：　ｔｅａｍ
CHAR byte_4B3438[] = { 130, 107, 130, 133, 130, 134, 130, 148, 129, 94, 130, 113, 130, 137, 130, 135, 130, 136, 130, 148, 129, 70, 129, 64, 130, 144, 130, 140, 130, 129, 130, 153, 130, 133, 130, 146, 129, 64, 129, 64, 130, 116, 130, 144, 129, 94, 130, 99, 130, 143, 130, 151, 130, 142, 129, 70, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
//Ｓｔａｒｔ　ｆｒｏｍ　ｔｈｅ　ｂｅｇｉｎｎｉｎｇ　ｏｒ　ｆｒｏｍ　ａ\nｓａｖｅｄ　ｇａｍｅ？
CHAR byte_4B1EC4[] = { 130, 114, 130, 148, 130, 129, 130, 146, 130, 148, 129, 64, 130, 134, 130, 146, 130, 143, 130, 141, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 130, 130, 133, 130, 135, 130, 137, 130, 142, 130, 142, 130, 137, 130, 142, 130, 135, 129, 64, 130, 143, 130, 146, 129, 64, 130, 134, 130, 146, 130, 143, 130, 141, 129, 64, 130, 129, 92, 110, 130, 147, 130, 129, 130, 150, 130, 133, 130, 132, 129, 64, 130, 135, 130, 129, 130, 141, 130, 133, 129, 72, 0, 0 };
//byte_4B1F3E = 0x005fe35c "玩家的数量丅......................"
CHAR byte_4B1F3E[] = { 205, 230, 188, 210, 181, 196, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//１　ｔｅａｍ　１Ｐ　ｓｉｎｇｌｅ　ｍａｔｃｈ　ｏｒ
CHAR byte_4AF95F[] = { 130, 80, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 129, 64, 130, 80, 130, 111, 129, 64, 130, 147, 130, 137, 130, 142, 130, 135, 130, 140, 130, 133, 129, 64, 130, 141, 130, 129, 130, 148, 130, 131, 130, 136, 129, 64, 130, 143, 130, 146, 0, 0 };
//１　ｔｅａｍ　２Ｐ　ｔａｇ　ｍａｔｃｈ
CHAR byte_4AF993[] = { 130, 80, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 129, 64, 130, 81, 130, 111, 129, 64, 130, 148, 130, 129, 130, 135, 129, 64, 130, 141, 130, 129, 130, 148, 130, 131, 130, 136, 0, 0 };
//byte_4AF9DC = 0x005fe4bc "选择玩家的数量丅............................................"
CHAR byte_4AF9DC[] = { 209, 161, 212, 241, 205, 230, 188, 210, 181, 196, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

int byte_4AFA1A;
//Ｏｎ　ｃａｕｓｅｓ　ｉｔｅｍｓ　ｔｏ　ｓｐａｗｎ　ｏｎ　ｄｅｆｅａｔ
CHAR byte_4AFA2E[] = { 130, 110, 130, 142, 129, 64, 130, 131, 130, 129, 130, 149, 130, 147, 130, 133, 130, 147, 129, 64, 130, 137, 130, 148, 130, 133, 130, 141, 130, 147, 129, 64, 130, 148, 130, 143, 129, 64, 130, 147, 130, 144, 130, 129, 130, 151, 130, 142, 129, 64, 130, 143, 130, 142, 129, 64, 130, 132, 130, 133, 130, 134, 130, 133, 130, 129, 130, 148, 0, 0 };

int byte_4AFA74;
//byte_4AFA91 = 0x005fe570 "选择武器的数量丅...................................................."
CHAR byte_4AFA91[] = { 209, 161, 212, 241, 206, 228, 198, 247, 181, 196, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//Ｏｎ　ｄｉｓｐｌａｙｓ　ｔｈｅ　ｓｃｏｒｅ
CHAR byte_4AFAE3[] = { 130, 110, 130, 142, 129, 64, 130, 132, 130, 137, 130, 147, 130, 144, 130, 140, 130, 129, 130, 153, 130, 147, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 147, 130, 131, 130, 143, 130, 146, 130, 133, 0, 0 };

int byte_4AFB0F;
//Ｏｎ　ｅｎａｂｌｅｓ　ｔｅｒｒａｉｎ　ｈａｚａｒｄｓ
CHAR byte_4AFB36[] = { 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 148, 130, 133, 130, 146, 130, 146, 130, 129, 130, 137, 130, 142, 129, 64, 130, 136, 130, 129, 130, 154, 130, 129, 130, 146, 130, 132, 130, 147, 0, 0 };
//Ｏｎ　ｅｎａｂｌｅｓ　ｉｎｓｔａｎｔ　ｄｅａｔｈ　ｈａｚａｒｄｓ
CHAR byte_4AFB82[] = { 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 137, 130, 142, 130, 147, 130, 148, 130, 129, 130, 142, 130, 148, 129, 64, 130, 132, 130, 133, 130, 129, 130, 148, 130, 136, 129, 64, 130, 136, 130, 129, 130, 154, 130, 129, 130, 146, 130, 132, 130, 147, 0, 0 };
//Ｆｒｅｑｕｅｎｃｙ　ｉｎｃｒｅａｓｅｓ　ｗｉｔｈ　ｓｃｏｒｅ
CHAR byte_4AFBC4[] = { 130, 101, 130, 146, 130, 133, 130, 145, 130, 149, 130, 133, 130, 142, 130, 131, 130, 153, 129, 64, 130, 137, 130, 142, 130, 131, 130, 146, 130, 133, 130, 129, 130, 147, 130, 133, 130, 147, 129, 64, 130, 151, 130, 137, 130, 148, 130, 136, 129, 64, 130, 147, 130, 131, 130, 143, 130, 146, 130, 133, 0, 0 };

//选择比赛的数量
CHAR byte_4AF917[] = { 209, 161, 212, 241, 177, 200, 200, 252, 181, 196, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//Ｏｎ　ａｌｌｏｗｓ　ｃｏｍｂｉｎａｔｉｏｎ　ａｔｔａｃｋｓ
CHAR byte_4AFC64[] = { 130, 110, 130, 142, 129, 64, 130, 129, 130, 140, 130, 140, 130, 143, 130, 151, 130, 147, 129, 64, 130, 131, 130, 143, 130, 141, 130, 130, 130, 137, 130, 142, 130, 129, 130, 148, 130, 137, 130, 143, 130, 142, 129, 64, 130, 129, 130, 148, 130, 148, 130, 129, 130, 131, 130, 139, 130, 147, 0, 0 };
//　Ｏｎ　ｅｎａｂｌｅｓ　Ｆｒｉｅｎｄｌｙ　ｆｉｒｅ　ｂｅｔｗｅｅｎ　ｔｅａｍ　ｍａｔｅｓ
CHAR byte_4AFCBA[] = { 129, 64, 130, 110, 130, 142, 129, 64, 130, 133, 130, 142, 130, 129, 130, 130, 130, 140, 130, 133, 130, 147, 129, 64, 130, 101, 130, 146, 130, 137, 130, 133, 130, 142, 130, 132, 130, 140, 130, 153, 129, 64, 130, 134, 130, 137, 130, 146, 130, 133, 129, 64, 130, 130, 130, 133, 130, 148, 130, 151, 130, 133, 130, 133, 130, 142, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 129, 64, 130, 141, 130, 129, 130, 148, 130, 133, 130, 147, 0, 0 };

//Ａｓｓｉｇｎ　ｐｌａｙｅｒｓ　ｔｏ　ｔｅａｍｓ
CHAR byte_4AFD3D[] = { 130, 96, 130, 147, 130, 147, 130, 137, 130, 135, 130, 142, 129, 64, 130, 144, 130, 140, 130, 129, 130, 153, 130, 133, 130, 146, 130, 147, 129, 64, 130, 148, 130, 143, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 0, 0 };

int byte_4AFD6D;

//选择队伍
CHAR byte_4AFC32[] = { 209, 161, 212, 241, 182, 211, 206, 233, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

CHAR byte_4B0BEC[] = { 129, 64, 0, 0 };//　

CHAR byte_4B0BF0[] = { 129, 64, 0, 0 };//　

//Ａ　ｔｏｕｒｎａｍｅｎｔ　ｗｈｅｒｅ　ｙｏｕ　ｆｉｇｈｔ　ｍｕｌｔｉｐｌｅ
CHAR byte_4B1616[] = { 130, 96, 129, 64, 130, 148, 130, 143, 130, 149, 130, 146, 130, 142, 130, 129, 130, 141, 130, 133, 130, 142, 130, 148, 129, 64, 130, 151, 130, 136, 130, 133, 130, 146, 130, 133, 129, 64, 130, 153, 130, 143, 130, 149, 129, 64, 130, 134, 130, 137, 130, 135, 130, 136, 130, 148, 129, 64, 130, 141, 130, 149, 130, 140, 130, 148, 130, 137, 130, 144, 130, 140, 130, 133, 0, 0 };

//ｔｅａｍｓ　ｆｏｒ　ｔｈｅ　ｃｈａｍｐｉｏｎｓｈｉｐ
CHAR byte_4B1662[] = { 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 129, 64, 130, 134, 130, 143, 130, 146, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 131, 130, 136, 130, 129, 130, 141, 130, 144, 130, 137, 130, 143, 130, 142, 130, 147, 130, 136, 130, 137, 130, 144, 0, 0 };

//Ｃｈａｎｇｅ　ｏｐｔｉｏｎｓ
CHAR byte_4B1698[] = { 130, 98, 130, 136, 130, 129, 130, 142, 130, 135, 130, 133, 129, 64, 130, 143, 130, 144, 130, 148, 130, 137, 130, 143, 130, 142, 130, 147, 0, 0 };

CHAR byte_4B0BA4_2[] = { 130, 101, 130, 137, 130, 135, 130, 136, 130, 148, 129, 64, 130, 148, 130, 136, 130, 146, 130, 143, 130, 149, 130, 135, 130, 136, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 114, 130, 148, 130, 143, 130, 146, 130, 153, 0, 0 };//Ｆｉｇｈｔ　ｔｈｒｏｕｇｈ　ｔｈｅ　Ｓｔｏｒｙ


//byte_4B0BF4 = 0x005fe874 "武器"
CHAR byte_4B0BF4[] = { 206, 228, 198, 247, 0, 0 };
//速度
CHAR byte_4B1559[] = { 203, 217, 182, 200, 0, 0, 0, 0 };
//byte_4B1551 = 0x005fe884 "防御"
CHAR byte_4B1551[] = { 183, 192, 211, 249, 0, 0, 0, 0 };
//byte_4B0BFA = 0x005fe88c "武器投...
CHAR byte_4B0BFA[] = { 206, 228, 198, 247, 205, 182 };
//byte_4B0B96 = 0x005fe794 "跳......"
CHAR byte_4B0B96[] = { 204, 248, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4B1561 = 0x005fe894 "反击"
CHAR byte_4B1561[] = { 183, 180, 187, 247, 0, 0, 0, 0 };
//byte_4B0B78 = 0x005fe89c "拳"
CHAR byte_4B0B78[] = { 200, 173, 0, 0, 0, 0, 0, 0, 0, 0 };
//byte_4B0B82 = 0x005fe8a8 "腿"
CHAR byte_4B0B82[] = { 205, 200, 0, 0, 0, 0, 0, 0, 0, 0 };
//byte_4B0B8C = 0x005f39e8 "投"
CHAR byte_4B0B8C[] = { 205, 182, 0, 0, 0, 0, 0, 0, 0, 0 };

CHAR dword_4B0A31[] = { 130, 103, 130, 111, 0, 0, 0 };//ＨＰ

//ＶＳ
CHAR byte_4B25F6[] = { 130, 117, 130, 114, 0, 0 };

//＆
CHAR byte_4B2654[] = { 129, 149, 0, 0 };

//Here·s your next opponent
CHAR byte_4B2850[] = { 130, 103, 130, 133, 130, 146, 130, 133, 129, 69, 130, 147, 129, 64, 130, 153, 130, 143, 130, 149, 130, 146, 129, 64, 130, 142, 130, 133, 130, 152, 130, 148, 129, 64, 130, 143, 130, 144, 130, 144, 130, 143, 130, 142, 130, 133, 130, 142, 130, 148, 0, 0 };

//Go get·em！
CHAR byte_4B2930[] = { 130, 102, 130, 143, 129, 64, 130, 135, 130, 133, 130, 148, 129, 64, 129, 69, 130, 133, 130, 141, 129, 73, 0, 0 };

CHAR byte_4B2884[] = { 129, 70, 0, 0 };//：

CHAR byte_4B2973[] = { 130, 103, 130, 133, 130, 146, 130, 133, 129, 64, 130, 129, 130, 146, 130, 133, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 146, 130, 133, 130, 147, 130, 149, 130, 140, 130, 148, 130, 147, 129, 73, 0, 0 };//Ｈｅｒｅ　ａｒｅ　ｔｈｅ　ｒｅｓｕｌｔｓ！

CHAR byte_4B309C[] = { 130, 102, 130, 143, 130, 143, 130, 132, 129, 64, 130, 135, 130, 129, 130, 141, 130, 133, 129, 65, 129, 64, 130, 133, 130, 150, 130, 133, 130, 146, 130, 153, 130, 143, 130, 142, 130, 133, 129, 73, 0, 0 };//Ｇｏｏｄ　ｇａｍｅ、　ｅｖｅｒｙｏｎｅ！
//排名
CHAR byte_4B299F[] = { 129, 64, 129, 64, 36, 49, 197, 197, 195, 251, 36, 49, 46, 46, 46, 46, 46, 46, 0, 0 };

CHAR byte_4B288C[] = { 129, 70, 0, 0 };//：

CHAR byte_4B30C6[] = { 130, 103, 130, 133, 130, 146, 130, 133, 129, 64, 130, 129, 130, 146, 130, 133, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 131, 130, 149, 130, 146, 130, 146, 130, 133, 130, 142, 130, 148, 129, 64, 130, 146, 130, 129, 130, 142, 130, 139, 130, 137, 130, 142, 130, 135, 130, 147, 129, 73, 0, 0 };//Ｈｅｒｅ　ａｒｅ　ｔｈｅ　ｃｕｒｒｅｎｔ　ｒａｎｋｉｎｇｓ！

CHAR byte_4B3104[] = { 130, 106, 130, 137, 130, 131, 130, 139, 129, 64, 130, 129, 130, 147, 130, 147, 129, 64, 130, 129, 130, 142, 130, 132, 129, 64, 130, 129, 130, 137, 130, 141, 129, 64, 130, 134, 130, 143, 130, 146, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 131, 130, 136, 130, 129, 130, 141, 130, 144, 130, 137, 130, 143, 130, 142, 130, 147, 130, 136, 130, 137, 130, 144, 129, 73, 0, 0 };//Ｋｉｃｋ　ａｓｓ　ａｎｄ　ａｉｍ　ｆｏｒ　ｔｈｅ　ｃｈａｍｐｉｏｎｓｈｉｐ！

CHAR byte_4B21F0[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 151, 130, 136, 130, 133, 130, 148, 130, 136, 130, 133, 130, 146, 129, 64, 130, 134, 130, 146, 130, 137, 130, 133, 130, 142, 130, 132, 130, 140, 130, 153, 129, 64, 130, 134, 130, 137, 130, 146, 130, 133, 0, 0 };//Ｓｅｌｅｃｔ　ｗｈｅｔｈｅｒ　ｆｒｉｅｎｄｌｙ　ｆｉｒｅ

CHAR byte_4B222A[] = { 130, 104, 130, 147, 129, 64, 130, 143, 130, 142, 129, 64, 130, 143, 130, 146, 129, 64, 130, 143, 130, 134, 130, 134, 129, 66, 0, 0 };//Ｉｓ　ｏｎ　ｏｒ　ｏｆｆ。

CHAR byte_4B226A[] = { 130, 96, 129, 64, 130, 140, 130, 143, 130, 129, 130, 132, 129, 64, 130, 98, 130, 111, 130, 116, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 129, 64, 130, 147, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 130, 137, 130, 143, 130, 142, 130, 147, 129, 64, 130, 134, 130, 146, 130, 143, 130, 141, 129, 64, 130, 129, 0, 0 };//Ａ　ｌｏａｄ　ＣＰＵ　ｔｅａｍ　ｓｅｌｅｃｔｉｏｎｓ　ｆｒｏｍ　ａ

CHAR byte_4B22AE[] = { 130, 134, 130, 137, 130, 140, 130, 133, 129, 64, 130, 143, 130, 146, 129, 64, 130, 97, 129, 64, 130, 135, 130, 133, 130, 142, 130, 133, 130, 146, 130, 129, 130, 148, 130, 133, 129, 64, 130, 148, 130, 136, 130, 133, 130, 141, 129, 64, 130, 146, 130, 129, 130, 142, 130, 132, 130, 143, 130, 141, 130, 140, 130, 153, 129, 66, 0, 0 };//ｆｉｌｅ　ｏｒ　Ｂ　ｇｅｎｅｒａｔｅ　ｔｈｅｍ　ｒａｎｄｏｍｌｙ。
//byte_4B2302 = 0x005feb70 "选择武器数量丅................................................................"
CHAR byte_4B2302[] = { 209, 161, 212, 241, 206, 228, 198, 247, 202, 253, 193, 191, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

CHAR byte_4B2372[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 136, 130, 143, 130, 151, 129, 64, 130, 141, 130, 129, 130, 142, 130, 153, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 129, 64, 130, 151, 130, 137, 130, 140, 130, 140, 129, 64, 130, 130, 130, 133, 0, 0 };//Ｓｅｌｅｃｔ　ｈｏｗ　ｍａｎｙ　ｔｅａｍｓ　ｗｉｌｌ　ｂｅ

CHAR byte_4B23AE[] = { 130, 144, 130, 129, 130, 146, 130, 148, 130, 137, 130, 131, 130, 137, 130, 144, 130, 129, 130, 148, 130, 137, 130, 142, 130, 135, 129, 64, 130, 137, 130, 142, 129, 64, 130, 148, 130, 136, 130, 133, 129, 64, 130, 148, 130, 143, 130, 149, 130, 146, 130, 142, 130, 129, 130, 141, 130, 133, 130, 142, 130, 148, 129, 66, 0, 0 };//ｐａｒｔｉｃｉｐａｔｉｎｇ　ｉｎ　ｔｈｅ　ｔｏｕｒｎａｍｅｎｔ。

CHAR byte_4B2406[] = { 130, 114, 130, 133, 130, 140, 130, 133, 130, 131, 130, 148, 129, 64, 130, 136, 130, 143, 130, 151, 129, 64, 130, 141, 130, 129, 130, 142, 130, 153, 129, 64, 130, 148, 130, 133, 130, 129, 130, 141, 130, 147, 129, 64, 130, 144, 130, 133, 130, 146, 129, 64, 130, 141, 130, 129, 130, 148, 130, 131, 130, 136, 0, 0 };//Ｓｅｌｅｃｔ　ｈｏｗ　ｍａｎｙ　ｔｅａｍｓ　ｐｅｒ　ｍａｔｃｈ
//byte_4B2762 = 0x005feb34 "开乛关丂合体技丅.........................................."
CHAR byte_4B2762[] = { 191, 170, 129, 94, 185, 216, 129, 64, 186, 207, 204, 229, 188, 188, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//索耶/克里科马夫蠑西。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。
//byte_4B2A16 = 0x005fec04 "开乛关丂场景伤害陷阱丅.................................."
CHAR byte_4B2A16[] = { 191, 170, 129, 94, 185, 216, 129, 64, 179, 161, 190, 176, 201, 203, 186, 166, 207, 221, 218, 229, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//索耶/凯利。水獭B。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。
//byte_4B1F78 = 0x005fec80 "选择难度丅........................"
CHAR byte_4B1F78[] = { 209, 161, 212, 241, 196, 209, 182, 200, 129, 66, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//CharData.txt
CHAR aChardataTxt[] = { 67, 104, 97, 114, 68, 97, 116, 97, 46, 116, 120, 116, 0, 0, 0, 0 };

CHAR aGraphicFaceBmp[] = { 71, 114, 97, 112, 104, 105, 99, 92, 70, 97, 99, 101, 46, 98, 109, 112, 0, 0, 0, 0 };//Graphic\Face.bmp
//byte_4AF907 = 0x005fecc8 "比赛数........"
CHAR byte_4AF907[] = { 177, 200, 200, 252, 202, 253, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AF949 = 0x005fecd8 "战斗模式............"
CHAR byte_4AF949[] = { 213, 189, 182, 183, 196, 163, 202, 189, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//哈斯。。。。。。。。。。。。byte_4AF949 = 0x005fecd8 "战斗模式............"

unk byte_4AF9BB[] = { 130, 80, 200, 203, 46, 46, 46, 46, 0, 130, 81, 200, 203, 46, 46, 0, 0 };//１????....２????..byte_4AF9BB = 0x005fecf0 "侾人...."
//byte_4AF9CC = 0x005fed04 "玩家数........"
CHAR byte_4AF9CC[] = { 205, 230, 188, 210, 202, 253, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AFA1C = 0x005fed14 "道具............"
CHAR byte_4AFA1C[] = { 181, 192, 190, 223, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//我爱你。。。。。。。。。。。。byte_4AFA1C = 0x005fed14 "道具............"

unk byte_4AFA76[] = { 130, 110, 130, 134, 130, 134, 0, 130, 110, 130, 142, 0, 0 };//ＯｆｆＯｎ
//byte_4AFA83 = 0x005fed38 "武器数量...."
CHAR byte_4AFA83[] = { 206, 228, 198, 247, 202, 253, 193, 191, 46, 46, 46, 46, 0, 0 }; //byte_4AFA83 = 0x005fed38 "武器数量...."
//byte_4AFAD7 = 0x005fed48 "显示分数.."
CHAR byte_4AFAD7[] = { 207, 212, 202, 190, 183, 214, 202, 253, 46, 46, 0, 0 };//byte_4AFAD7 = 0x005fed48 "显示分数.."
//byte_4AFB11 = 0x005fed54 "关...."
unk byte_4AFB11[] = { 185, 216, 46, 46, 46, 46, 0, 191, 170, 46, 46, 0, 0 };//????....????..//byte_4AFB11 = 0x005fed54 "关...."
//byte_4AFB1E = 0x005fed64 "场景伤害陷阱.........."
CHAR byte_4AFB1E[] = { 179, 161, 190, 176, 201, 203, 186, 166, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AFB6C = 0x005fed7c "场景死亡陷阱........"
CHAR byte_4AFB6C[] = { 179, 161, 190, 176, 203, 192, 205, 246, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AFC02 = 0x005fed94 "开.."
unk byte_4AFC02[] = { 191, 170, 46, 46, 0, 185, 216, 46, 46, 46, 46, 0, 183, 214, 202, 253, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AFC1A = 0x005fedac "队伍选择.............."
CHAR byte_4AFC1A[] = { 182, 211, 206, 233, 209, 161, 212, 241, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };
//byte_4AFC4C = 0x005fedc4 "合体技................"
CHAR byte_4AFC4C[] = { 186, 207, 204, 229, 188, 188, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//小麦粉。。。。。。。。。。。。。。。。
//byte_4AFCA0 = 0x005feddc "俥俠模式................"
CHAR byte_4AFCA0[] = { 130, 101, 130, 98, 196, 163, 202, 189, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };//哈斯。。。。。。。。。。。。。。。。

//byte_4AFD14 = 0x005fedf8 "关...."
unk byte_4AFD14[] = { 185, 216, 46, 46, 46, 46, 0, 191, 170, 46, 46, 0, 0 };

CHAR byte_4AFD21[] = { 130, 96, 130, 147, 130, 147, 130, 137, 130, 135, 130, 142, 130, 111, 130, 140, 130, 129, 130, 153, 130, 133, 130, 146, 130, 147, 0, 0 };//ＡｓｓｉｇｎＰｌａｙｅｒｓ

//难度 记录
CHAR byte_4B2D45[] = { 196, 209, 182, 200, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 129, 64, 188, 199, 194, 188, 0, 0 };

CHAR byte_4B17DC[] = { 130, 97, 130, 129, 130, 130, 130, 153, 0, 0 };

//Ｋｉｄ
CHAR byte_4B17E6[] = { 130, 106, 130, 137, 130, 132, 0, 0, 0, 0 };

//Ｍａｎ
CHAR byte_4B2E1E[] = { 130, 108, 130, 129, 130, 142, 0, 0, 0, 0 };

//Ｎｕｔｓ
CHAR byte_4B2EF6[] = { 130, 109, 130, 149, 130, 148, 130, 147, 0, 0 };

//　
CHAR byte_4B17D4[] = { 129, 64, 0, 0 };//　

//>>
CHAR asc_4B17D8[] = { 62, 62, 0, 0 };

//byte_4B1F62 = 0x005fee74 "难度................"
CHAR byte_4B1F62[] = { 196, 209, 182, 200, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//１......２....３....４......５........
unk byte_4B1F9C[] = { 130, 80, 46, 46, 46, 46, 46, 46, 0, 130, 81, 46, 46, 46, 46, 0, 130, 82, 46, 46, 46, 46, 0, 130, 83, 46, 46, 46, 46, 46, 46, 0, 130, 84, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//byte_4B21D4 = 0x005feeb8 "俥俠 模式.................."
CHAR byte_4B21D4[] = { 130, 101, 130, 98, 196, 163, 202, 189, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//ＯＦＦＯＮ
unk byte_4B0C59[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0, 0, 0 };

//byte_4B2246 = 0x005feee4 "俠俹倀 队伍设置...................."
CHAR byte_4B2246[] = { 130, 98, 130, 111, 130, 116, 182, 211, 206, 233, 201, 232, 214, 195, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//　　Ａ　　Ｂ
unk byte_4B1FC8[] = { 129, 64, 129, 64, 130, 96, 0, 129, 64, 129, 64, 130, 97, 0, 0 };

//byte_4B22F2 = 0x005fef18 "武器"
CHAR byte_4B22F2[] = { 206, 228, 198, 247, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

//byte_4B2352 = 0x005fef28 "队伍数量......................"
CHAR byte_4B2352[] = { 182, 211, 206, 233, 202, 253, 193, 191, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//byte_4B2746 = 0x005fef48 "合体技...................."
CHAR byte_4B2746[] = { 186, 207, 204, 229, 188, 188, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//byte_4B279E = 0x005fef64 "伤害陷阱.................."
CHAR byte_4B279E[] = { 201, 203, 186, 166, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//byte_4B2A50 = 0x005fef80 "关...."
unk byte_4B2A50[] = { 185, 216, 46, 46, 46, 46, 0, 191, 170, 46, 46, 0, 0 };

//byte_4B2A5D = 0x005fef90 "死亡陷阱.............."
CHAR byte_4B2A5D[] = { 203, 192, 205, 246, 207, 221, 218, 229, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 46, 0, 0 };

//ＯＦＦＯＮ
unk byte_4B2A75[] = { 130, 110, 130, 101, 130, 101, 0, 130, 110, 130, 109, 0, 0 };

//不管
unk dword_4B8768[] = { 0, 4, 0, 0, 1, 252, 255, 255, 53, 0, 0, 0, 11, 0, 0, 0, 64, 0, 0, 0, 255, 3, 0, 0 };//函数
//不管
unk dword_4B8780[] = { 128, 0, 0, 0, 129, 255, 255, 255, 24, 0, 0, 0, 8, 0, 0, 0, 32, 0, 0, 0, 127, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//__函数
void* MessageBoxA_0;


